{"passage_uid": "8c92c1b5-2b0d-41a3-b4f4-1b590557042e", "text": "The Green Porftolio Attestation Requirement. The Authorised Person acting as Investment Manager of an ADGM Green Portfolio must appoint a third party to attest to its compliance with the Green Portfolio Investment Requirement on an ongoing basis and at least annually. This requirement only applies to that portion of the Eligible Green Portfolio Assets that is invested in assets aligned with an Acceptable Green Taxonomy in accordance with Rule ‎3.8.4(a). This requirement is referred to as the “Green Portfolio Attestation Requirement”.", "passage_id": "3.8.6"}
{"passage_uid": "9c6ac3b6-ffca-4e6e-a0d2-7252f3e4be86", "text": "Under Rule 3.8.6, the Green Portfolio Attestation Requirement does not apply to Eligible Green Portfolio Assets which are included in or otherwise track an EU Paris Aligned Benchmark in accordance with Rule ‎3.8.4(b).", "passage_id": "3.8.6.Guidance.1"}
{"passage_uid": "47678f27-9e0b-4782-949a-f38e84a7442d", "text": "An Authorised Person must maintain a master list of all Client Accounts. The master list must detail:\n(a)\tthe name of the account;\n(b)\tthe account number;\n(c)\tthe location of the account;\n(d)\tthe bank, its address and contact information;\n(e)\tthe account terms and conditions;\n(f)\twhether the account is currently open or closed; and\n(g)\tthe date of opening or closure.", "passage_id": "14.6.2"}
{"passage_uid": "803ff2b9-9528-459a-b9d2-45066785e9f5", "text": "The following records must be included in the Resolution Pack of an Authorised Person conducting Investment Business:\n(a)\tRules ‎2.7.1 and ‎3.7.1(d) (records of Client classification and Client agreements);\n(b)\tRules 14.6.2 and ‎15.4.3 (master lists of all Client Accounts in relation to Client Money and Client investments);\n(c)\tRule ‎15.4.4 and Rule ‎15.4.5 (adequate records and Client's written permission re use of Client Investments);\n(d)\tRules 14.7.1 and 14.7.4 (assessment of appropriateness of Third-Party Agent and acknowledgement by Third-Party agent in respect of Client Money); and\n(e)\tRule ‎15.5.1 and 15.6.1 (assessment of appropriateness of Third Party Agent and acknowledgement by Third-Party Agent in respect of Client Investments); and\n(f)\tRule 14.11.1 and ‎15.9.1 (most recent reconciliations of Client Money and Client Investments).", "passage_id": "16.4.1"}
{"passage_uid": "c00769cc-c353-4c08-86ed-2b5baae1cc49", "text": "Unless otherwise agreed in writing between a Third Party Provider and their Customer, the Governing Contract between the Third Party Provider and their Customers must contain the following information –\n(a)\tabout the Third Party Provider:\n(i)\tthe name of the Third Party Provider;\n(ii)\tthe address and contact details of the Third Party Provider’s office in ADGM;\n(iii)\tthe name of the Regulator of the Third Party Provider, and details of the Third Party Provider’s Financial Service Permission;\n(b)\tabout the Third Party Services:\n(i)\ta description of the main characteristics of the Third Party Services to be provided;\n(ii)\tthe information or unique identifier that must be provided by the Customer in order for a Third Party Transaction to occur;\n(iii)\tthe form and procedure for giving consent to a Third Party Transaction;\n(iv)\tthe time of receipt of a Third Party Transaction;\n(v)\tthe maximum time taken for the Third Party Services to be provided; and\n(vi)\tany limits for the use of the Third Party Services;\n(c)\tabout charges and exchange rates:\n(i)\tdetails of all charges payable by the Customer to the Third Party Provider, including those connected to  information which is provided or made available and, where applicable, a breakdown of the amounts of all charges;\n(ii)\twhere relevant, details of the exchange rates to be applied or, if Reference Exchange Rates are to be used, the method of calculating the relevant date for determining such Reference Exchange Rates;\n(iii)\twhere relevant and if agreed, the application of changes in Reference Exchange Rates and information requirements relating to any such changes;\n(d)\tabout communication:\n(i)\tthe means of communication agreed between the parties for the transmission of information or notifications including, where relevant, any technical requirements for the Customer’s equipment and software for receipt of the information or notifications;\n(ii)\tthe manner in which and frequency with which information under this Chapter is to be provided or made available;\n(iii)\twhat information relating to the Customer will be transferred to the Customer’s Financial Institution as part of a Third Party Transaction;\n(iv)\tthe Customer’s right to receive the revised terms of the Governing Contract and any other information in accordance with Rule 20.2.5;\n(e)\tabout safeguards and corrective measures:\n(i)\thow and within what period of time the Customer must notify the Third Party Provider of any unauthorised or incorrectly executed Third Party Transaction;\n(ii)\tthe secure procedure by which the Third Party Provider will contact the Customer in the event of suspected or actual fraud or security threats;\n(iii)\twhere relevant, the conditions under which the Third Party Provider proposes to reserve the right to stop or prevent a Third Party Transaction from being executed;\n(iv)\tthe Customer’s liability under Rule 20.12.6 including details of any limits on such liability;\n(v)\tthe Third Party Provider’s liability for unauthorised Third Party Transactions under Rule 20.12.5;\n(vi)\tthe conditions for the payment of any refund to the Customer under this Chapter\n(f)\tabout changes to and termination of the contractual arrangement:\n(i)\twhere relevant, the proposed terms under which the Customer will be deemed to have accepted changes to the Governing Contract in accordance with Rule 20.2.6, unless they notify the Third Party Provider that they do not accept such changes before the proposed date of their entry into force;\n(ii)\tthe duration of the Governing Contract;\n(iii)\twhere relevant, the right of the Customer to terminate the Governing Contract and any agreements relating to termination in accordance with Rule 20.2.6.\n(g)\tabout redress:\n(i)\tany contractual clauses on the law applicable to the Governing Contract and the competent courts; and\n(ii)\tthe availability of any alternative dispute resolution procedures, if applicable, for the Customer and the methods for having access to them.", "passage_id": "20.2.2"}
{"passage_uid": "3ac84a75-f9ab-498e-9ca1-cf7af2ebe1b8", "text": "A Third Party Provider must provide a Customer the information specified in Rule 20.2.2 before the Customer is bound by the Governing Contract.\nInformation provision during period of the Governing Contract", "passage_id": "20.2.3"}
{"passage_uid": "5e621133-6c3b-411a-8ce1-0064086fd0e7", "text": "The Regulator may, by written notice (referred to in this Chapter as a 'collateral notice'), require a Captive Insurer to make available assets:\n(a)\tof a type and in a manner described in Rule ‎10.3.2(5); and\n(b)\thaving a value, determined in accordance with the provisions of Chapter 6, of the lower of:\n(i)\tthe amount, if any, specified in the notice; and\n(ii)\tthe amount determined in accordance with Rule ‎10.3.2(4).", "passage_id": "10.3.2.(1)"}
{"passage_uid": "9585f95e-ae97-44a1-966f-ec94cc458c39", "text": "The amount referred to in Rule ‎10.3.2(1)(b) is calculated as follows:\n(a)\tin the case of a Captive Cell of a Captive Insurer which is a Cell Company, the sum of the following two amounts:\n(i)\tthe Insurance Liabilities attributable to that Captive Cell; and\n(ii)\tthe Minimum Cellular Capital Requirement applicable to that Captive Cell.\n(b)\tin the case of a Long-Term Insurance Fund, subject to Rules ‎10.3.2(4)(c) and ‎10.3.2(4)(d), the sum of the following two amounts:\n(i)\tthe Insurance Liabilities attributable to that Long-Term Insurance Fund; and\n(ii)\tthe Minimum Fund Capital Requirement applicable to that Long-Term Insurance Fund;\n(c)\tin the case of a Captive Insurer that is not a Cell Company, the sum of the following two amounts:\n(i)\tthe Captive Insurer's Insurance Liabilities; and\n(ii)\tthe Captive Insurer's minimum capital requirement as provided for in Rule 2.2.\n(d)\tin the case of a Captive Insurer to which Rules ‎10.3.2(4)(a) and ‎10.3.2(4)(c) both apply, the amount set out in ‎10.3.2(4)(a); and\n(e)\tin the case of a Captive Insurer to which Rules ‎10.3.2(4)(c) and ‎10.3.2(4)(d) both apply, the amount set out in Rule ‎10.3.2(4)(d).", "passage_id": "10.3.2.(4)"}
{"passage_uid": "0caa9f08-40e5-42b7-9cef-4148ae1dc036", "text": "Relief from Payment\nThe Regulator may at any time reduce, waive or refund all or part of any fee including any supplementary or late payment fee if it considers that, in the circumstances of a particular case, it would be fair and reasonable to do so.", "passage_id": "1.2.8"}
{"passage_uid": "3c548ffe-2bd8-478f-8ddc-d55a1eb83d6e", "text": "The Regulator shall:\n(a)\tWithin five Business Days of receipt of the notice set out in Rule 3.2.2, and subject to Rule 3.2.5, provide notice of the intent to use the passporting procedures under these Rules to the Host Regulator(s) in the relevant Host Jurisdiction(s) where the Passported Fund is intended to be Promoted; and\n(b)\tpromptly following confirmation from the relevant Host Regulator that its respective Register of Passported Funds has been updated to include the details of the Passported Fund:\n(i)\tpublish the details of the Passported Fund on the Register of Passported Funds; and\n(ii)\tnotify the Fund Manager that registration on the Register of Passported Funds is complete.", "passage_id": "3.2.4"}
{"passage_uid": "02c6d009-e171-41d6-adac-aaaaf2b66e5a", "text": "The Regulator shall not transmit a notice under Rule 3.2.4‎(a):\n(a)\tif it considers that the Fund Manager or the Public Fund does not comply with, or it has reasonable grounds for determining that the Fund Manager or the Public Fund may in the future not comply with, applicable legislation, including these Rules; or\n(b)\tif it considers that it is necessary and appropriate to refrain from doing so in order to meet its objectives.", "passage_id": "3.2.5"}
{"passage_uid": "bdb691fd-fde8-4cef-b9ca-5c2166f72295", "text": "Pursuant to Section 117 of FSMR, the Regulator has the power to make a direction if a name of a Fund, Sub-Fund or class of Units in a Fund is undesirable, misleading or conflicts with a name used by another Fund, Sub-Fund or class of Units of a Fund.", "passage_id": "PART 5.11.1.5.Guidance.1"}
{"passage_uid": "8949f938-33e5-4393-a256-021917125579", "text": "Function of the Auditor. A Fund Manager must, in writing, require its auditor to:\n(a)\tconduct an audit of the Fund's financial statements in accordance with the requirements of the relevant standards published by the International Auditing and Assurance Standards Board (IAASB); and\n(b)\tproduce a Fund Auditor's Report on the audited financial statements in accordance with GEN Rule 6.6.8.", "passage_id": "PART 5.16.3.8"}
{"passage_uid": "d277a5cf-34ce-41bb-9ee6-6fce18484596", "text": "Fraud and other Financial Crimes: An Authorised Person must establish and maintain effective systems and controls to:\n(1)\tdeter and prevent suspected fraud and other Financial Crimes against the Authorised Person and its Customers; and\n(2)\treport suspected fraud and other Financial Crimes to the relevant authorities.", "passage_id": "3.3.38"}
{"passage_uid": "c57d295b-e1d8-48c1-a630-f8f2646578c7", "text": "An Authorised Person should observe best practices when establishing the systems and controls required under Rule 3.3.38, given the evolving nature of Financial Crime. Such practices may include, but are not limited to, incorporating secure authentication, biometrics and the monitoring of customer behaviour metrics into anti-fraud and anti-Financial Crime systems and controls.", "passage_id": "3.3.40.Guidance"}
{"passage_uid": "8a39a0f2-3ac3-4f8c-bf98-2752b5310cce", "text": "Fund Auditor's Report. A Fund Manager must, in procuring the production of a Fund Auditor's Report, ensure that an Auditor states:\n(1)\twhether the financial statements have been properly prepared in accordance with the financial reporting standards adopted by the Fund in accordance with FUNDS;\n(2)\twhether the financial statements give a true and fair view of the financial position of the Fund, including the net income and the net gains or losses of the Fund Property, or, as the case may be, the Fund Property attributable to the Sub-Fund for the annual accounting period in question and the financial position of the Fund or Sub-Fund as at the end of the annual accounting period;\n(3)\twhether proper accounting records for the Fund, or as the case may be, Sub-Fund, have not been kept, or that the financial statements are not in agreement with the accounting records and returns, or that the financial statements do not comply with the applicable financial reporting standards;\n(4)\twhether it has been given all the information and explanations which, to the best of its knowledge and belief, are necessary for the purposes of its audit;\n(5)\twhether the information given in the report of the Directors or in the report of the Fund Manager for that period is consistent with the financial statements; and\n(6)\tany other matter or opinion required by FUNDS.", "passage_id": "6.6.8"}
{"passage_uid": "83e95cf0-0fcf-4cb3-ab07-0404f8736500", "text": "The Regulator has the power to give directions to a Recognised Body to take specified steps in order to secure its compliance with the Recognition Requirements. Those steps may include granting the Regulator access to the Recognised Body's premises for the purposes of inspecting those premises or any documents on the premises and the suspension of the carrying on of any activity by the Recognised Body for the period specified in the direction.", "passage_id": "6.6.1"}
{"passage_uid": "45239250-1e38-4dc5-ac39-f213f5fe4a6a", "text": "The Regulator will usually consider revoking a Recognition Order if:\n(a)\tthe Recognised Body is failing or has failed to satisfy one or more of the Recognition Requirements and that failure has or will have serious consequences;\n(b)\tit would not be possible for the Recognised Body to comply with a direction under the Regulator's power to give directions under Rule 6.6.1;\n(c)\tfor some other reason, it would not be appropriate for the Regulator to give a direction under its power to give directions under Rule 6.6.1; or\n(d)\tthe Recognised Body has not carried on the business of a Recognised Body during the 12 months beginning with the day on which the Recognition Order took effect in relation to it, or it has not carried on the business of a Recognised Body at any time during the period of six months ending with the day the Recognition Order is revoked.", "passage_id": "6.8.3"}
{"passage_uid": "7aa7740f-0ed0-4fd2-8217-d13529994838", "text": "Market capitalisation. An Applicant must ensure that it, and the Securities which it seeks to admit to the Official List:\n(1)\twhere the application relates to Shares, satisfy either the profits eligibility test in Rule 2.3.15 or the assets eligibility test in Rule 2.3.16; or\n(2)\twhere the application relates to Debentures, have a Market Capitalisation of at least $2 million.", "passage_id": "2.3.9"}
{"passage_uid": "86469cd3-cfcc-448c-b4e2-e50bf2d32f91", "text": "Asset eligibility test. In order to meet the assets eligibility test, an Applicant must satisfy the following requirements.", "passage_id": "2.3.16"}
{"passage_uid": "790f04b5-f8da-46cb-9014-cff27cdb7226", "text": "Under section 52(1)(b) of the FSMR, the Regulator may impose conditions or restrictions in respect of the admission of Securities to the Official List, or vary or withdraw such conditions or restrictions.", "passage_id": "2.5.Guidance.2."}
{"passage_uid": "254251bf-b846-4357-af1b-961bfa5fff94", "text": "The Prospectus requirements including content and structure in chapter 4 of this Rulebook do not apply to Prospectuses relating to Units of Funds. Prospectus requirements that apply to an Offer of Units of Funds are found in the Fund Rules. Section 57(1) of FSMR disapplies chapter 4 of this Rulebook to Fund Prospectuses.", "passage_id": "3.3.Guidance.1."}
{"passage_uid": "85f98644-465b-43a9-bb47-cedcdbaaf60e", "text": "A Prospectus filed with the Regulator is not an Approved Prospectus for the purposes of section 61(2)(a) of the FSMR unless the Regulator has issued to the Applicant a notice stating its approval:\n(a)\tof the Prospectus or the Supplementary Prospectus as the case may be; and\n(b)\tin the case of a Prospectus in (a) comprising multiple documents, of all the multiple documents.", "passage_id": "4.6.2.(2)"}
{"passage_uid": "ff5bac8d-3dc7-46dd-a9ce-b0c32a42422e", "text": "Generally, if a Reporting Entity does not adopt the best practice standards set out in APP 4, or adopts them only partially, the Regulator would expect the reasons for doing so and any alternative measures adopted to achieve the outcomes intended by the Corporate Governance Principles to be disclosed in the Prospectus and thereafter pursuant to the Disclosure required under Rule 9.2.10. Any inaccurate or false representations would lead to the imposition of civil liability in accordance with section 70 of the FSMR.", "passage_id": "9.2.2.Guidance.3."}
{"passage_uid": "5c3c0f6f-29a7-4b86-b0fe-109213900f3e", "text": "Annual reporting on compliance. The annual financial report of a Listed Entity to which this section applies must:\n(1)\tstate whether the best practice standards specified in APP 4 (the \"Corporate Governance Principles\") have been adopted by the Listed Entity;\n(2)\tif the best practice standards in APP 4 have not been fully adopted or have been only partially adopted explain:\n(a)\twhy the best practice standards were not adopted fully or adopted only partially, as is relevant; and\n(b)\twhat actions, if any, have been taken by the Listed Entity to achieve compliance with the Corporate Governance Principles to the extent the relevant best practice standards were not adopted, or were only partially adopted; and\n(3)\tinclude a statement by Directors whether or not, in their opinion, the Corporate Governance framework of the Listed Entity is effective in promoting compliance with the Corporate Governance Principles, with supporting information and assumptions, and qualifications if necessary.", "passage_id": "9.2.10"}
{"passage_uid": "0b00ca08-6924-419e-b76d-dd66e5575a33", "text": "A Reporting Entity is required under section 82 of the FSMR to appoint an auditor.", "passage_id": "10.2.1.Guidance.2."}
{"passage_uid": "211edfe0-af57-41c8-84ca-814e1af3de0f", "text": "Requirements for all disclosures. Where a disclosure by a Mining Reporting Entity does not meet a non-mandatory requirement contained in a Mining Reporting Standard, the Mining Reporting Entity must provide in its disclosure a statement as to how and why its disclosure differs from the non-mandatory requirement contained in the relevant Mining Reporting Standard.", "passage_id": "11.2.2"}
{"passage_uid": "b8235755-7447-4ae5-b3dc-8cb14109c124", "text": "Rule 11.2.1(1) requires a Mining Reporting Entity to fully comply with all binding requirements set out in a Mining Reporting Standard. The Regulator also expects a Mining Reporting Entity to fully comply with all non-mandatory requirements set out in a Mining Reporting Standard, including, for example, Table 1 of the JORC Code or SAMREC Code, or explain its non-compliance in accordance with Rule 11.2.2.", "passage_id": "11.2.2.Guidance"}
{"passage_uid": "2c78a258-d9f2-4150-9d2c-ba681d8f9489", "text": "A Mining Reporting Entity’s disclosure pursuant to Rule 11.9.1 must include:\n(1)\tin relation to the assumptions used to determine the forecast financial information:\n(a)\tall material economic assumptions employed;\n(b)\tif the Mining Reporting Entity considers the material economic assumptions to be commercially sensitive, a statement to that effect and an explanation of the methodology used to determine the material economic assumptions; and\nGuidance\nA Mining Reporting Entity that considers certain information relating to the material economic assumptions to be commercially sensitive should refer to paragraphs 47-54 of the Guidance on Mining and paragraphs 127 and 128 of the Guidance on Continuous Disclosure.\n(c)\tall other material assumptions utilised.\n(2)\tthe Production Target from which the forecast financial information is derived (including all the information contained in Rule 11.8.3).", "passage_id": "11.9.2"}
{"passage_uid": "1d41da19-7d47-42e7-baf3-28af0f6c1c12", "text": "A Petroleum Reporting Entity must immediately disclose any new material estimates of Prospective Resources, Contingent Resources or Petroleum Reserves that have not previously been disclosed.", "passage_id": "12.6.1"}
{"passage_uid": "a9ffc27d-5147-4066-826f-22c25cd1e704", "text": "A Petroleum Reporting Entity making a disclosure under Rule 12.6.1 must ensure the disclosure contains:\n(1)\tthe types of permits or licences held by the Petroleum Reporting Entity relating to the estimates;\n(2)\tan explanation of the new data and information;\n(3)\tan explanation of how the new data and information has affected the estimates of Prospective Resources, Contingent Resources or Petroleum Resources; and\n(4)\tany changes or additions to the information previously disclosed relating to:\n(a)\tProspective Resources under Rules 12.8.1(1) to 12.8.1(4);\n(b)\tContingent Resources under Rules 12.10.1(1) to 12.10.1(5); and\n(c)\tPetroleum Reserves under Rules 12.12.1(1) to 12.12.1(7).", "passage_id": "12.6.2"}
{"passage_uid": "ab93bfec-289e-42d2-b653-975f44d08c62", "text": "Quarterly Reports – Petroleum Exploration Reporting Entities. A Petroleum Exploration Reporting Entity must disclose a report for each quarter of its financial year containing the following information in respect of the Petroleum Exploration Reporting Entity and all controlled entities, on a consolidated basis, if applicable:\n(1)\tdetails of the activities relating to Petroleum:\n(a)\tExploration, or a statement that there have been no activities relating to Exploration; and\n(b)\tproduction and development, or a statement that there have been no activities relating to mining production and development;\n(2)\ta summary of any expenditure incurred relating to Petroleum:\n(a)\tExploration activities; and\n(b)\tproduction and development;\n(3)\tthe Petroleum Tenements held at the end of the quarter, their location and the percentage interest held, including the beneficial interests in farm-in or farm-out agreements;\n(4)\tthe Petroleum Tenements, including beneficial interests in farm-in or farm-out agreements, acquired or disposed of during the quarter, and their location;\n(5)\tat least once every 12 months, the Summary of Reserves and Resources required by Rule 12.14.1 unless it is included in the Petroleum Exploration Reporting Entity’s annual report; and\n(6)\twhen the previous, and upcoming, disclosure required by (5) was, and is, to be disclosed.", "passage_id": "12.13.1"}
{"passage_uid": "380ff25a-7805-4020-9f40-da991f91eab1", "text": "Quarterly Reports – Petroleum Exploration Reporting Entities. A Petroleum Exploration Reporting Entity must disclose the report required by Rule 12.13.1 no later than one month after the end of the quarter.", "passage_id": "12.13.2"}
{"passage_uid": "e705fde9-d397-4a9f-b5a0-471529529c66", "text": "Category 1\nAn Authorised Person is in Category 1 if:\n(a)\t\t(a)\tits Financial Services Permission authorises it to carry on one or more of the Regulated Activities of Accepting Deposits or Managing a Profit Sharing Investment Account which is a PSIAu; and\n(b)\t\t(b)\tit does not meet the criteria of Category 5.\nGuidance\nA Category 1 Authorised Person may be authorised to conduct other Regulated Activities, but it is the authorisation for Accepting Deposits or Managing a Profit Sharing Investment Account which is a PSIAu that is determinative of its belonging to Category 1.\nCategory 2\nGuidance\n1.\tA Category 2 Authorised Person may be authorised to conduct other Regulated Activities, but it is the authorisation for Dealing in Investments as Principal (not only as a Matched Principal) or Providing Credit, and the absence of authorisation for the activities specified in Rule 1.3.1, that are determinative of its belonging to Category 2.\n2.\tWhere the dealing activities of a firm are limited to acting only as Matched Principal, the activities fall in the scope of Category 3A in accordance with Rule 1.3.3(1). A definition of \"Matched Principal\" is in Rule 1.3.3(2).", "passage_id": "1.3.1"}
{"passage_uid": "6737c8c3-06cb-4da7-bbcd-9e8650ecf66f", "text": "An Authorised Person is in Category 2 if:\n(a)\tits Financial Services Permission authorises it to carry on one or both of the Regulated Activities of Providing Credit or Dealing in Investments as Principal (not as Matched Principal);\n(b)\tits dealing activities are not limited in scope as provided in Rule 1.3.3(1)(a)(i); and\n(c)\tit does not meet the criteria of Categories 1 or 5.\nCategory 3A\nGuidance\nA Category 3A Authorised Person may be authorised to conduct other Regulated Activities, but it is the authorisation for Dealing in Investments as Agent and the absence of authorisation for the activities specified in Rules 1.3.1 and 1.3.2 that are determinative of its belonging to Category 3A. Provided that an Authorised Person carries out the Regulated Activity of Dealing in Investments as Agent in a manner that is wholly incidental to the activity of Managing an Investment Fund or Managing Assets, the Authorised Person shall be regarded as falling within Category 3C.", "passage_id": "1.3.2"}
{"passage_uid": "b2a0076b-8f51-4fc4-ac5b-6df2d25c4778", "text": "Measurement of E for pre settlement Counterparty Exposures arising from SFTs. An Authorised Person which has taken eligible financial Collateral for any SFT where the pre settlement Counterparty Exposure is determined in accordance with Rule 4.9.15 may recognise the effect of such Collateral in accordance with Rules 4.9.17 to 4.9.20.", "passage_id": "4.9.16"}
{"passage_uid": "cf88cf6e-8083-4aed-8468-eed8d367f412", "text": "Measurement of E for pre settlement Counterparty Exposures arising from SFTs. An Authorised Person must use either the FCSA or the FCCA to recognise the effect of eligible financial Collateral for any SFT in the Non Trading Book. The Authorised Person must apply the chosen approach consistently to the entire Non Trading Book and must not use a combination of both approaches. For a pre settlement Counterparty Exposure arising from any SFT in the Trading Book, an Authorised Person must only use the FCCA to recognise the effect of eligible financial Collateral.", "passage_id": "4.9.17"}
{"passage_uid": "c36bf3cf-160f-43ab-bb40-9d7f5ceec7b8", "text": "Collateral\nIn order to recognise the effects of CRM of the types of Collateral set out in Rules 4.13.5 to 4.13.7, an Authorised Person must ensure that the relevant requirements in Rule 4.13.8 are complied with.", "passage_id": "4.13.4.Guidance"}
{"passage_uid": "a3e095b2-569f-4475-9c44-3652864cf685", "text": "For the purposes of Rule 4.13.5 and 4.13.6, eligible financial Collateral excludes any T1 Capital instrument or T2 Capital instrument issued by any entity in the Financial Group of the Authorised Person, which is held by the Authorised Person or any of its Financial Group entities as Collateral.", "passage_id": "4.13.5.Guidance.1."}
{"passage_uid": "2d7f3106-4761-4113-abe3-580e52ee1c85", "text": "For an Authorised Person using the FCCA, eligible financial Collateral comprises:\n(a)\tany instrument listed in Rule 4.13.5;\n(b)\tany equity Security (including a convertible bond) that is traded on a regulated exchange; and\n(c)\tany Unit in a Collective Investment Fund which invests in equity Securities referred to in (b), where:\n(i)\ta price for the Units is publicly quoted daily; and\n(ii)\tat least 90% of the deposited property of the Fund is invested in instruments listed in this Rule and Rule 4.13.5.", "passage_id": "4.13.6"}
{"passage_uid": "cb37e5c4-ed71-4523-8fb8-da4fbc7eecf1", "text": "Requirements for Recognition of Collateral. An Authorised Person must ensure that the following requirements are complied with before it recognises the effects of CRM of any Collateral:\n(a)\tthe legal mechanism by which Collateral is pledged, assigned or transferred must confer on the Authorised Person the right to liquidate or take legal possession of the Collateral, in a timely manner, in the event of the default, insolvency or bankruptcy (or one or more otherwise defined credit events set out in the transaction documentation) of the Counterparty (and, where applicable, of the custodian holding the Collateral);\n(b)\tthe Authorised Person has taken all steps necessary to fulfil those requirements under the law applicable to the Authorised Person's interest in the Collateral for obtaining and maintaining an enforceable security interest by registering it with a registrar or for exercising a right to net or set off in relation to title transfer Collateral;\n(c)\tthe credit quality of the Counterparty and the value of the Collateral do not have a material positive correlation;\n(d)\tSecurities issued by the Counterparty or any Closely Related Counterparty are not eligible;\n(e)\tthe Authorised Person has implemented procedures for the timely liquidation of Collateral to ensure that any legal conditions required for declaring default of Counterparty and liquidating the Collateral are observed, and that the Collateral can be liquidated promptly; and\n(f)\twhere the Collateral is held by a custodian, the Authorised Person has taken reasonable steps to ensure that the custodian segregates the Collateral from its own assets.", "passage_id": "4.13.8"}
{"passage_uid": "d430637c-0076-42dd-b3ff-ff739c34e3aa", "text": "Systems and controls for the use of securitisations. An Authorised Person must conduct periodic stress tests in relation to its securitisation activities and off balance sheet Exposures, including testing of future ability to transact securitisation as a means of CRM or for liquidity purposes.", "passage_id": "4.14.5"}
{"passage_uid": "053ecf47-4501-4027-a994-9ada059b5e73", "text": "The frequency and extent of stress testing to fulfil the requirements of Rule 4.14.5 should be determined on the basis of the materiality of the Authorised Person's securitisation volumes and its off balance sheet Exposures.", "passage_id": "4.14.5.Guidance.2."}
{"passage_uid": "9ae2763f-2e1a-4afb-ac8e-f57ce03a81c3", "text": "Recognition of Credit Risk mitigations. For the purposes of this Section, an Authorised Person may reduce the value of its Exposures, at its discretion, by any one or more of the following:\n(a)\tthe amount of any specific provision made, where the provision relates to the risk of a credit loss occurring on that Exposure and is not held as part of a general provision or reserve against its Credit Risks;\n(b)\tNetting its claims on and liabilities to a Counterparty, provided that the conditions in Section 4.13 of CRM are met;\n(c)\tthe amount of Collateral held against its Exposures, where that Collateral is of a type listed based on the FCSA and FCCA approaches and meeting the requirements under Section 4.13;\n(d)\tthe amount of any eligible guarantees as permitted under Section 4.13.9;\n(e)\tthe value of a Credit Derivative, where the Credit Derivative is an instrument included in Rule 4.13.11 and the transaction meets the conditions set out in that Section; and\n(f)\tthe effects of transactions transferring Credit Risks from the Authorised Person to another party through securitisation, provided that the conditions in Section 4.14 are met.", "passage_id": "4.15.12"}
{"passage_uid": "5a4ad383-0e7b-476f-84ee-d6bce45b2270", "text": "Recognition of Credit Risk mitigations. An Authorised Person must document its policy for the use of any of the exclusions in Rule 4.15.12.", "passage_id": "4.15.17"}
{"passage_uid": "b0fe779d-b7f0-48a6-a00d-06a3f3dc8106", "text": "An Authorised Person must ensure at all times that its Financial Group Capital Resources, as calculated in Rule 8.3.4, are equal to or in excess of its Financial Group Capital Requirement as calculated in Rule 8.3.3.", "passage_id": "8.3.2"}
{"passage_uid": "12a7fe75-3ede-4f19-86af-34a1e60cfe3b", "text": "If an Authorised Person breaches Rule 8.3.2, the Regulator will take into account the full circumstances of the case, including any remedial steps taken by another regulator or the Authorised Person, in determining what enforcement action, if any, it will take.", "passage_id": "8.3.2.Guidance"}
{"passage_uid": "4262e773-aad2-4422-b6b3-fea38fd9d619", "text": "For reverse repurchase agreements:\nE = Amount paid or Collateral given   MV of the Securities received.", "passage_id": "APP4.A4.7.4"}
{"passage_uid": "379a83c2-96da-4b2a-acea-f8779444878d", "text": "The MV of Securities and the value of Collateral under Rules A4.7.3 to A4.7.6 should be calculated in accordance with the CRM provisions set out in Section 4.13.", "passage_id": "APP4.A4.7.7"}
{"passage_uid": "764bd3fc-ac8b-451f-b8bb-aa931a00c48b", "text": "The Regulator may—\n(a)\trefuse an Application for Listing; or\n(b)\timpose conditions or restrictions, in respect of the admission of Securities to the Official List, or vary or withdraw such conditions or restrictions;\nin the circumstances specified in subsection ‎(2).", "passage_id": "Part 6.52.(1)"}
{"passage_uid": "07edf917-eba6-4ad8-8173-a8d5bc0ec58a", "text": "The provisions in this Chapter and the Rules made for the purposes of this Chapter shall not apply to a person in relation to making an Offer of a Unit.", "passage_id": "Part 6.Chapter 1.57.(1)"}
{"passage_uid": "caf92348-9f78-4a22-b449-0824165b55e1", "text": "For the purposes of subsection ‎(1)—\n(a)\ta Prospectus is an Approved Prospectus if it is approved by the Regulator in accordance with the requirements prescribed in the Rules; and\n(b)\ta reference to a Prospectus made by or under these Regulations is a reference to an Approved Prospectus, unless the context requires otherwise.", "passage_id": "Part 6.Chapter 1.61.(2)"}
{"passage_uid": "570827ee-e3f5-499b-8451-bbc5bdb6d80c", "text": "Prospectus requirement. Obligation to issue a supplementary prospectus\nIf at any time after the issue of a Prospectus there is a significant change in, or a material mistake or inaccuracy affecting any matter contained in the Prospectus or a significant new matter arises, the Issuer or the person responsible for the issue of the Prospectus shall issue a supplementary prospectus which—\n(a)\tprovides details of the change, mistake, inaccuracy or new matter; and\n(b)\tcomplies with the requirements in section ‎62‎(1).", "passage_id": "Part 6.Chapter 1.65."}
{"passage_uid": "74fee9ec-688d-43df-99e1-bc5b4f83f0fb", "text": "Financial reports. Appointment of auditors\nA Reporting Entity shall have an auditor Appointed in accordance with ‎Part 15 and any Rules made for the purposes of that Part.", "passage_id": "Part 6.Chapter 2.82."}
{"passage_uid": "e14e3ec9-c8a6-4747-a88e-b60c3395238f", "text": "The third is where the Behaviour consists of effecting transactions or orders to trade (otherwise than for legitimate reasons and in conformity with Accepted Market Practices on the relevant market) which—\n(a)\tgive, or are likely to give, a false or misleading impression as to the supply of, or demand for, or as to the price of, one or more Financial Instruments, Accepted Virtual Assets or Accepted Spot Commodities; or\n(b)\tsecure the price of one or more such instruments at an abnormal or artificial level.", "passage_id": "Part 8.92.(4)"}
{"passage_uid": "3ec1d30f-39dd-4b93-86ed-4f8e25d7d0ff", "text": "Power to make a Direction\nIf, in the opinion of the Regulator, the name of a Fund or of a Sub Fund conflicts with the name of another Fund or Sub-Fund or is undesirable or misleading, it may direct the Fund Manager to change the name of the Fund or the Sub Fund.", "passage_id": "Part 11.Chapter 4.117."}
{"passage_uid": "ba9deea1-694d-4225-bf79-201773a12046", "text": "The Investigator may, by written notice, require the person who is the Person Under Investigation or any other person (whether or not connected to the Person Under Investigation) to—\n(a)\tattend an interview at a Specified time and place and answer questions;\n(b)\tproduce at a Specified time and place any Specified Documents or Documents of a Specified description;\n(c)\tprovide such information as the Investigator may require;\n(d)\tprovide such assistance as the Investigator may require; or\n(e)\tpermit the Investigator to enter the business premises of such person during normal business hours for the purpose of inspecting and copying Documents on such premises.", "passage_id": "Part 17.206.(1)"}
{"passage_uid": "350b6237-da6f-47c6-b04c-10caf56bf9d7", "text": "Abusive squeezes. The following are specific examples of an abusive squeeze that, in the Regulator's view, may contravene section 92 (4)(b):\n(a)\tduring the course of a trading day on a Commodity Derivative Exchange, a trader rapidly builds up a position of more than 90% of the physical inventory underlying a crude oil contract.  The trader fails to Offer to lend the crude oil back to other market participants at a reasonable commercial rate.  The trader then unwinds his position in the Exchange's final settlement window  at rapidly increasing prices, thereby cornering/squeezing the crude oil market.  His conduct causes an abnormal movement in the price of crude oil contracts for forward month delivery; and\n(b)\ta trader with a long position in bond futures, buys or borrows a large amount of the bonds and either refuses to re-lend these bonds or will only lend them to parties he believes will not re-lend to the market.  His purpose is to position the price at which persons with short positions have to deliver to satisfy their obligations at a materially higher level, making him a profit on his position.", "passage_id": "2.2.(13)"}
{"passage_uid": "cf20c9eb-d551-42cd-87ce-691b75db72d4", "text": "Power to require documents or information . During an investigation, the Investigator may obtain relevant information and/or documents either on a compulsory basis, principally through the exercise of its powers under section 206(1)(b) and (c) of FSMR, or on a voluntary basis.", "passage_id": "6.6.6"}
{"passage_uid": "4bdd6d36-6949-4aeb-9161-1eead5b4cfb9", "text": "IMMEDIATELY\nUse of a Trading Halt or Suspension to manage Disclosure issues\nA Trading Halt or Suspension may, however, be necessary in the following circumstances:\n\na)\tthere are indications that the Inside Information has lost its confidentiality ahead of a Disclosure (see Rule 7.2.2(2)), and it is having, or (where the RIE upon which the Listed Entity’s Securities are admitted to trading is not yet open for trading) is likely to have, when the RIE opens for trading, a significant effect on the price of the Listed Entity’s Securities;\n\nb)\tthe Reporting Entity has been asked by the Listing Authority to correct or prevent a false market;  or\n\nc)\tthe information is particularly significant Inside Information and likely to cause a significant movement in the price of the Listed Entity’s Securities (for example, Inside Information relating to a significant capital raising, the Board of the Listed Entity resolving to appoint an administrator, or that the Listed Entity is to win approval for a one-off contract that will substantially change the scale and activities of the Listed Entity);\n\nand in circumstances where the RIE’s market is:\n\nd)\topen for trading in the Listed Entity’s Securities, the Reporting Entity is not in a position to make the Disclosure immediately; or\n\ne)\tnot open for trading in the Listed Entity’s Securities, the Reporting Entity will not be in a position to make the Disclosure before the RIE opens for trading.", "passage_id": "53)"}
{"passage_uid": "22a51628-c5c0-43b8-b062-2c8145b3a2c6", "text": "IMMEDIATELY\nListing Authority process for granting a Trading Halt / Suspension\nNot every circumstance in which a Reporting Entity intends to Disclose, but has not Disclosed, Inside Information (on the basis of one of the examples in paragraph 53 above), will warrant a Trading Halt or a Suspension.  On this basis, when a Reporting Entity makes a request to the Listing Authority for a Trading Halt or Suspension (pursuant to Rule 7.8, or Rules 2.6 and 2.6.3, as applicable), to allow it the time needed to prepare, and release, the Disclosure of Inside Information under Rule 7.2.1, the Listing Authority will usually ask the Reporting Entity to outline the:\n\na)\tnature of the Inside Information in question;\n\nb)\treasons for requesting the Trading Halt or Suspension;\n\nc)\tevent expected to occur which will conclude the Trading Halt or Suspension; and\n\nd)\tintended scope of, and timing for, the release of the Disclosure;\n\nand assess for itself whether the circumstances warrant the granting of the Trading Halt or Suspension.", "passage_id": "58)"}
{"passage_uid": "f221a729-4fb2-4eca-bb45-6c892c667a28", "text": "SUPERVISION BY LISTING AUTHORITY\nAware Letters\nSimilar to a MAQ Letter, ‘aware letters’ tend to follow a standard template.  Generally, they will identify the information in question and the relevant date it was Disclosed, and ask the following questions:\n\n(i)\tDoes the Reporting Entity believe the information identified in the letter to be Inside Information (being information that a reasonable person would expect to have a significant effect on the price of the Listed Entity’s Securities)?\n\n(ii)\tIf the answer to question i) is “yes”, please confirm the following:\n\ni.\tWhen did the Reporting Entity first become aware of the Inside Information identified in the letter? Please include details of the relevant time and circumstances of the Reporting Entity becoming aware of the [key contents of the Inside Information]?\n\nii.\tIf the Reporting Entity was aware of the [key contents of the Inside Information] prior to the date of this letter, please advise why the Reporting Entity did not Disclose the Inside Information or request a Trading Halt or Suspension at an earlier time?  Please comment specifically on the application of Rule 7.2.1.\n\n(iii)\tIf the answer to question i) is “no”, please confirm the basis on which the Reporting Entity does not consider the information to be Inside Information?\n\n(iv)\tPlease confirm that the Reporting Entity is in compliance with the Markets Rules and, in particular, Rule 7.2.1.", "passage_id": "188)"}
{"passage_uid": "6f969623-b272-436b-9bad-c57a00efd944", "text": "SUPERVISION BY LISTING AUTHORITY\nComplaints or allegations of non-compliance by Reporting Entities\nIf, as a result of the enquiry, the Listing Authority forms the view that the information is accurate, is Inside Information, and is not within exemption from Disclosure provided by Rule 7.2.2, the Listing Authority will ask the Reporting Entity to make a Disclosure about the matter under Rule 7.2.1.  If the information should have been Disclosed earlier, the Listing Authority may issue an ‘aware letter’ (see paragraphs 187 to 189 above), or take other relevant action.", "passage_id": "193)"}
{"passage_uid": "d7598df9-aeea-4b2d-b1ef-e4e98bea49dd", "text": "Regulatory treatment of tokens deemed to be Securities. The requirements for Offers of Securities fall under Sections 58 to 71 of FSMR and Chapter 4 of the Markets Rules (“MKT”). When an Issuer wishes to make an Offer of Securities to the Public in or from ADGM, these requirements include, for example, the obligation to publish a Prospectus under Section 61 of FSMR.", "passage_id": "3.5"}
{"passage_uid": "3b4ca4c9-5690-4bae-8c30-3d06642d6e95", "text": "ORE RESERVES . Mining Reporting Entities need to be careful not to claim that information is commercially sensitive when this is not the case.  If a Mining Reporting Entity, for example, has not yet entered into any commercially sensitive contracts that underpin its commodity price, capital expenditure or operational expenditure assumptions, it would be difficult to form a view that information about those assumptions would be commercially sensitive.", "passage_id": "52)"}
{"passage_uid": "e801f4a4-1a6e-4c91-92d6-724eec350cc0", "text": "FEES\nCumulative application of Fees\nNoting the above paragraph, if an Applicant/Authorised Person will be undertaking a Regulated Activity involving conventional assets (e.g., Securities or Derivatives) in addition to Spot Commodities, it will need to seek approval from the FSRA for its FSP to permit it to carry out its Regulated Activity in relation to both asset types (conventional and Spot Commodities).  The fees attributable to that Authorised Person for its Regulated Activities, conventional and Spot Commodity-related, may not be cumulative should the FSRA apply its discretion to reduce or waive a fee, under FEES 1.2.8 (considering the high fees already imposed on Applicants/Authorised Persons conducting Regulated Activities using Spot Commodities.", "passage_id": "114)"}
