{"item_id": "cc5acb874798644c", "source_passage_id": "4baeb76490d6d9b2", "target_passage_id": "e722345e3cfbec34", "question": "When applying 3D22.3 and 3D22.4 to a firm’s treatment of securitisations issued before 18 January 2015, how should the firm determine whether the securitisation qualifies as a type 1 securitisation and which version of Article 177 should be used, given that Article 177 was later deleted by Commission Delegated Regulation (EU) 2018/1221?", "gold_answer": "A firm should assess “type 1 securitisation” status by applying Article 177(4) as it appeared in Commission Delegated Regulation (EU) 2015/35 in force on 31 December 2018, and it should treat Article 177 as continuing to apply for the purposes of 3D22.3 and 3D22.4 despite its later deletion. [#TGT:e722345e3cfbec34] [#SRC:4baeb76490d6d9b2] In particular, where the securitisation was issued before 18 January 2015 and qualifies as type 1 under that Article 177(4) version, the firm must assign the risk factor stress i using Articles 177 and 178 as in force on 31 December 2018. [#TGT:e722345e3cfbec34] The continued effect of Article 177 for 3D22.3 and 3D22.4 is explicitly preserved notwithstanding its deletion by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, and it applies for those purposes with modifications. [#SRC:4baeb76490d6d9b2] Accordingly, the firm’s classification step (type 1 under Article 177(4)) and its stress assignment step (risk factor stress i under Articles 177 and 178) both anchor to the 31 December 2018 version, while the rule context for continuing to use Article 177 is tied to 3D22.3 and 3D22.4. [#TGT:e722345e3cfbec34] [#SRC:4baeb76490d6d9b2]", "method": "DPEL", "persona": "professional", "pair_uid": "ce92396d8db7aace"}
{"item_id": "174dd2ca7c0b499c", "source_passage_id": "4baeb76490d6d9b2", "target_passage_id": "e722345e3cfbec34", "question": "If a firm is dealing with a securitisation issued before 18 January 2015, what does it need to check to treat it as a type 1 securitisation and which Articles must it use to set the risk factor stress i, considering Article 177 was deleted later but still matters for 3D22.3 and 3D22.4?", "gold_answer": "The firm needs to confirm the securitisation qualifies as a type 1 securitisation by using Article 177(4) from the version of Commission Delegated Regulation (EU) 2015/35 that was in force on 31 December 2018, and then it must set the risk factor stress i using Articles 177 and 178 from that same in-force version. [#TGT:e722345e3cfbec34] Even though Article 177 was deleted by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, it is treated as still applying for the purposes of 3D22.3 and 3D22.4, with modifications for those purposes. [#SRC:4baeb76490d6d9b2] Putting these together, the “issued before 18 January 2015” condition and the “type 1” test both point you to the 31 December 2018 version of Article 177(4), while the actual calculation step for risk factor stress i requires applying Articles 177 and 178 as in force on 31 December 2018. [#TGT:e722345e3cfbec34] The reason you can still rely on Article 177 in this context is that it continues to have effect specifically for 3D22.3 and 3D22.4 despite the later deletion. [#SRC:4baeb76490d6d9b2]", "method": "DPEL", "persona": "basic", "pair_uid": "ce92396d8db7aace"}
{"item_id": "838fa5f60c5858a5", "source_passage_id": "40535db1194b8610", "target_passage_id": "ac036858232f3caf", "question": "Where a rule in this Part is not a CRR rule, how should it be interpreted in relation to CRR—specifically, should it be treated as if it were a CRR rule for interpretive purposes, and which meaning (CRR vs the Glossary to the Rulebook) should be applied to words and expressions used in that rule?", "gold_answer": "A rule in this Part that is not itself a CRR rule should still be interpreted on a CRR-aligned basis, because the Part directs that rule 2.13 of the Interpretation Part applies to those non‑CRR rules as though they were CRR rules. [#SRC:40535db1194b8610] In parallel, the interpretive approach for CRR rules (and rules made under section 192XA FSMA) is to read them as if they formed part of CRR unless there is a clear contrary intention, and to give words and expressions the meanings they have in CRR rather than the meanings in the Glossary to the Rulebook. [#TGT:ac036858232f3caf] Taken together for a non‑CRR rule in this Part, the practical compliance outcome is that you should apply the Interpretation Part mechanism that treats the rule like a CRR rule, and then interpret the terminology using CRR meanings (not Glossary meanings) unless the text shows a contrary intention. [#SRC:40535db1194b8610] [#TGT:ac036858232f3caf] This linkage matters because the Part’s “as if they were CRR rules” instruction determines the interpretive frame, while the CRR “read as if part of CRR” instruction determines which definitional source governs the words and expressions used. [#SRC:40535db1194b8610] [#TGT:ac036858232f3caf]", "method": "DPEL", "persona": "professional", "pair_uid": "1d10c725ff93c556"}
{"item_id": "32667586ce7b3bcc", "source_passage_id": "40535db1194b8610", "target_passage_id": "ac036858232f3caf", "question": "If a rule in this Part isn’t a CRR rule, do you still read it like it’s part of CRR, and when you see defined terms in it, do you use the CRR meaning or the Glossary to the Rulebook meaning?", "gold_answer": "Yes: even when a rule in this Part is not a CRR rule, the Part says rule 2.13 of the Interpretation Part applies to it as though it were a CRR rule, so you approach interpretation on that “treat it like CRR” basis. [#SRC:40535db1194b8610] Separately, the interpretive direction for CRR rules and rules made under section 192XA FSMA is that, unless the text clearly indicates otherwise, they are read as if they were part of CRR, and the words and expressions used in them take their meaning from CRR rather than from the Glossary to the Rulebook. [#TGT:ac036858232f3caf] Combining those two instructions, when you are working with a non‑CRR rule in this Part you should (i) apply the Interpretation Part rule that treats it as if it were a CRR rule, and (ii) interpret its terminology using CRR meanings, not Glossary meanings, unless a contrary intention appears in the text. [#SRC:40535db1194b8610] [#TGT:ac036858232f3caf] This is a single interpretive approach that depends on both passages: one tells you to treat the Part’s non‑CRR rules like CRR rules, and the other tells you what that implies for how terms are read and where their meanings come from. [#SRC:40535db1194b8610] [#TGT:ac036858232f3caf]", "method": "DPEL", "persona": "basic", "pair_uid": "1d10c725ff93c556"}
{"item_id": "e4beed7e5156cd8e", "source_passage_id": "6ed49c6d770ad510", "target_passage_id": "9f2e6ec1c2bc29ca", "question": "How should a UK Solvency II firm, the Society or managing agents demonstrate that its risk-management system is “effective” and operates on a continuous basis, specifically in relation to liquidity risk appetite and limits?", "gold_answer": "A UK Solvency II firm, the Society or managing agents should treat liquidity risk as a concrete application of the broader requirement to run an effective risk-management system that continuously identifies, measures, monitors, manages and reports risks and their interdependencies at both individual and aggregated levels. [#TGT:9f2e6ec1c2bc29ca] In practice, this means the firm’s risk-management system should include approved risk tolerance limits that implement the insurer’s risk strategy and support control mechanisms, and liquidity risk should be addressed through a clearly defined liquidity risk appetite statement. [#SRC:6ed49c6d770ad510] Senior management should identify material sources of liquidity risk and set prudent risk limits for those sources, so that liquidity risk can be monitored and managed in a way that aligns with the system’s continuous measurement and reporting expectations. [#SRC:6ed49c6d770ad510] To evidence “effectiveness,” the liquidity appetite statement and related limits should be embedded within the system’s strategies, processes and reporting procedures, enabling ongoing monitoring and reporting of liquidity risk both on its own and in combination with other risks. [#TGT:9f2e6ec1c2bc29ca] This linkage between liquidity-specific appetite/limits and the system-wide continuous risk processes helps show that liquidity risk is not handled ad hoc but is integrated into the firm’s overall risk-management framework. [#SRC:6ed49c6d770ad510]", "method": "DPEL", "persona": "professional", "pair_uid": "33ff5729e8ec9f1e"}
{"item_id": "eb76f7f42525ae39", "source_passage_id": "6ed49c6d770ad510", "target_passage_id": "9f2e6ec1c2bc29ca", "question": "If a firm must run a risk-management system that continuously identifies, measures, monitors, manages and reports risks, what liquidity-risk documents or statements should it have, and who should set the key liquidity limits?", "gold_answer": "To align liquidity risk with a risk-management system that must operate continuously and cover risks at both individual and aggregated levels (including their interdependencies), the firm should make liquidity risk explicit within its strategies, processes and reporting procedures. [#TGT:9f2e6ec1c2bc29ca] For UK Solvency II firms, the Society and managing agents, this includes implementing and maintaining a risk management system with approved risk tolerance limits that implement the insurer’s risk strategy and support control mechanisms, and establishing a clearly defined liquidity risk appetite statement. [#SRC:6ed49c6d770ad510] Senior management should identify the material sources of liquidity risk and set prudent risk limits for those sources, so the firm can monitor and manage liquidity risk in a structured way rather than informally. [#SRC:6ed49c6d770ad510] For non-Directive firms, the liquidity-risk expectation is framed as documentation: the insurer should document its policies on liquidity risk, including its appetite or tolerance for that risk, so the liquidity approach can be incorporated into the system’s ongoing identification, measurement, monitoring and reporting cycle. [#SRC:6ed49c6d770ad510] Overall, the liquidity appetite/tolerance and limits should be positioned as part of the firm’s continuous risk-management system, not as standalone statements. [#TGT:9f2e6ec1c2bc29ca]", "method": "DPEL", "persona": "basic", "pair_uid": "33ff5729e8ec9f1e"}
{"item_id": "aac11aad00e351cf", "source_passage_id": "a1be217c65884ad1", "target_passage_id": "9c0a502a887dae03", "question": "For a significant 1 (PRA Category 1 or 2) Solvency II firm establishing and implementing the remuneration policy referred to in 2A.1(12), how should it use the supervisory statement’s guidance alongside the requirement to comply with all principles, and what must it do if it cannot meet or exceed the PRA’s expectations?", "gold_answer": "A significant 1 (PRA Category 1 or 2) Solvency II firm should treat the supervisory statement as guidance to help it comply with the requirements in Chapter 3A of the Conditions Governing Business Part of the PRA Rulebook while it establishes and implements the remuneration policy referred to in 2A.1(12), which must comply with all of the stated principles. [#SRC:a1be217c65884ad1] [#TGT:9c0a502a887dae03] The firm should also recognise that the supervisory statement itself does not create absolute requirements, because the binding requirements are contained in the directly applicable Solvency II Regulation that took effect on 1 January 2016. [#SRC:a1be217c65884ad1] In practice, this means the firm uses the statement to benchmark and shape its remuneration policies and practices against Chapter 3A while ensuring the policy implementation aligns with the principles applicable to the 2A.1(12) remuneration policy. [#SRC:a1be217c65884ad1] [#TGT:9c0a502a887dae03] If the firm is unable to meet or exceed the PRA’s expectations as described in the supervisory statement, it must notify its PRA supervisory contact. [#SRC:a1be217c65884ad1]", "method": "DPEL", "persona": "professional", "pair_uid": "b47b023690038093"}
{"item_id": "ecb2b200f7a31790", "source_passage_id": "a1be217c65884ad1", "target_passage_id": "9c0a502a887dae03", "question": "If a firm is setting up and using the remuneration policy mentioned in 2A.1(12), how do the “principles” it must follow fit with the PRA guidance for significant 1 (PRA Category 1 and 2) Solvency II firms, and what should a Category 1 or 2 firm do if it can’t meet the PRA’s expectations?", "gold_answer": "When a firm establishes and implements the remuneration policy referred to in 2A.1(12), it must follow all of the principles that apply to that policy, and a significant 1 (PRA Category 1 or 2) Solvency II firm can use the supervisory statement as guidance to help it comply with the Chapter 3A requirements in the Conditions Governing Business Part of the PRA Rulebook. [#TGT:9c0a502a887dae03] [#SRC:a1be217c65884ad1] The supervisory statement is positioned as a guide rather than a source of absolute requirements, because the binding requirements are in the directly applicable Solvency II Regulation that came into force on 1 January 2016. [#SRC:a1be217c65884ad1] So, the firm should implement its 2A.1(12) remuneration policy in a way that satisfies the principles, while using the statement to assess and shape its remuneration policies and practices against Chapter 3A. [#TGT:9c0a502a887dae03] [#SRC:a1be217c65884ad1] If a Category 1 or 2 firm cannot meet or exceed the PRA’s expectations described in the supervisory statement, it should inform its PRA supervisory contact. [#SRC:a1be217c65884ad1]", "method": "DPEL", "persona": "basic", "pair_uid": "b47b023690038093"}
{"item_id": "6fb36406ba06417a", "source_passage_id": "93f9d67ba5aa8c4d", "target_passage_id": "a2326f65154f25e3", "question": "When setting and evidencing an institution’s policies and procedures for deciding which positions are included in the trading book for capital requirement calculations, how must those policies incorporate the requirement that trading book positions be unrestricted in tradability or capable of being hedged, and what governance steps must the institution apply to demonstrate compliance?", "gold_answer": "An institution must embed, within its trading book position-allocation policies and procedures used for capital requirement calculations, a control that only permits inclusion of positions that are either not subject to tradability restrictions or can be hedged. [#TGT:a2326f65154f25e3] Those policies and procedures must be clearly defined and used to determine which positions are included in the trading book for the purpose of calculating capital requirements, and they must be designed in line with the referenced trading book framework and with regard to the institution’s risk management capabilities and practices. [#SRC:93f9d67ba5aa8c4d] To demonstrate compliance, the institution must fully document how it complies with its own policies and procedures, including how the tradability/hedgeability condition is applied in the determination process. [#SRC:93f9d67ba5aa8c4d] In addition, the institution must subject these policies and procedures to periodic internal audit, which should therefore cover whether positions included in the trading book meet the requirement of being free of tradability restrictions or able to be hedged. [#SRC:93f9d67ba5aa8c4d][#TGT:a2326f65154f25e3]", "method": "DPEL", "persona": "professional", "pair_uid": "ebe0ee65253ea7fc"}
{"item_id": "f10c3493895b7208", "source_passage_id": "93f9d67ba5aa8c4d", "target_passage_id": "a2326f65154f25e3", "question": "If an institution is deciding whether a position should go into the trading book for capital calculations, what does it need to check about tradability or hedging, and what paperwork and review does it need to keep for its trading book decision process?", "gold_answer": "For a position to be treated as a trading book position under the institution’s decision process for capital calculations, the institution must ensure the position is either not restricted in how it can be traded or, if there are constraints, that it can be hedged. [#TGT:a2326f65154f25e3] This check needs to be built into the institution’s clearly defined policies and procedures that determine which positions are included in the trading book for the purpose of calculating capital requirements, and those policies must be set with regard to the institution’s risk management capabilities and practices. [#SRC:93f9d67ba5aa8c4d] The institution must also fully document that it is following its policies and procedures—meaning it should keep records showing how the tradability/hedgeability requirement was applied when deciding to include a position in the trading book. [#SRC:93f9d67ba5aa8c4d][#TGT:a2326f65154f25e3] Finally, the institution must arrange for periodic internal audit of these policies and procedures, which should include reviewing whether trading book positions meet the tradability-or-hedgeability condition. [#SRC:93f9d67ba5aa8c4d][#TGT:a2326f65154f25e3]", "method": "DPEL", "persona": "basic", "pair_uid": "ebe0ee65253ea7fc"}
{"item_id": "73aa20ca52ff6d38", "source_passage_id": "c5ef344684d38393", "target_passage_id": "b16c73e93c0f2966", "question": "If an institution is required to calculate a single exposure value at netting set level in accordance with Section 3, but it has previously ceased calculating exposure values of its derivative positions under Section 4 or 5, when may it resume using Section 4 or 5 and what must it show to the competent authority?", "gold_answer": "An institution that is otherwise expected to calculate a single exposure value at netting set level under Section 3 may only switch back to calculating the exposure value of its derivative positions under Section 4 or 5 after meeting a specific re-entry condition tied to supervisory demonstration. [#TGT:b16c73e93c0f2966] The precondition is that the institution has ceased to calculate exposure values of its derivative positions in accordance with Section 4 or 5 (as applicable), and it now seeks to resume those Section 4 or 5 calculations rather than continuing solely with the Section 3 netting-set exposure value approach. [#SRC:c5ef344684d38393] To resume Section 4 or 5, the institution must demonstrate to the competent authority that all conditions in Article 273a(1) or Article 273a(2) (as relevant) have been satisfied continuously for an uninterrupted period of one year. [#SRC:c5ef344684d38393] In practical terms, the institution’s ability to move away from the Section 3 single exposure value at netting set level and back to Section 4 or 5 is contingent on that one-year uninterrupted compliance demonstration to the competent authority. [#SRC:c5ef344684d38393][#TGT:b16c73e93c0f2966]", "method": "DPEL", "persona": "professional", "pair_uid": "4b66bfe901b9fe43"}
{"item_id": "9e68cfd93af1fd28", "source_passage_id": "c5ef344684d38393", "target_passage_id": "b16c73e93c0f2966", "question": "An institution normally calculates one exposure value for each netting set under Section 3. If it stopped using Section 4 or 5 for derivative exposure values, what has to happen before it can start using Section 4 or 5 again?", "gold_answer": "Even though institutions are to calculate a single exposure value at netting set level in line with Section 3, an institution that previously stopped calculating derivative exposure values under Section 4 or 5 cannot simply restart those Section 4 or 5 calculations whenever it wants. [#TGT:b16c73e93c0f2966] The rule for restarting is triggered specifically when the institution has ceased to calculate the exposure values of its derivative positions in accordance with Section 4 or 5 (whichever applied to it). [#SRC:c5ef344684d38393] Before it is permitted to resume calculating those derivative exposure values as set out in Section 4 or 5, it must demonstrate to the competent authority that all conditions in Article 273a(1) or Article 273a(2) have been met continuously for one uninterrupted year. [#SRC:c5ef344684d38393] This means the institution’s return to Section 4 or 5 sits alongside the baseline expectation of a Section 3 single exposure value at netting set level, but is only allowed after the one-year uninterrupted-conditions demonstration to the competent authority. [#SRC:c5ef344684d38393][#TGT:b16c73e93c0f2966]", "method": "DPEL", "persona": "basic", "pair_uid": "4b66bfe901b9fe43"}
{"item_id": "8fc8da23008c4b91", "source_passage_id": "8e5451c44f63e11a", "target_passage_id": "b4c97c646d738581", "question": "When the PRA assesses whether a home state supervisor is sufficiently equivalent for the PRA’s authorisation and supervision purposes (distinct from any equivalence determinations HM Treasury may make), what factors must the PRA evaluate and what aspect does it treat as particularly important?", "gold_answer": "For the PRA’s own authorisation and supervision functions, the PRA makes an overall, outcomes-focused judgement on whether the home state supervisor is sufficiently equivalent and whether that supervisor’s regime aligns with the UK regulatory framework in delivering outcomes that support the PRA’s objectives, while treating this assessment as separate from any equivalence determinations HM Treasury may make for other purposes. [#SRC:8e5451c44f63e11a] [#TGT:b4c97c646d738581] In forming that overall view, the PRA considers the relevant factors together rather than in isolation, and it gives considerable weight to the extent and quality of co-operation with the home state supervisor. [#SRC:8e5451c44f63e11a] The PRA also takes into account how individual firms (including branches) are supervised as well as how the consolidated group is supervised, and it considers the nature and scale of the firm’s activities in the UK as part of the equivalence assessment. [#SRC:8e5451c44f63e11a] Although the PRA may provide advice to HM Treasury under Regulation 4 of The Equivalence Determinations for Financial Services and Miscellaneous Provisions (Amendment etc.) (EU Exit) Regulations 2019 (SI 2019/541), that advisory role does not change that the PRA’s equivalence assessment here is for its own authorisation and supervision purposes. [#TGT:b4c97c646d738581]", "method": "DPEL", "persona": "professional", "pair_uid": "e9c7fd0415677b06"}
{"item_id": "254670797c435fc5", "source_passage_id": "8e5451c44f63e11a", "target_passage_id": "b4c97c646d738581", "question": "If the PRA is checking whether a home state supervisor is “equivalent” for the PRA’s own authorisation and supervision (not for HM Treasury’s separate equivalence decisions), what does the PRA look at, and what does it put the most weight on?", "gold_answer": "In the PRA’s equivalence assessment for its own authorisation and supervision, the PRA looks at whether the home state supervisor is sufficiently equivalent and whether its regime fits with the UK regulatory framework in producing outcomes that meet the PRA’s objectives, and it treats this as separate from any equivalence determinations HM Treasury may make for other purposes. [#SRC:8e5451c44f63e11a] [#TGT:b4c97c646d738581] The PRA evaluates the relevant factors as a whole, but it places considerable weight on how strong and effective co-operation is with the home state supervisor. [#SRC:8e5451c44f63e11a] It also considers supervision at both levels—individual firms (including branches) and the consolidated group—and it factors in the nature and scale of the firm’s UK activities when reaching its overall view. [#SRC:8e5451c44f63e11a] Separately, the PRA may provide advice to HM Treasury under Regulation 4 of the 2019 EU Exit equivalence regulations, but that advisory function is distinct from the PRA’s own outcomes-based equivalence assessment for authorisation and supervision. [#TGT:b4c97c646d738581]", "method": "DPEL", "persona": "basic", "pair_uid": "e9c7fd0415677b06"}
{"item_id": "d3176afdca24e1aa", "source_passage_id": "865973d64c7565e2", "target_passage_id": "b3afbbf8d96609e4", "question": "For a credit union with more than £50 million in total assets that also undertakes more complex lending or invests in more complex investment products, how should it use scenario analysis to support proportionate risk management, and what escalation in PRA engagement should it anticipate if there is evidence of poor risk management/governance and it does not engage or make meaningful progress on mitigation plans?", "gold_answer": "A credit union in this profile should treat scenario analysis as a core tool within proportionate risk management, and it should also plan for progressively deeper PRA engagement if risk management or governance is found to be weak and remediation does not progress. [#TGT:b3afbbf8d96609e4] For credit unions with more than £50 million in total assets and/or those undertaking more complex lending (including mortgages or lending to corporates) and/or investing in more complex products (including supranational bonds, corporate bonds, bank bonds, and money market funds), the PRA expects greater engagement and expects them to run scenario analysis to assess how key strategic initiatives and external risks could affect the business. [#SRC:865973d64c7565e2] Scenario analysis can include stresses such as poorer loan book performance, higher arrears, changes to welfare benefits, changes in bank interest rates, or a greater-than-expected increase in shares, and it is presented as good practice to consider combined scenarios. [#SRC:865973d64c7565e2] If there is evidence of poor risk management and/or governance, the credit union should expect the PRA to engage on its mitigation plans; if it then fails to engage or make meaningful progress, it should expect fuller PRA engagement focused on viability and, where viability is lacking, on orderly closure planning (insolvent wind-up, solvent wind-down, or transfer of engagements to another credit union). [#TGT:b3afbbf8d96609e4]", "method": "DPEL", "persona": "professional", "pair_uid": "3ed584e137f90505"}
{"item_id": "1e4763f15724755c", "source_passage_id": "865973d64c7565e2", "target_passage_id": "b3afbbf8d96609e4", "question": "If a credit union is big (over £50 million in total assets) or does more complex lending/investing, what kinds of scenarios should it test, and how does that connect to what the PRA may do if the credit union’s risk management or governance is poor and it doesn’t improve its mitigation plans?", "gold_answer": "A credit union that is larger or more complex should use scenario testing to understand how shocks could affect it, and it should be aware that weak risk management can trigger escalating PRA involvement if fixes do not progress. [#TGT:b3afbbf8d96609e4] For credit unions with more than £50 million in total assets and/or those doing more complex lending (such as mortgages or lending to corporates) and/or investing in more complex products (such as supranational bonds, corporate bonds, bank bonds, and money market funds), the PRA expects them to engage more and expects them to carry out scenario analysis covering the impact of key strategic initiatives and external risks. [#SRC:865973d64c7565e2] The scenarios can include worse-than-expected loan book performance, a bigger-than-expected increase in shares, higher arrears, changes to welfare benefits, and changes in bank interest rates, and it is described as good practice to test combined scenarios rather than only single-factor events. [#SRC:865973d64c7565e2] Separately, credit unions are expected to have risk management systems that are proportionate and adequate for their business; where there is evidence of poor risk management and/or governance, the PRA may engage on mitigation plans, and if the credit union does not engage or make meaningful progress, the PRA may move to fuller engagement about whether the credit union has a viable future and, if not, how it would close in an orderly way (insolvent wind-up, solvent wind-down, or transfer of engagements). [#TGT:b3afbbf8d96609e4]", "method": "DPEL", "persona": "basic", "pair_uid": "3ed584e137f90505"}
{"item_id": "05971e2815dc85b7", "source_passage_id": "da680341ca9e8782", "target_passage_id": "19c9e8d0b9a70534", "question": "For a firm whose general insurance business includes both (i) health insurance based on actuarial principles and (ii) other general insurance business, how should the firm apply the calculation rules so that the correct percentage substitution is used for the health insurance element, and what separate outputs must be produced for each part?", "gold_answer": "A firm with mixed general insurance business must run the relevant calculation provisions separately for each part of its business, and then apply the health-insurance-specific percentage modification only to the health insurance part where it is permitted. [#SRC:da680341ca9e8782] Specifically, where 8.6 applies to such a firm, the rules in 8.2 through 8.6 are required to operate independently for (i) the health insurance based on actuarial principles and (ii) the other general insurance business, so that the firm ends up with a distinct sum under 8.6 for the health insurance part and a distinct sum under 8.5 for the other business. [#SRC:da680341ca9e8782] For the health insurance part (and only that part), 8.5 is applied using a different percentage—8.66% instead of 26%—but only if the conditions in 7.5(1) to (5) are satisfied. [#TGT:19c9e8d0b9a70534] The practical result is that the firm must (a) calculate the health insurance component on its own track and, when eligible, use the substituted 8.66% rate within the 8.5 application for that component, and (b) calculate the non-health component separately and produce the sum under 8.5 for that other business without that health-insurance substitution. [#SRC:da680341ca9e8782] [#TGT:19c9e8d0b9a70534]", "method": "DPEL", "persona": "professional", "pair_uid": "44a1d2cb0d92b4c5"}
{"item_id": "d4b2e005a6aa6357", "source_passage_id": "da680341ca9e8782", "target_passage_id": "19c9e8d0b9a70534", "question": "If a firm sells both health insurance based on actuarial principles and other general insurance, do they have to do the calculations separately, and when can they use 8.66% instead of 26%?", "gold_answer": "Yes—when the firm’s general insurance business is split between health insurance based on actuarial principles and other business, the calculation rules must be run separately for each part so the outputs are kept distinct. [#SRC:da680341ca9e8782] In that situation, 8.2 to 8.6 are applied independently to each part, producing a sum under 8.6 for the health insurance part and a separate sum under 8.5 for the other business part. [#SRC:da680341ca9e8782] For the health insurance part specifically, there is a special adjustment to how 8.5 is applied: the percentage used is changed from 26% to 8.66%, but only where the conditions in 7.5(1) to (5) are met. [#TGT:19c9e8d0b9a70534] Putting these together, the firm should (1) isolate the health insurance calculations from the other business calculations, (2) apply the 8.66% substitution only within the health insurance track and only if the stated 7.5 conditions are satisfied, and (3) still produce the separate sums required for each part (8.6 for health insurance and 8.5 for other business). [#SRC:da680341ca9e8782] [#TGT:19c9e8d0b9a70534]", "method": "DPEL", "persona": "basic", "pair_uid": "44a1d2cb0d92b4c5"}
{"item_id": "9f305def52bf28ea", "source_passage_id": "783eb897186947a6", "target_passage_id": "d0f5710ab3cb3488", "question": "When determining S i and S j for sub-modules within a module, how should an insurer decide whether the capital requirement is generated directly by the standard formula or calculated under 16F.3, and how does that decision affect the requirement to use the 16F.1 formula for sub-modules referenced in 16F.2(8)(b)?", "gold_answer": "S i and S j are the capital requirements for sub-modules i and j within a particular module, and the method used depends on whether the relevant sub-module is itself composed of other sub-modules. [#SRC:783eb897186947a6] If a sub-module does not consist of other sub-modules, its capital requirement is generated by the standard formula (i.e., produced directly by that formula rather than via a further aggregation step). [#SRC:783eb897186947a6] If, instead, the sub-module consists of other sub-modules, its capital requirement is calculated in accordance with 16F.3. [#SRC:783eb897186947a6] For the category of sub-modules that fall under 16F.2(8)(b)—i.e., those sub-modules whose capital requirement is determined via the 16F.3 route because they consist of other sub-modules—the capital requirement for that particular sub-module must be generated using the formula set out in 16F.1, applying the stated specifications. [#TGT:d0f5710ab3cb3488] In practice, this means the structural test in 16F.2(8) (whether the sub-module contains other sub-modules) determines whether the 16F.1 formula requirement is triggered for that sub-module under the 16F.2(8)(b) pathway. [#SRC:783eb897186947a6][#TGT:d0f5710ab3cb3488]", "method": "DPEL", "persona": "professional", "pair_uid": "df04395ac0e8ab89"}
{"item_id": "5ec25868b7089b08", "source_passage_id": "783eb897186947a6", "target_passage_id": "d0f5710ab3cb3488", "question": "If a sub-module is made up of other sub-modules, what method is used to calculate its capital requirement, and what extra rule applies to those sub-modules mentioned in 16F.2(8)(b) about using the 16F.1 formula?", "gold_answer": "Where a sub-module consists of other sub-modules, its capital requirement is not generated directly as a stand-alone standard-formula sub-module; instead, it is calculated in accordance with 16F.3. [#SRC:783eb897186947a6] This is the situation described in 16F.2(8)(b), which distinguishes composite sub-modules from sub-modules that do not contain other sub-modules. [#SRC:783eb897186947a6] For all sub-modules of the standard formula that are referred to in 16F.2(8)(b), there is an additional requirement about how the capital requirement must be produced: the capital requirement of the particular sub-module must be generated by the formula set out in 16F.1, and it must be done using the specifications that follow that instruction. [#TGT:d0f5710ab3cb3488] Put together, you first identify that the sub-module is composite (so it falls under the 16F.3 calculation route), and then, because it is one of the sub-modules referenced in 16F.2(8)(b), you ensure the capital requirement is generated using the 16F.1 formula with the stated specifications. [#SRC:783eb897186947a6][#TGT:d0f5710ab3cb3488]", "method": "DPEL", "persona": "basic", "pair_uid": "df04395ac0e8ab89"}
{"item_id": "e9ff12bdf9b28f31", "source_passage_id": "ae60277c11940928", "target_passage_id": "b7ac6dbd1a20206b", "question": "For purposes of determining whether Articles 30–32 of MODR and Conditions Governing Business 7 apply to an arrangement, how should a firm distinguish between (i) an arrangement that is “outsourcing” under the PRA Rulebook definition (including sub-outsourcing and the “otherwise undertaken by the firm itself” test) and (ii) a non-outsourcing “third party” relationship as defined in the SS, and what role does the “recurrent or ongoing basis” consideration play in that classification?", "gold_answer": "Articles 30–32 of MODR and Conditions Governing Business 7 apply only where the arrangement meets the applicable definition of “outsourcing”; arrangements that fall outside that definition are not captured by those requirements even if they involve a third party. [#SRC:ae60277c11940928] To classify an arrangement as outsourcing, the firm should assess whether it is an arrangement (of any form) under which a service provider performs a process, service, or activity—directly or via sub-outsourcing—that the firm would otherwise carry out itself. [#TGT:b7ac6dbd1a20206b] In parallel, the SS frames “third party” more broadly as any organisation that has a business relationship or contract with the firm to provide a product or service, which can include relationships that are not outsourcing. [#SRC:ae60277c11940928] When deciding whether a third-party arrangement is within the outsourcing definition (and therefore within scope of the MODR/PRA Rulebook outsourcing requirements), the firm should also consider whether the third party will perform the relevant function or service (or part of it) on a recurrent or ongoing basis, consistent with the EBA Outsourcing GL approach described. [#TGT:b7ac6dbd1a20206b] Accordingly, the firm should (i) identify the counterparty as a “third party” under the SS where there is a contract/business relationship for a product or service, and then (ii) apply the PRA Rulebook outsourcing tests (including “otherwise undertaken by the firm itself,” sub-outsourcing, and recurrence/ongoing performance) to determine whether the outsourcing-specific requirements apply. [#SRC:ae60277c11940928] [#TGT:b7ac6dbd1a20206b]", "method": "DPEL", "persona": "professional", "pair_uid": "dfdc287b585a547d"}
{"item_id": "ae3a86371d734517", "source_passage_id": "ae60277c11940928", "target_passage_id": "b7ac6dbd1a20206b", "question": "If a firm has a contract with an organisation to provide a product or service, how can it tell whether this is just a “third party” relationship or whether it counts as “outsourcing” that brings in Articles 30–32 of MODR and Conditions Governing Business 7, especially if the work is done repeatedly or on an ongoing basis (including through sub-outsourcing)?", "gold_answer": "A contract for a product or service makes the counterparty a “third party” under the SS, but that label alone does not mean the arrangement is “outsourcing” for regulatory scope. [#SRC:ae60277c11940928] The outsourcing-specific requirements in Articles 30–32 of MODR and Conditions Governing Business 7 apply only to arrangements that meet the outsourcing definition referenced in the SS, and they do not extend to other third-party arrangements outside that definition. [#SRC:ae60277c11940928] To decide if the third-party relationship is outsourcing, the firm should check whether the arrangement is one where a service provider performs a process, service, or activity that the firm would otherwise do itself, and this can be performed either directly or through sub-outsourcing. [#TGT:b7ac6dbd1a20206b] The firm should also factor in whether the third party will carry out the relevant function or service (or part of it) on a recurrent or ongoing basis, because that consideration is used when assessing whether the arrangement falls within the outsourcing definition. [#TGT:b7ac6dbd1a20206b] Putting these together, the firm should first recognise the existence of a third-party contract, then apply the “otherwise undertaken by the firm itself” and sub-outsourcing elements, and finally use the recurrent/ongoing performance indicator to support the classification decision that determines whether the outsourcing requirements apply. [#SRC:ae60277c11940928] [#TGT:b7ac6dbd1a20206b]", "method": "DPEL", "persona": "basic", "pair_uid": "dfdc287b585a547d"}
{"item_id": "0b9d75ebed86bb17", "source_passage_id": "701ce6aa38be752a", "target_passage_id": "9d80cba8634278ab", "question": "When calculating the basic SCR, under what conditions may a firm recognise a guarantee and, if the exposure is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1, how must that exposure be treated for the purposes of 3D31.3(1)?", "gold_answer": "A firm may recognise a guarantee in the calculation of the basic SCR only if the Chapter explicitly allows recognition of that type of guarantee and the guarantee also satisfies the qualitative criteria referenced in 3G2 and 3G3, together with the additional criteria that the Chapter requires to be met. [#TGT:9d80cba8634278ab] Where the guarantee being relied on is one that is fully, unconditionally and irrevocably provided by a body listed in 3D1, and the guarantee meets the requirements set out in 3G9, the firm must treat the resulting exposure as an exposure to the central government for the purposes of 3D31.3(1). [#SRC:701ce6aa38be752a] In practice, this means the firm needs both (i) a basis in the Chapter to recognise the guarantee for basic SCR purposes and (ii) confirmation that the guarantee meets the relevant qualitative and other criteria, while separately applying the specific treatment rule that reclassifies the exposure to central government when the 3D1/3G9 conditions are satisfied. [#TGT:9d80cba8634278ab] [#SRC:701ce6aa38be752a]", "method": "DPEL", "persona": "professional", "pair_uid": "9f4064a21340b184"}
{"item_id": "0a2b67ce8c99eb9f", "source_passage_id": "701ce6aa38be752a", "target_passage_id": "9d80cba8634278ab", "question": "If a firm is working out the basic SCR, when is it allowed to count a guarantee, and what does it do with an exposure that is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1 (assuming the guarantee meets 3G9)?", "gold_answer": "For basic SCR purposes, a firm is allowed to recognise a guarantee only when this Chapter explicitly says that guarantees can be recognised, and only if the guarantee meets the qualitative criteria in 3G2 and 3G3 as well as the other criteria required by the Chapter. [#TGT:9d80cba8634278ab] Separately, for the purposes of 3D31.3(1), if the exposure is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1 and the guarantee meets the requirements in 3G9, the firm must treat that exposure as an exposure to the central government. [#SRC:701ce6aa38be752a] Put together, the firm needs to (1) check that the Chapter actually permits recognising the guarantee in the basic SCR calculation and that the qualitative and other criteria are met, and (2) apply the specific classification outcome for exposures that meet the 3D1 and 3G9 guarantee conditions by treating them as central government exposures for 3D31.3(1). [#TGT:9d80cba8634278ab] [#SRC:701ce6aa38be752a]", "method": "DPEL", "persona": "basic", "pair_uid": "9f4064a21340b184"}
{"item_id": "4bb7b4067be08563", "source_passage_id": "4b7d02b366371a2f", "target_passage_id": "1ac71628712a0761", "question": "For a Conduct Rules non-executive director, how does the requirement to comply at all times with the conduct standards specified in 3.1 to 3.3, 3.7 and 3.8 interact with Senior Manager Conduct Standard 4 on disclosing information the FCA or the PRA would reasonably expect to have notice of, and what does this mean in practice for ongoing disclosure expectations?", "gold_answer": "A Conduct Rules non-executive director is required to comply continuously with the specified conduct standards (3.1 to 3.3, 3.7 and 3.8), meaning the obligation is ongoing rather than event-driven. [#SRC:4b7d02b366371a2f] In practice, that continuous compliance framework must be applied in a way that includes meeting the disclosure expectation described in Senior Manager Conduct Standard 4, namely that the individual discloses appropriately any information that the FCA or the PRA would reasonably expect to be told. [#TGT:1ac71628712a0761] Taken together, this means the director should treat disclosure as part of their day-to-day conduct posture: when they become aware of information that would reasonably be expected to be notified to the FCA or the PRA, they should ensure it is disclosed in an appropriate manner, and they should do so on an ongoing basis consistent with the “at all times” nature of their conduct standards compliance. [#SRC:4b7d02b366371a2f] The key practical implication is that the disclosure duty is not limited to periodic reporting; it is aligned with continuous adherence to the applicable conduct standards and is triggered by the reasonable expectations of the FCA or the PRA regarding notice of the information. [#TGT:1ac71628712a0761]", "method": "DPEL", "persona": "professional", "pair_uid": "f8006dad82c77ed0"}
{"item_id": "12413a32be23e7b5", "source_passage_id": "4b7d02b366371a2f", "target_passage_id": "1ac71628712a0761", "question": "If you are a Conduct Rules non-executive director, what do you need to do “at all times,” and how does that connect to the rule that you must tell the FCA or the PRA information they would reasonably expect to know about?", "gold_answer": "If you are a Conduct Rules non-executive director, you have a continuous duty to follow the conduct standards listed as 3.1 to 3.3, 3.7 and 3.8, meaning you are expected to comply at all times rather than only at specific moments. [#SRC:4b7d02b366371a2f] Alongside that always-on expectation, Senior Manager Conduct Standard 4 requires you to disclose appropriately any information that the FCA or the PRA would reasonably expect to have notice of. [#TGT:1ac71628712a0761] Putting these together, you should treat disclosure as part of your ongoing conduct: when you have information that the FCA or the PRA would reasonably expect to be told, you should make an appropriate disclosure, and you should do so in a way that fits with the fact that your conduct standards compliance is required at all times. [#SRC:4b7d02b366371a2f] The practical takeaway is that your compliance posture is continuous, and within that posture you must be ready to provide appropriate notice to the FCA or the PRA whenever the information meets the “reasonably expect to have notice” threshold. [#TGT:1ac71628712a0761]", "method": "DPEL", "persona": "basic", "pair_uid": "f8006dad82c77ed0"}
{"item_id": "0e819870aee88da7", "source_passage_id": "b59ae9eaea39bc4b", "target_passage_id": "d8d2715150b31137", "question": "For group solvency calculated under method 1, how should an SCR be determined when it must be based on consolidated data and must also incorporate data from collective investment undertakings and investments packaged as funds that are subsidiaries of the parent undertaking? In that context, what constitutes the consolidated data set used for the calculation?", "gold_answer": "When calculating group solvency under method 1, the consolidated data set is the defined basis on which the SCR is calculated, and it is not optional: the SCR must be calculated on the basis of consolidated data, and that consolidated data is the data used for the method 1 group solvency calculation [#TGT:d8d2715150b31137]. In applying that basis, the SCR calculation must also incorporate, within the consolidated data used, the data of collective investment undertakings and investments packaged as funds where those entities are subsidiaries of the parent undertaking, because the SCR is to be calculated on that consolidated basis and expressly includes those subsidiary data elements [#SRC:b59ae9eaea39bc4b]. The calculation must follow the rules laid down in the Solvency Capital Requirement - General Provisions, Solvency Capital Requirement – Internal Models and Solvency Capital Requirement – Standard Formula Parts, meaning the procedural approach to calculating the SCR is governed by those SCR rule sets while the definitional anchor for what data is consolidated is tied to the method 1 group solvency consolidated data concept [#SRC:b59ae9eaea39bc4b] and [#TGT:d8d2715150b31137].", "method": "SCHEMA", "persona": "professional", "pair_uid": "c8dc4ae723a34871"}
{"item_id": "d6aa54e920d3620c", "source_passage_id": "b59ae9eaea39bc4b", "target_passage_id": "d8d2715150b31137", "question": "When the parent undertaking calculates the SCR for method 1 group solvency, what does it mean to use “consolidated data,” and does that consolidated data need to include data from collective investment undertakings and investments packaged as funds that are subsidiaries?", "gold_answer": "Using “consolidated data” means the SCR for method 1 group solvency is calculated on a consolidated basis, i.e., using the consolidated data set that is specified for the calculation of group solvency according to method 1 [#TGT:d8d2715150b31137]. In that same calculation, the consolidated basis is not limited to traditional operating subsidiaries: it must also take in the data of collective investment undertakings and investments packaged as funds when those are subsidiaries of the parent undertaking, because the SCR is described as being calculated on the basis of consolidated data and explicitly references those subsidiary fund-related data elements as part of what is used in the calculation [#SRC:b59ae9eaea39bc4b]. The procedural aspect is that the parent undertaking must perform the SCR calculation by applying the rules laid down in the Solvency Capital Requirement - General Provisions, Solvency Capital Requirement – Internal Models and Solvency Capital Requirement – Standard Formula Parts, while the definitional aspect is that the consolidated data set is the basis for the method 1 group solvency calculation [#SRC:b59ae9eaea39bc4b] and [#TGT:d8d2715150b31137].", "method": "SCHEMA", "persona": "basic", "pair_uid": "c8dc4ae723a34871"}
{"item_id": "3b34ebd952c706e6", "source_passage_id": "4baeb76490d6d9b2", "target_passage_id": "e722345e3cfbec34", "question": "When a firm is determining the risk factor stress i for a securitisation that was issued before 18 January 2015 and is assessed against the type 1 criteria in the version of Article 177 that applied on 31 December 2018, must the firm treat that earlier Article 177 as still operative even though it was later deleted, and apply it for this purpose?", "gold_answer": "Yes. The firm’s obligation to assign a risk factor stress i for securitisations issued before 18 January 2015 depends on applying Articles 177 and 178 in the version of Commission Delegated Regulation (EU) 2015/35 that was in force on 31 December 2018, and on the securitisation qualifying as a type 1 securitisation in accordance with Article 177(4) in that same version [#TGT:e722345e3cfbec34]. The scope provision confirms that, for the purposes of 3D22.3 and 3D22.4, Article 177 in the version in force on 31 December 2018 continues to have effect notwithstanding its deletion by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, and that it has effect for those purposes with modifications [#SRC:4baeb76490d6d9b2]. Read together, the firm must therefore rely on the continued-effect version of Article 177 (and apply Article 178 alongside it) when assigning the risk factor stress i for the specified pre-18 January 2015 securitisations, even though Article 177 was deleted later, because the obligation is expressly tied to the 31 December 2018 version and the scope provision preserves its effect for the relevant purposes.", "method": "SCHEMA", "persona": "professional", "pair_uid": "ce92396d8db7aace"}
{"item_id": "9b5873ac6adcdc56", "source_passage_id": "4baeb76490d6d9b2", "target_passage_id": "e722345e3cfbec34", "question": "If a firm is working out risk factor stress i for a securitisation issued before 18 January 2015, does it still have to use the older Article 177 rules (the version in force on 31 December 2018) even though Article 177 was later deleted?", "gold_answer": "Yes. For securitisations issued before 18 January 2015, where the securitisation qualifies as a type 1 securitisation under Article 177(4) in the version of Commission Delegated Regulation (EU) 2015/35 that was in force on 31 December 2018, the firm must assign a risk factor stress i in accordance with Articles 177 and 178 in that same 31 December 2018 version [#TGT:e722345e3cfbec34]. The scope text explains why the firm can and must still use that older Article 177 framework: for the purposes of 3D22.3 and 3D22.4, Article 177 (in the version in force on 31 December 2018) continues to have effect even though it was deleted by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, and it applies for those purposes with modifications [#SRC:4baeb76490d6d9b2]. Putting these together, the firm’s required calculation step (assigning risk factor stress i) is anchored to the preserved, continued-effect version of Article 177 and the related Article 178, specifically for the pre-18 January 2015 securitisations described.", "method": "SCHEMA", "persona": "basic", "pair_uid": "ce92396d8db7aace"}
{"item_id": "f2d2bb80e1b8797e", "source_passage_id": "a3e72f5534ea6d57", "target_passage_id": "afb555cc7b93169d", "question": "Where a firm has approval to use the risk-free interest rate transitional measure and is required to submit a phasing-in plan, what annual reporting must it provide to the PRA, and what compliance objective and deadline must that report address?", "gold_answer": "A firm with approval to use the risk-free interest rate transitional measure must meet an ongoing annual reporting obligation to the PRA when it is also required to submit a phasing-in plan. In that case, the firm must submit a report each year to the PRA that explains (i) what measures it has taken and (ii) what progress it has made toward achieving the required end-state. The report is specifically framed around ensuring compliance with the SCR by 1 January 2032, so the annual update must be oriented to that compliance objective and timeline, rather than being a general status update. This annual reporting requirement applies in addition to, and in the context of, the firm’s approval to use the transitional measure and the related phasing-in plan requirement, and it is directed to the PRA as the recipient. These obligations arise from the conditions described in the source requirement [#SRC:a3e72f5534ea6d57] and are tied to the baseline statement that a firm with such approval must comply with specified requirements [#TGT:afb555cc7b93169d].", "method": "SCHEMA", "persona": "professional", "pair_uid": "238bae2fc37466e7"}
{"item_id": "544cb72002a12c07", "source_passage_id": "a3e72f5534ea6d57", "target_passage_id": "afb555cc7b93169d", "question": "If a firm has approval to use the risk-free interest rate transitional measure and also has to submit a phasing-in plan, what does it have to send to the PRA every year, and what deadline must that update be working toward?", "gold_answer": "If a firm has approval to use the risk-free interest rate transitional measure, and it is also required to submit a phasing-in plan, it must provide an annual report to the PRA. That yearly report must set out two things: the measures the firm has taken and the progress it has made. The purpose of the report is not open-ended; it must be focused on demonstrating how the firm is moving toward compliance with the SCR, and it must be framed against the deadline of 1 January 2032. In other words, the firm must use the annual report to show what it has done and how far it has come in ensuring it will meet the SCR by that date, and it must submit this report to the PRA each year. This answer reflects the specific annual reporting requirement and its content and deadline [#SRC:a3e72f5534ea6d57], read together with the target statement that a firm with approval to use the risk-free interest rate transitional measure must comply with applicable requirements [#TGT:afb555cc7b93169d].", "method": "SCHEMA", "persona": "basic", "pair_uid": "238bae2fc37466e7"}
{"item_id": "6444af3d2d985d48", "source_passage_id": "5eee0f901c042e7e", "target_passage_id": "8c09e01dcc86affd", "question": "For the future version of the definitions provision that applies after 01/01/2027, how should a firm determine which parts continue to apply in the CRR versus which parts are instead set out elsewhere or deleted?", "gold_answer": "The SOURCE establishes that you are dealing with the future version of the definitions provision that applies after 01/01/2027, so the compliance task is to map that future-dated definitions framework to where the operative text is located and whether any elements have been removed [#SRC:5eee0f901c042e7e]. The TARGET provides the necessary cross-reference map: it indicates that a set of paragraphs remain in the CRR, another set is set out above at rule 1.2, and one paragraph has been deleted [#TGT:8c09e01dcc86affd]. Read together, the correct approach is (i) treat the “remain in the CRR” items as continuing to be sourced from the CRR, (ii) treat the items “set out above at rule 1.2” as relocated and therefore to be applied from that location rather than from the CRR text, and (iii) treat the “deleted” item as no longer applicable because it has been removed. This combined reading ensures the future version is implemented using the TARGET’s allocation of where each component is found or whether it exists at all.", "method": "SCHEMA", "persona": "professional", "pair_uid": "f5e2549e62435f6d"}
{"item_id": "b26da73da7eebcd9", "source_passage_id": "5eee0f901c042e7e", "target_passage_id": "8c09e01dcc86affd", "question": "After 01/01/2027, when you look up the future version of the definitions provision, what should you do if some parts still sit in the CRR, some are moved to another place, and one part is removed?", "gold_answer": "Start by recognizing that the SOURCE is pointing you to the future version of the definitions provision that applies after 01/01/2027, so you should not assume all definitions content is in one place for that future date [#SRC:5eee0f901c042e7e]. Then use the TARGET note to decide where to find each part and whether it still exists: it states that certain paragraphs remain in the CRR, certain other paragraphs are set out above at rule 1.2, and one paragraph has been deleted [#TGT:8c09e01dcc86affd]. Practically, that means you should (1) consult the CRR for the paragraphs identified as remaining there, (2) consult rule 1.2 for the paragraphs identified as being set out above, and (3) not apply the deleted paragraph because it has been removed. Using both passages together avoids relying on an outdated or incomplete location for the definitions after the stated date.", "method": "SCHEMA", "persona": "basic", "pair_uid": "f5e2549e62435f6d"}
{"item_id": "253273d8df01efe7", "source_passage_id": "40535db1194b8610", "target_passage_id": "ac036858232f3caf", "question": "Where a provision in this Part is not itself a CRR rule, how must its interpretation be handled so that it aligns with the approach for CRR rules and rules made under section 192XA FSMA, including the meaning of words and expressions and any exception where a contrary intention is evident?", "gold_answer": "When a rule in this Part is not a CRR rule, its scope is nevertheless brought within the CRR interpretive framework by requiring that the Interpretation Part’s relevant interpretive provision applies to it as though it were a CRR rule [#SRC:40535db1194b8610]. In parallel, the interpretive baseline for CRR rules and rules made under section 192XA FSMA is that they are to be read as if they formed part of CRR, so that the words and expressions used in those rules take their meaning from CRR rather than from the Glossary to the Rulebook [#TGT:ac036858232f3caf]. Read together, these scope statements mean that, for non-CRR rules within this Part, the intended effect is to treat them like CRR rules for interpretive purposes, thereby anchoring terminology to CRR meanings and avoiding Glossary meanings. This alignment is not absolute: the target text makes clear that the CRR-based reading applies unless a contrary intention appears, so any evident contrary intention would displace the default CRR-meaning approach even where the rule is otherwise treated as if it were a CRR rule.", "method": "SCHEMA", "persona": "professional", "pair_uid": "1d10c725ff93c556"}
{"item_id": "b82c1f3985c42d6e", "source_passage_id": "40535db1194b8610", "target_passage_id": "ac036858232f3caf", "question": "If a rule in this Part is not a CRR rule, do you still read it using the same interpretation approach as CRR rules and rules made under section 192XA FSMA, and when would that default approach not apply?", "gold_answer": "Yes. The source scope statement says that, to the extent the rules in this Part are not CRR rules, the Interpretation Part’s relevant interpretive provision applies to those rules as if they were CRR rules [#SRC:40535db1194b8610]. The target scope statement then explains what that CRR-style reading entails for CRR rules and rules made under section 192XA FSMA: they are read as if they formed part of CRR, and the words and expressions used in those rules take the meaning they have in CRR rather than the meaning in the Glossary to the Rulebook [#TGT:ac036858232f3caf]. Putting the two together, a non-CRR rule in this Part is still intended to be interpreted on a CRR basis, including using CRR meanings for terms instead of Glossary meanings, because it is treated as if it were a CRR rule for interpretation. However, the target text also sets a boundary: this CRR-based reading applies only unless a contrary intention appears, so if the text shows a contrary intention, that would override the default interpretive approach.", "method": "SCHEMA", "persona": "basic", "pair_uid": "1d10c725ff93c556"}
{"item_id": "45667184bce247a4", "source_passage_id": "c30fbe1b93b553fa", "target_passage_id": "c7e7f33bf6b32c41", "question": "When an institution determines its liquidity outflows under the applicable Chapter 2 framework, how must it apply the required run-off/drawdown calculation to the outstanding balances of liabilities and off-balance sheet commitments, and how should that calculation be understood alongside the definition of a liquidity buffer as the amount of level 1 assets and level 2 assets the institution holds?", "gold_answer": "An institution must calculate liquidity outflows by taking the outstanding balances for each relevant category or type of liabilities and off-balance sheet commitments and applying the specified run-off or drawdown rates to those balances, producing the required outflow amounts under the Chapter 2 approach [#TGT:c7e7f33bf6b32c41]. This required outflow calculation should be read together with the definition of the institution’s liquidity buffer, which is defined as the amount of level 1 assets and level 2 assets that the institution holds in accordance with the Liquidity Coverage Ratio framework [#SRC:c30fbe1b93b553fa]. In practical compliance terms, the outflow side is determined by multiplying balances by expected run-off/drawdown rates for the relevant liability and commitment types, while the buffer concept identifies the stock of qualifying assets (level 1 and level 2) the institution holds under the same overarching liquidity coverage context. Together, these provisions link the institution’s required method for quantifying expected liquidity outflows with the defined composition and measurement basis of the liquidity buffer that the institution holds.", "method": "SCHEMA", "persona": "professional", "pair_uid": "cc2a9a70bbb1b3ba"}
{"item_id": "3f2880697b40d3f9", "source_passage_id": "c30fbe1b93b553fa", "target_passage_id": "c7e7f33bf6b32c41", "question": "If an institution is working out liquidity outflows, what does it have to do with the balances of its liabilities and off-balance sheet commitments, and how does that fit with what a liquidity buffer means (the amount of level 1 and level 2 assets the institution holds)?", "gold_answer": "To work out liquidity outflows, an institution must take the outstanding balances of the relevant categories or types of liabilities and off-balance sheet commitments and multiply those balances by the rates that show how much they are expected to run off or be drawn down under the Chapter 2 approach [#TGT:c7e7f33bf6b32c41]. This required calculation sits alongside the definition of a liquidity buffer, which means the amount of level 1 assets and level 2 assets that an institution holds in accordance with the Liquidity Coverage Ratio framework [#SRC:c30fbe1b93b553fa]. Read together, the target text tells the institution exactly how to quantify expected cash outflows (a balance times a run-off/drawdown rate), while the source text clarifies what is meant by the liquidity buffer the institution holds—namely, a measured amount of qualifying assets split into level 1 and level 2. The combined effect is that the institution uses the prescribed multiplication method to quantify outflows and uses the defined liquidity buffer concept to identify and measure the qualifying asset holdings referenced in the same liquidity coverage context.", "method": "SCHEMA", "persona": "basic", "pair_uid": "cc2a9a70bbb1b3ba"}
{"item_id": "b02413296a54c7db", "source_passage_id": "6ed49c6d770ad510", "target_passage_id": "9f2e6ec1c2bc29ca", "question": "How must a UK Solvency II firm, the Society and managing agents implement and maintain a risk management system so that it both sets approved risk tolerance limits (including for liquidity risk) and also operates as an effective, continuous system for identifying, measuring, monitoring, managing and reporting risks at individual and aggregated levels, including interdependencies?", "gold_answer": "A UK Solvency II firm, the Society and managing agents must implement and maintain a risk management system that includes approved risk tolerance limits designed to implement the insurer’s risk strategy and support control mechanisms, and the system should be supported by a clearly defined liquidity risk appetite statement with senior management identifying material sources of liquidity risk and setting prudent limits for those sources [#SRC:6ed49c6d770ad510]. In parallel, a firm must ensure the risk-management system is effective in practice and is not limited to high-level statements: it must comprise strategies, processes and reporting procedures that enable the firm to identify, measure, monitor, manage and report risks on a continuous basis, both individually and in aggregate, including understanding interdependencies among risks [#TGT:9f2e6ec1c2bc29ca]. Read together, the requirements mean the firm’s approved tolerance limits and liquidity appetite must be embedded into the system’s ongoing measurement, monitoring and reporting processes, so that limits are operationally enforceable and management information supports continuous oversight and control at both risk-by-risk and portfolio-wide levels.", "method": "SCHEMA", "persona": "professional", "pair_uid": "33ff5729e8ec9f1e"}
{"item_id": "c9d4c4d0655fdb31", "source_passage_id": "6ed49c6d770ad510", "target_passage_id": "9f2e6ec1c2bc29ca", "question": "What does a firm have to put in place to implement and maintain a risk management system that includes approved risk tolerance limits (including for liquidity risk) and also continuously identifies, measures, monitors, manages, and reports risks both one-by-one and in total, including how they affect each other?", "gold_answer": "A firm must implement and maintain a risk management system that includes approved risk tolerance limits which put the insurer’s risk strategy into practice and help enable control mechanisms; for a UK Solvency II firm, the Society and managing agents, this is aligned with the expectation to maintain a clearly defined liquidity risk appetite statement, with senior management identifying material sources of liquidity risk and setting prudent limits for those sources [#SRC:6ed49c6d770ad510]. At the same time, the firm must ensure the system is effective and built from concrete components—strategies, processes and reporting procedures—so it can identify, measure, monitor, manage and report risks on a continuous basis, at both an individual risk level and an aggregated level, and also capture the interdependencies between risks [#TGT:9f2e6ec1c2bc29ca]. Together, these points require that risk tolerance limits and liquidity appetite are not standalone documents: they must be integrated into ongoing monitoring and reporting so the firm can track exposures, enforce limits, and understand how different risks interact over time.", "method": "SCHEMA", "persona": "basic", "pair_uid": "33ff5729e8ec9f1e"}
{"item_id": "c0050914bfebaeec", "source_passage_id": "f531114f03d67d24", "target_passage_id": "01b09661643bb171", "question": "When Institutions are required to make leverage ratio disclosures, what specific scope of information must they disclose, including how the leverage ratio is determined and what risk management aspect must be covered, and how does this relate to the requirement to make the disclosures required under the CRR?", "gold_answer": "Institutions must make leverage ratio disclosures that satisfy two linked obligations: first, they must make the leverage ratio disclosures that are required under the CRR framework for leverage ratio disclosure [#SRC:f531114f03d67d24]; second, the content of those disclosures must include information about their leverage ratio as calculated in accordance with the specified leverage ratio calculation basis and must also address their management of the risk of excessive leverage [#TGT:01b09661643bb171]. Read together, this means the actor (“Institutions”) is not only required to produce leverage ratio disclosures as a matter of obligation, but must ensure that the disclosures cover both (i) the leverage ratio figure determined using the referenced calculation approach and (ii) the institution’s management of the risk arising from excessive leverage. The disclosure duty is therefore both procedural (to make the required disclosures) and substantive (to include the specified leverage ratio and risk-management information), and Institutions should align their disclosure package so that the required CRR leverage ratio disclosures are populated with the information elements expressly tied to leverage ratio calculation and excessive leverage risk management [#SRC:f531114f03d67d24] [#TGT:01b09661643bb171].", "method": "SCHEMA", "persona": "professional", "pair_uid": "21eff5fcfd270c93"}
{"item_id": "ad3f3038b4512eb7", "source_passage_id": "f531114f03d67d24", "target_passage_id": "01b09661643bb171", "question": "What do Institutions have to disclose about the leverage ratio, and what extra topic about risk must be included, when they make the leverage ratio disclosures required under the CRR?", "gold_answer": "Institutions have to make leverage ratio disclosures that meet the CRR requirement to provide leverage ratio disclosures [#SRC:f531114f03d67d24], and those disclosures must include specific information about (1) their leverage ratio as calculated using the referenced leverage ratio calculation basis and (2) how they manage the risk of excessive leverage [#TGT:01b09661643bb171]. In practice, this means the obligation is not satisfied by a generic statement that a leverage ratio exists; Institutions must disclose information that is explicitly tied to the leverage ratio calculation and must also cover their management of the risk that leverage becomes excessive. The two texts work together: one establishes that Institutions must make the leverage ratio disclosures required under the CRR, and the other clarifies what information those disclosures must contain—both the calculated leverage ratio information and the risk-management information. Institutions should therefore ensure their leverage ratio disclosure package includes both elements so that the required CRR disclosures are complete and aligned with the specified scope [#SRC:f531114f03d67d24] [#TGT:01b09661643bb171].", "method": "SCHEMA", "persona": "basic", "pair_uid": "21eff5fcfd270c93"}
{"item_id": "1ac538a528fd6fc4", "source_passage_id": "d73e36dd5bef0292", "target_passage_id": "e36647fee0846ae4", "question": "When a firm is required to provide quarterly information to the PRA using the applicable templates, what must it submit and by what deadline after each quarter of the firm’s financial year?", "gold_answer": "Where the obligation is to provide quarterly information to the PRA using the applicable templates, the firm must do so by submitting the quarterly quantitative reporting templates and ensuring they are delivered within the specified post‑quarter timeframe. The TARGET establishes that Firms must submit information to the PRA on a quarterly basis using the relevant templates (as applicable), which frames the recurring reporting cadence and the use of templates for that submission [#TGT:e36647fee0846ae4]. The SOURCE then specifies the concrete content and timing requirement for that quarterly submission: a firm must submit the quarterly quantitative reporting templates and must do so no later than 30 business days after the end of each quarter of the firm’s financial year [#SRC:d73e36dd5bef0292]. Read together, the firm’s quarterly PRA submission must be made via the applicable templates and must meet the 30‑business‑day deadline measured from the end of each financial-year quarter. This means the firm should align its internal close and validation processes so that the required quantitative templates are completed and submitted to the PRA within that deadline for every quarter.", "method": "SCHEMA", "persona": "professional", "pair_uid": "e9161d5e88ce09ef"}
{"item_id": "45b35734bb4834e3", "source_passage_id": "d73e36dd5bef0292", "target_passage_id": "e36647fee0846ae4", "question": "If Firms have to send quarterly information to the PRA using the right templates, what exactly must a firm submit each quarter and how soon after the quarter ends must it be sent?", "gold_answer": "If Firms are required to report to the PRA each quarter using the applicable templates, the firm must submit the quarterly quantitative reporting templates and must do so within the required deadline after each quarter ends. The TARGET sets the baseline requirement that Firms must submit information to the PRA quarterly and that this is done using templates (as applicable), so the reporting is both periodic (quarterly) and template-based [#TGT:e36647fee0846ae4]. The SOURCE adds the specific submission item and timing: a firm must submit the quarterly quantitative reporting templates and must submit them no later than 30 business days after the end of each quarter of the firm’s financial year [#SRC:d73e36dd5bef0292]. Putting both together, each quarter the firm needs to prepare the quantitative reporting templates that correspond to the PRA’s quarterly information request and ensure the submission reaches the PRA within 30 business days after the quarter-end date for that financial year quarter.", "method": "SCHEMA", "persona": "basic", "pair_uid": "e9161d5e88ce09ef"}
{"item_id": "8a9ee175108a3817", "source_passage_id": "a1be217c65884ad1", "target_passage_id": "9c0a502a887dae03", "question": "Where a Category 1 or 2 Solvency II firm cannot meet or exceed the PRA’s expectations set out in the supervisory statement, what must the firm do to ensure its remuneration policy is established and implemented in line with the applicable principles, and who must it notify?", "gold_answer": "A Category 1 or 2 Solvency II firm that is unable to meet or exceed the PRA’s expectations set out in the supervisory statement should take two linked actions. First, it must ensure that, in establishing and implementing its remuneration policy, it complies with all of the applicable principles that govern that policy’s establishment and implementation, because the target obligation requires a firm to comply with those principles when setting up and putting the remuneration policy into effect [#TGT:9c0a502a887dae03]. Second, where it cannot meet or exceed the PRA’s expectations described in the supervisory statement, it should inform its PRA supervisory contact, as the supervisory statement explicitly directs Category 1 and 2 firms in that position to notify their supervisory contact [#SRC:a1be217c65884ad1]. Read together, the firm should treat the principles as mandatory requirements for how the remuneration policy is established and implemented, while using the supervisory statement’s expectations as the benchmark for its approach and escalation: if it cannot reach that benchmark, it should proactively notify the PRA supervisory contact while continuing to comply with the principles applicable to the remuneration policy’s establishment and implementation.", "method": "SCHEMA", "persona": "professional", "pair_uid": "b47b023690038093"}
{"item_id": "be9a45d63760e35f", "source_passage_id": "a1be217c65884ad1", "target_passage_id": "9c0a502a887dae03", "question": "If a Category 1 or 2 Solvency II firm cannot meet or exceed the PRA’s expectations in the supervisory statement, what must it do about its remuneration policy and who should it tell?", "gold_answer": "The firm has to manage both its remuneration policy obligations and its supervisory communication. On the remuneration side, when the firm establishes and implements its remuneration policy, it must comply with all of the required principles that apply to that policy’s establishment and implementation, because the target text makes compliance with those principles mandatory at the point the policy is set up and put into practice [#TGT:9c0a502a887dae03]. Separately, the supervisory statement explains that it provides guidance for significant (PRA Category 1 and 2) Solvency II firms and sets out the PRA’s expectations; if a Category 1 or 2 firm is unable to meet or exceed those expectations, it should inform its PRA supervisory contact [#SRC:a1be217c65884ad1]. Putting these together, the firm should continue to establish and implement its remuneration policy in a way that complies with the applicable principles, and it should also escalate the shortfall against the PRA’s expectations by notifying its PRA supervisory contact. This aligns the firm’s required conduct for the remuneration policy with the expected supervisory engagement when the firm cannot reach the PRA’s stated expectations.", "method": "SCHEMA", "persona": "basic", "pair_uid": "b47b023690038093"}
{"item_id": "030413740f253e4b", "source_passage_id": "414827dbd2cd570d", "target_passage_id": "1340ce6852b2044b", "question": "Before a firm uses the permitted formula-based approach to calculate the capital requirement for health longevity risk, what assessment must it carry out to determine whether a simplified calculation is proportionate to the nature, scale and complexity of its risks, and what elements must that assessment include?", "gold_answer": "A firm may calculate the capital requirement for health longevity risk using the specified formula-based approach, but it must first determine whether using a simplified calculation is proportionate to the nature, scale and complexity of the risks by carrying out an assessment with defined minimum content. Specifically, the firm’s assessment must include: (a) an assessment of the nature, scale and complexity of the risks of the firm covered in the relevant module or sub-module; and (b) an evaluation, in qualitative or quantitative terms as appropriate, of the error introduced in the results of the simplified calculation due to any deviation between (i) the assumptions underlying the simplified calculation in relation to the risk and (ii) the results of the assessment of the nature, scale and complexity of the risks. This obligation to assess proportionality and error governs whether and how the firm proceeds with the simplified approach, alongside the permission to calculate the health longevity risk capital requirement using the formula [#SRC:414827dbd2cd570d] and the requirement to perform the assessment and include the specified components [#TGT:1340ce6852b2044b].", "method": "SCHEMA", "persona": "professional", "pair_uid": "e2ac648ca14fbe24"}
{"item_id": "2f97b328d2a51262", "source_passage_id": "414827dbd2cd570d", "target_passage_id": "1340ce6852b2044b", "question": "If a firm wants to use the allowed formula to calculate the capital requirement for health longevity risk, what must it do to check that a simplified calculation is suitable for its risks, and what must that check cover?", "gold_answer": "A firm is permitted to calculate the capital requirement for health longevity risk using the formula-based approach, but it must first check whether a simplified calculation is proportionate to the nature, scale and complexity of its risks by carrying out a specific assessment. That assessment must cover two main areas. First, the firm must assess the nature, scale and complexity of the risks it has that are covered in the relevant module or sub-module. Second, it must evaluate (qualitatively or quantitatively, as appropriate) the error that the simplified calculation could introduce because of any deviation between the simplified calculation’s underlying assumptions for the risk and the results of the firm’s own risk assessment. In practice, this means the firm cannot rely on the simplified method without documenting both its risk profile and how differences between its actual risk characteristics and the simplified assumptions could affect the calculation outcome. These steps link the permission to calculate using the formula [#SRC:414827dbd2cd570d] with the mandatory proportionality and error assessment requirements [#TGT:1340ce6852b2044b].", "method": "SCHEMA", "persona": "basic", "pair_uid": "e2ac648ca14fbe24"}
{"item_id": "7022032b2ef1dec6", "source_passage_id": "93f9d67ba5aa8c4d", "target_passage_id": "a2326f65154f25e3", "question": "How shall Institutions design and document their policies and procedures for deciding which positions are included in the trading book so that, once included, those positions meet the requirement to be readily tradable or capable of being hedged, and what ongoing assurance activities must support this determination?", "gold_answer": "Institutions must maintain clearly defined policies and procedures that determine which positions are included in the trading book for capital requirements purposes, and those policies must be aligned with the institution’s risk management capabilities and practices, fully documented, and subject to periodic internal audit [#SRC:93f9d67ba5aa8c4d]. In applying those policies to classify positions into the trading book, Institutions must also ensure that the resulting trading book population satisfies the trading-book position condition: each position included must be either free of restrictions on tradability or able to be hedged [#TGT:a2326f65154f25e3]. Practically, this means the classification framework should incorporate explicit decision criteria and controls that test tradability constraints and hedging feasibility at the point of inclusion, and retain evidence showing how each position met those criteria. The documentation and audit expectations require Institutions to be able to demonstrate, on an ongoing basis, that the policies are operating effectively, that inclusion decisions are consistent with the defined procedures, and that any identified weaknesses (e.g., positions with tradability restrictions and no viable hedge) are remediated through policy updates, reclassification decisions, or strengthened controls, consistent with the periodic internal audit requirement [#SRC:93f9d67ba5aa8c4d] and the trading-book position condition [#TGT:a2326f65154f25e3].", "method": "SCHEMA", "persona": "professional", "pair_uid": "ebe0ee65253ea7fc"}
{"item_id": "d0be55e4e1ed28d4", "source_passage_id": "93f9d67ba5aa8c4d", "target_passage_id": "a2326f65154f25e3", "question": "What must Institutions have in place to decide which positions go into the trading book, and how must they make sure those trading book positions can actually be traded or hedged?", "gold_answer": "Institutions must have clearly defined policies and procedures that set out how they decide which position to include in the trading book for capital requirements purposes, taking into account the institution’s risk management capabilities and practices [#SRC:93f9d67ba5aa8c4d]. They must fully document compliance with those policies and procedures and subject them to periodic internal audit, so there is evidence and ongoing checking that the process is followed and remains effective [#SRC:93f9d67ba5aa8c4d]. At the same time, Institutions must ensure that positions in the trading book meet a practical condition about manageability: each trading book position must be either free of restrictions on tradability or able to be hedged [#TGT:a2326f65154f25e3]. This means the policies and procedures for inclusion should not only describe how positions are classified, but also include steps or criteria that confirm tradability is not restricted or, if there are limitations, that a hedge is available. The documentation and internal audit elements support demonstrating that these checks were performed consistently and that the trading book population continues to satisfy the tradability-or-hedge requirement over time [#SRC:93f9d67ba5aa8c4d] and [#TGT:a2326f65154f25e3].", "method": "SCHEMA", "persona": "basic", "pair_uid": "ebe0ee65253ea7fc"}
{"item_id": "9303c7ed35af74f5", "source_passage_id": "cf55dc9054b4cdbf", "target_passage_id": "a6f49674c529a776", "question": "When a firm draws down buffers within the capital framework in a period of stress, how does the PRA’s stated approach to permitting buffer use and allowing subsequent rebuilding over a reasonable period align with the supervisory context referenced in the March 2019 ICAAP and SREP publication?", "gold_answer": "The PRA’s position is that firms may use all buffers in the capital framework, including the PRA buffer, as needed in times of stress, and that doing so is an accepted feature of the framework rather than a breach to be avoided. Consistent with that, the PRA indicates it will be content for firms to rebuild buffers over a reasonable period after stress-driven drawdown, and it will exercise judgement on what is “reasonable” by considering how much of the buffer was used, how long the stress is expected to last, and firm-specific drivers viewed against current and forecast macroeconomic and financial conditions [#SRC:cf55dc9054b4cdbf]. The March 2019 publication on the Internal Capital Adequacy Assessment Process (ICAAP) and the Supervisory Review and Evaluation Process (SREP) provides the supervisory context in which firms’ capital adequacy assessments and supervisory evaluations are framed, and it is the referenced source for understanding how these expectations sit within the broader ICAAP/SREP setting [#TGT:a6f49674c529a776].", "method": "SCHEMA", "persona": "professional", "pair_uid": "5a9c46ae4dfc4c61"}
{"item_id": "cc3a99da02f67c30", "source_passage_id": "cf55dc9054b4cdbf", "target_passage_id": "a6f49674c529a776", "question": "If a firm uses its capital buffers during a stress event, what does the PRA say about being allowed to use those buffers and then rebuild them, and where is the related ICAAP and SREP supervisory material referenced?", "gold_answer": "The PRA says firms can use all buffers in the capital framework, including the PRA buffer, when stress requires it, and it does not expect firms to hold extra capital just to avoid ending up within the PRA buffer during a stress. After buffers are used, the PRA says it will be content for firms to rebuild them over a reasonable period, and it will judge what is reasonable by looking at how much of the buffer was used, how long the stress is expected to last, and firm-specific reasons for the drawdown, assessed in light of current and forecast macroeconomic and financial conditions [#SRC:cf55dc9054b4cdbf]. The supervisory material referenced alongside this is the March 2019 publication titled “The Internal Capital Adequacy Assessment Process (ICAAP) and the Supervisory Review and Evaluation Process (SREP),” which is identified by a Bank of England link and provides the related ICAAP/SREP context for firms and supervisors [#TGT:a6f49674c529a776].", "method": "SCHEMA", "persona": "basic", "pair_uid": "5a9c46ae4dfc4c61"}
{"item_id": "0ad330098f29567b", "source_passage_id": "1bc35205ce53c44d", "target_passage_id": "4ee46c40137426d7", "question": "When calculating MCR (gi,l) and MCR (l,l) by reference to the linear formula component for general insurance and reinsurance obligations, how must the firm ensure the calculation method is aligned while restricting the technical provisions or premiums written inputs to the appropriate obligation set?", "gold_answer": "MCR (gi,l) and MCR (l,l) must be calculated using the same approach as the linear MCR calculations for general insurance and for long-term insurance, but with a strict limitation on the data inputs used. Specifically, while the calculation method must follow the linear formula component framework that applies to general insurance and reinsurance obligations (i.e., the linear formula component that must be set equal to the specified expression) [#TGT:4ee46c40137426d7], the technical provisions or premiums written included in the calculation for MCR (gi,l) and MCR (l,l) must be confined to those that relate only to long-term insurance and reinsurance obligations [#SRC:1bc35205ce53c44d]. In practice, this means the firm should not change the underlying linear calculation methodology, but must filter the exposure measures (technical provisions or premiums written) so that only long-term insurance and reinsurance obligations are captured for these mixed or long-term-related MCR measures, even though the referenced linear component is framed for general insurance and reinsurance obligations.", "method": "SCHEMA", "persona": "professional", "pair_uid": "958272980a0af0f8"}
{"item_id": "2498ae301036adc6", "source_passage_id": "1bc35205ce53c44d", "target_passage_id": "4ee46c40137426d7", "question": "If a firm is calculating MCR (gi,l) and MCR (l,l) using the linear approach tied to the general insurance and reinsurance linear formula component, what must it do about (a) using the same calculation method and (b) limiting which technical provisions or premiums written are included?", "gold_answer": "The firm must do two things at the same time. First, it must calculate MCR (gi,l) and MCR (l,l) in the same way as the relevant linear MCR calculations, meaning it should apply the same linear-formula method that is used for the linear formula component for general insurance and reinsurance obligations (the component that must be equal to the specified expression) [#TGT:4ee46c40137426d7]. Second, even though the method is aligned to that linear approach, the firm must restrict the inputs used in the calculation: the technical provisions or premiums written it uses must only relate to long-term insurance and reinsurance obligations [#SRC:1bc35205ce53c44d]. So the methodology stays consistent with the linear framework, but the exposure data included in the calculation is narrowed to long-term insurance and reinsurance obligations only, rather than including other business.", "method": "SCHEMA", "persona": "basic", "pair_uid": "958272980a0af0f8"}
{"item_id": "a7f1d881c8dd3856", "source_passage_id": "8f66b79fd6850545", "target_passage_id": "682a94015e8ea157", "question": "Where remuneration contains a variable component for Solvency II staff, what must a firm do to ensure that deferral of a substantial portion of that variable remuneration is set for an appropriate minimum period and structured so that the firm’s specific arrangements comply with the applicable principles?", "gold_answer": "Where remuneration contains a variable component for Solvency II staff, a firm must defer a substantial portion of the variable remuneration component for a period of not less than three years, with no option to choose a shorter minimum period. In setting the deferral length (three years or longer), the firm must ensure the period is correctly aligned with the nature of the business, its risks, and the activities of the employees in question, taking into account the natural life cycle of the business and associated risks. The firm must also ensure that variable remuneration payable under these deferral arrangements vests no faster than pro‑rata from year one, and it may structure multi‑period schemes within the same deferred bonus plan or Long Term Incentive Plan, provided the overall design remains consistent with the deferral and vesting constraints. While the detailed design choices are discretionary, the firm must ensure that the specific arrangements it puts in place to implement these deferral requirements comply with all applicable principles governing those arrangements [#SRC:8f66b79fd6850545] and must ensure that the specific arrangements referred to are compliant with the required principles [#TGT:682a94015e8ea157].", "method": "SCHEMA", "persona": "professional", "pair_uid": "07b951d93c1b163c"}
{"item_id": "a8ed876e72cd457d", "source_passage_id": "8f66b79fd6850545", "target_passage_id": "682a94015e8ea157", "question": "If a firm pays variable remuneration to Solvency II staff, what must it do about deferring a substantial portion of that pay, and how must it make sure its chosen deferral and vesting setup meets the required principles for its specific arrangements?", "gold_answer": "If remuneration includes a variable component for Solvency II staff, the firm must defer a substantial portion of that variable remuneration component for at least three years, and it cannot choose a shorter deferral period. The firm must set the deferral length (three years or longer) so it is correctly aligned with the nature of the business, its risks, and the activities of the employees in question, and it should consider the natural life cycle of the business and associated risks when deciding whether a longer period is needed. The firm must also ensure that variable remuneration under the deferral arrangements vests no faster than pro‑rata from year one. The firm may use multi‑period schemes within the same deferred bonus plan or Long Term Incentive Plan, but the overall approach still has to respect the minimum deferral and vesting constraints. Even though the exact arrangements are a discretionary matter for the firm, it must ensure that the specific arrangements it adopts to implement these requirements comply with all applicable principles [#SRC:8f66b79fd6850545] and must ensure that the specific arrangements referred to comply with the required principles [#TGT:682a94015e8ea157].", "method": "SCHEMA", "persona": "basic", "pair_uid": "07b951d93c1b163c"}
{"item_id": "a2758fdfe4b541f5", "source_passage_id": "8b849964a198cf45", "target_passage_id": "6cc8b722cd5cd1e7", "question": "For purposes of applying the related provisions referenced in Article 12 of Chapter 4 of Own Funds (CRR) Part, how should an institution determine whether a recognised amount qualifies as “gain on sale” in the context of a securitisation transaction, including the required accounting and balance-sheet conditions?", "gold_answer": "When considering the related provisions referenced in Article 12 of Chapter 4 of Own Funds (CRR) Part [#SRC:8b849964a198cf45], an institution should treat “gain on sale” as a defined concept that hinges on both recognition and linkage to securitisation-related future income. Specifically, “gain on sale” means any recognised gain on sale for the institution that is recorded as an increase in any element of own funds, and that gain must be associated with future margin income arising from a sale of securitised assets. In addition, the definition requires that the securitised assets are removed from the institution’s balance sheet in the context of a securitisation transaction [#TGT:6cc8b722cd5cd1e7]. Accordingly, the institution’s determination is not based merely on a sale event; it must confirm (i) the gain is recognised, (ii) it increases an element of own funds, (iii) it is tied to future margin income from the sale of securitised assets, and (iv) the assets are removed from the balance sheet as part of the securitisation transaction. This aligns the definitional trigger with the cross-referenced related provisions.", "method": "SCHEMA", "persona": "professional", "pair_uid": "ea9fa8134db0fc20"}
{"item_id": "3f730478c70bc46a", "source_passage_id": "8b849964a198cf45", "target_passage_id": "6cc8b722cd5cd1e7", "question": "When you see a note pointing to related provisions in Article 12 of Chapter 4 of Own Funds (CRR) Part, what does “gain on sale” mean for an institution in a securitisation transaction, and what facts must be true for it to count?", "gold_answer": "The note directing you to related provisions in Article 12 of Chapter 4 of Own Funds (CRR) Part [#SRC:8b849964a198cf45] should be read together with the definition of “gain on sale,” because the related provisions depend on using that term consistently. For an institution, “gain on sale” means a recognised gain on sale that is recorded as an increase in any element of own funds, and it must be associated with future margin income that arises from selling securitised assets. It also requires that those securitised assets are removed from the institution’s balance sheet, and that this removal happens in the context of a securitisation transaction [#TGT:6cc8b722cd5cd1e7]. So, to decide whether something is “gain on sale,” you need to confirm more than just that a sale occurred: the gain must be recognised, it must increase own funds, it must relate to future margin income from the sale, and the assets must be taken off the balance sheet as part of the securitisation transaction. These conditions together define when the term applies under the related provisions.", "method": "SCHEMA", "persona": "basic", "pair_uid": "ea9fa8134db0fc20"}
{"item_id": "66b904e81825a1ba", "source_passage_id": "c6721f79b60bc179", "target_passage_id": "ddb71c7a316d2892", "question": "When determining its basic own funds, how must a firm apply the required deductions for participations so that the reduction of basic own funds for certain participations in financial and credit institutions is made in the correct tier corresponding to where the participation increased the related undertaking’s own funds, and only for the portion exceeding the stated aggregate threshold and excluding the specified category of participations?", "gold_answer": "A firm must treat the participations-related adjustments as mandatory deductions and ensure they are taken from the corresponding tier in which the participation increased the own funds of the related undertaking, rather than applying a generic or mismatched tier treatment [#SRC:c6721f79b60bc179]. In parallel, when the firm is determining its basic own funds, it must reduce basic own funds by the relevant part of the value of participations in financial and credit institutions (other than the excluded category of participations) only to the extent that the aggregate value of those participations exceeds the specified percentage threshold measured against the referenced items [#TGT:ddb71c7a316d2892]. Read together, this means the firm must (i) identify which participations fall within the target reduction requirement (including the exclusion), (ii) calculate the amount subject to reduction by applying the “exceeds threshold” limitation, and then (iii) execute that reduction as a deduction taken from the appropriate tier that corresponds to how the participation affected the related undertaking’s own funds. This aligns the basic own funds reduction mechanics with the tier-specific deduction obligation.", "method": "SCHEMA", "persona": "professional", "pair_uid": "736d8e42e4744678"}
{"item_id": "adf7fa4c6846fdea", "source_passage_id": "c6721f79b60bc179", "target_passage_id": "ddb71c7a316d2892", "question": "If a firm is working out its basic own funds and has participations in financial and credit institutions, what must it do to reduce basic own funds only for the amount above the threshold (and not for the excluded participations), and how must it make sure the deduction is taken from the same tier where the participation increased the related undertaking’s own funds?", "gold_answer": "The firm must do two linked things. First, it must apply the participations deduction requirement by making the deductions from the corresponding tier in which the participation increased the own funds of the related undertaking, so the deduction is aligned to the tier impact of the participation rather than being taken arbitrarily [#SRC:c6721f79b60bc179]. Second, for the specific purpose of determining its basic own funds, the firm must reduce its basic own funds by the relevant part of the value of participations in financial and credit institutions, but only to the extent the aggregate value of those participations exceeds the stated percentage threshold against the referenced items, and it must not include the participations that are expressly carved out from this reduction requirement [#TGT:ddb71c7a316d2892]. In practice, the firm should identify the in-scope participations, exclude the carved-out category, compute the aggregate value and the excess over the threshold, and then reduce basic own funds by that excess amount while ensuring the deduction is recorded in the tier that corresponds to where the participation increased the related undertaking’s own funds.", "method": "SCHEMA", "persona": "basic", "pair_uid": "736d8e42e4744678"}
{"item_id": "fd1ca7250c079dca", "source_passage_id": "c5ef344684d38393", "target_passage_id": "b16c73e93c0f2966", "question": "When an institution has stopped calculating exposure values for its derivative positions under the applicable approach and seeks to restart, what must it do to be permitted to resume that calculation, and how does that permission interact with the requirement to calculate a single exposure value at netting set level?", "gold_answer": "If an institution has ceased calculating the exposure values of its derivative positions under the applicable approach, it is not automatically allowed to restart that calculation. It is permitted to resume calculating the exposure value of its derivative positions only where it demonstrates to the competent authority that the relevant conditions have been met for an uninterrupted period of one year [#SRC:c5ef344684d38393]. In parallel, institutions have an ongoing obligation to calculate a single exposure value at netting set level in accordance with the applicable framework, subject to the stated qualification in the target provision [#TGT:b16c73e93c0f2966]. Read together, the permission to resume a particular method for derivative-position exposure values is conditional on a one-year, uninterrupted compliance demonstration to the competent authority, while the institution must still ensure that its exposure measurement is produced as a single exposure value at netting set level as required. Accordingly, any restart of derivative exposure-value calculations must be aligned with, and not treated as a substitute for, the netting-set-level single exposure value obligation, and the institution should be prepared to evidence both the one-year conditions and the resulting netting-set exposure value outcome.", "method": "SCHEMA", "persona": "professional", "pair_uid": "4b66bfe901b9fe43"}
{"item_id": "63e8fa2f08972873", "source_passage_id": "c5ef344684d38393", "target_passage_id": "b16c73e93c0f2966", "question": "In circumstances where an institution has ceased calculating derivative-position exposure values and intends to restart, what conditions must be evidenced to the competent authority before the institution may resume, and what calculation outcome must the institution still deliver at netting set level?", "gold_answer": "An institution that has ceased calculating the exposure values of its derivative positions under the applicable approach may resume calculating those exposure values only if it can demonstrate to the competent authority that the relevant conditions have been satisfied continuously for an uninterrupted period of one year [#SRC:c5ef344684d38393]. This is a gating permission: without that demonstration over the full one-year period, the institution is not permitted to restart the derivative-position exposure-value calculation under that approach. Separately, and regardless of the restart permission, institutions are required to calculate a single exposure value at netting set level in accordance with the applicable framework, subject to the stated qualification in the target provision [#TGT:b16c73e93c0f2966]. The combined effect is that the institution must (i) meet the precondition for being allowed to resume the derivative exposure-value calculation by evidencing uninterrupted satisfaction of the conditions to the competent authority, and (ii) ensure that its exposure measurement is expressed as a single exposure value at netting set level. The permission governs whether the institution may restart a specific calculation approach; the obligation governs the required netting-set-level output.", "method": "SCHEMA", "persona": "professional", "pair_uid": "4b66bfe901b9fe43"}
{"item_id": "fe4609a540cf47fc", "source_passage_id": "c5ef344684d38393", "target_passage_id": "b16c73e93c0f2966", "question": "If an institution stopped calculating exposure values for its derivative positions and now wants to start again, what does it need to show to the competent authority to be allowed to restart, and what exposure value must it still calculate at netting set level?", "gold_answer": "When an institution has ceased calculating the exposure values of its derivative positions under the applicable approach, it can only restart that calculation if it demonstrates to the competent authority that the relevant conditions have been met continuously for an uninterrupted period of one year [#SRC:c5ef344684d38393]. That permission to resume is conditional and depends on the institution’s evidence to the competent authority over the full one-year period. At the same time, institutions have a separate requirement to calculate a single exposure value at netting set level in accordance with the applicable framework, subject to the stated qualification in the target provision [#TGT:b16c73e93c0f2966]. Putting these together: restarting the derivative-position exposure-value calculation is allowed only after the one-year uninterrupted-conditions demonstration, but the institution must still produce the required single exposure value at netting set level. In practice, the institution should treat the restart permission as a prerequisite for using that approach again, while ensuring that its exposure measurement process continues to deliver the netting-set-level single exposure value outcome required by the target obligation.", "method": "SCHEMA", "persona": "basic", "pair_uid": "4b66bfe901b9fe43"}
{"item_id": "5da60e6925e99ac8", "source_passage_id": "c5ef344684d38393", "target_passage_id": "b16c73e93c0f2966", "question": "After an institution has stopped calculating exposure values for derivative positions, when can it start calculating them again, and how does that fit with the rule that institutions must calculate one exposure value for each netting set?", "gold_answer": "An institution that has ceased calculating the exposure values of its derivative positions under the applicable approach is only permitted to resume calculating those exposure values if it can demonstrate to the competent authority that the relevant conditions have been met for an uninterrupted period of one year [#SRC:c5ef344684d38393]. This means the institution needs a continuous one-year track record of meeting the conditions and must be able to evidence that to the competent authority before it can restart. Separately, institutions must calculate a single exposure value at netting set level in accordance with the applicable framework, subject to the stated qualification in the target provision [#TGT:b16c73e93c0f2966]. So even if the institution is working toward being allowed to restart the derivative-position exposure-value calculation, it still has to ensure that its exposure measurement is expressed as one exposure value at the netting set level. The permission controls when the institution may restart a particular way of calculating derivative exposure values; the obligation controls the required netting-set-level exposure value result that must be produced.", "method": "SCHEMA", "persona": "basic", "pair_uid": "4b66bfe901b9fe43"}
{"item_id": "5a0ad1ea964ea17b", "source_passage_id": "4ea2648a6342b626", "target_passage_id": "34d0efbb3e1b0536", "question": "To comply with Insurance Company – Capital Resources Requirements, what must a firm do on an ongoing basis regarding the level of its capital resources relative to its CR Requirement?", "gold_answer": "To comply with Insurance Company – Capital Resources Requirements, a firm is required to ensure that its capital resources are continuously sufficient when measured against its CR Requirement. In practice, this means the firm must maintain capital resources at all times that are at least equal to, and may be higher than, the firm’s CR Requirement, so that the firm remains in compliance on an ongoing (not periodic) basis. The compliance obligation is framed by the requirement to “comply with Insurance Company – Capital Resources Requirements” [#SRC:4ea2648a6342b626] and is operationalized by the specific duty that the firm must maintain capital resources equal to or in excess of its CR Requirement at all times [#TGT:34d0efbb3e1b0536]. Accordingly, the firm should treat the CR Requirement as the minimum threshold for its capital resources and ensure that its capital position does not fall below that threshold at any time, since the obligation applies continuously rather than only at reporting dates. This links the general compliance expectation in the source to the concrete, measurable capital maintenance standard in the target.", "method": "SCHEMA", "persona": "professional", "pair_uid": "6dadf54d42ab72b3"}
{"item_id": "28534246b8a5f944", "source_passage_id": "4ea2648a6342b626", "target_passage_id": "34d0efbb3e1b0536", "question": "If a firm needs to comply with Insurance Company – Capital Resources Requirements, what does it have to do at all times with its capital resources compared with its CR Requirement?", "gold_answer": "Complying with Insurance Company – Capital Resources Requirements means the firm has to keep its capital resources at a level that continuously meets the minimum standard set by its CR Requirement. The source establishes that the firm must comply with the Insurance Company – Capital Resources Requirements [#SRC:4ea2648a6342b626]. The target then states what that compliance looks like in practical terms: the firm must maintain capital resources at all times that are equal to or greater than its CR Requirement [#TGT:34d0efbb3e1b0536]. So the firm cannot allow its capital resources to drop below the CR Requirement at any point, because the obligation is “at all times,” not just at the end of a month, quarter, or reporting period. In effect, the CR Requirement functions as the firm’s floor for capital resources, and the firm must manage its capital position so it stays at or above that floor continuously to satisfy the compliance obligation described in the source and specified in the target.", "method": "SCHEMA", "persona": "basic", "pair_uid": "6dadf54d42ab72b3"}
{"item_id": "3cc5d48074698119", "source_passage_id": "8e5451c44f63e11a", "target_passage_id": "b4c97c646d738581", "question": "When the PRA makes an overall assessment of whether a home state supervisor is sufficiently equivalent, what is the scope and purpose of that assessment in relation to the PRA’s authorisation and supervision functions, and how should this be distinguished from any advice the PRA may provide to HM Treasury? In outlining the procedure, identify the key factors the PRA weighs, including cooperation and the firm-specific and group-level supervision considerations.", "gold_answer": "In making an overall assessment of whether the home state supervisor is sufficiently equivalent, the PRA evaluates whether the home regime is consistent with the UK regulatory framework in delivering outcomes that meet the PRA’s objectives, considering the relevant factors in the round and placing considerable weight on the extent and quality of co-operation with the home state supervisor [#SRC:8e5451c44f63e11a]. This assessment also takes into account supervision of individual firms (including branches) and their consolidated group, and it considers the nature and scale of the firm’s activities in the UK as part of the PRA’s procedural approach to reaching an overall view [#SRC:8e5451c44f63e11a]. The scope of this equivalence assessment is confined to outcomes achieved for the purposes of authorisation and supervision by the PRA, and it must be distinguished from any separate advice the PRA may provide to HM Treasury [#TGT:b4c97c646d738581]. While the PRA may give such advice to HM Treasury, HM Treasury may make determinations of equivalence for other purposes, so the PRA’s overall assessment should not be treated as a substitute for, or determinative of, HM Treasury’s separate determinations [#TGT:b4c97c646d738581].", "method": "SCHEMA", "persona": "professional", "pair_uid": "e9c7fd0415677b06"}
{"item_id": "bce02fc1b521e7ab", "source_passage_id": "8e5451c44f63e11a", "target_passage_id": "b4c97c646d738581", "question": "If the PRA is deciding overall whether a home state supervisor is equivalent, what does that decision apply to, and what does it not apply to (especially compared with HM Treasury decisions)? Also, what does the PRA look at in practice, like cooperation and how the firm and its group are supervised in the UK?", "gold_answer": "The PRA’s overall assessment of whether a home state supervisor is sufficiently equivalent is an outcomes-based judgement that the PRA uses for its own purposes of authorisation and supervision [#TGT:b4c97c646d738581]. It is not the same as, and should be kept separate from, any advice the PRA may provide to HM Treasury, because HM Treasury may make determinations of equivalence for other purposes [#TGT:b4c97c646d738581]. In carrying out the assessment, the PRA considers whether the home state supervisor’s regime is consistent with the UK regulatory framework in delivering appropriate outcomes that meet the PRA’s objectives, and it assesses the relevant factors in their totality [#SRC:8e5451c44f63e11a]. A key practical element is that the PRA places considerable weight on the extent and quality of co-operation with the home state supervisor [#SRC:8e5451c44f63e11a]. The PRA also looks at how individual firms (including branches) and their consolidated group are supervised, and it considers the nature and scale of the firm’s activities in the UK when forming its overall view [#SRC:8e5451c44f63e11a].", "method": "SCHEMA", "persona": "basic", "pair_uid": "e9c7fd0415677b06"}
{"item_id": "ba10d24b5cfeaa7d", "source_passage_id": "865973d64c7565e2", "target_passage_id": "b3afbbf8d96609e4", "question": "For a credit union with more than £50 million in total assets and/or undertaking more complex lending or investment activities, what must it do to assess how key strategic initiatives and external risks could affect its business, and how does this expectation align with the requirement to maintain risk management systems proportionate to its needs and the PRA’s escalation where poor risk management or governance is evidenced?", "gold_answer": "A credit union that exceeds the stated size threshold and/or undertakes more complex lending or invests in more complex products is expected by the PRA to undertake scenario analysis to identify the impact of key strategic initiatives and external risks on its business, including using scenarios such as weaker loan book performance, higher shares growth, increased arrears, welfare benefit changes, or bank interest rate changes, and it is regarded as good practice to consider combined scenarios [#SRC:865973d64c7565e2]. This scenario analysis should be embedded within the credit union’s broader obligation to maintain proportionate risk management systems that are adequate for the needs of its business [#TGT:b3afbbf8d96609e4]. If there is evidence of poor risk management and/or governance, the credit union should expect the PRA to engage with it on mitigation plans; if it fails to engage or make meaningful progress, it should expect fuller PRA engagement on viability and, where viability is not demonstrated, on orderly closure planning (including insolvent wind-up, solvent wind-down, or transfer of engagements) [#TGT:b3afbbf8d96609e4].", "method": "SCHEMA", "persona": "professional", "pair_uid": "3ed584e137f90505"}
{"item_id": "11c5f46494bda3e7", "source_passage_id": "865973d64c7565e2", "target_passage_id": "b3afbbf8d96609e4", "question": "If a credit union is large or does more complex lending or investing, what should it do to test how big plans and outside risks could affect it, and how does that fit with having risk management systems that match its business and the PRA’s follow-up if risk management or governance looks poor?", "gold_answer": "Where a credit union has more than £50 million in total assets and/or carries out more complex lending (for example mortgages or lending to corporates) and/or invests in more complex investment products, the PRA expects it to undertake scenario analysis to identify how key strategic initiatives and external risks could affect its business [#SRC:865973d64c7565e2]. The passage also indicates the types of scenarios that may be used (such as poorer loan book performance, higher than expected shares growth, higher arrears, changes to welfare benefits, or changes in bank interest rates) and notes it is good practice to look at combined scenarios [#SRC:865973d64c7565e2]. This work should sit within the credit union’s wider expectation to have proportionate risk management systems that are adequate for the needs of its business [#TGT:b3afbbf8d96609e4]. If there is evidence of poor risk management and/or governance, the credit union should expect the PRA to engage on mitigation plans; if it does not engage or make meaningful progress, it should expect the PRA to engage more fully on whether it has a viable future and, if not, what orderly closure plans it has (including wind-up, wind-down, or transfer of engagements) [#TGT:b3afbbf8d96609e4].", "method": "SCHEMA", "persona": "basic", "pair_uid": "3ed584e137f90505"}
{"item_id": "78459069c4cd3248", "source_passage_id": "4b7d02b366371a2f", "target_passage_id": "1ac71628712a0761", "question": "Where a person is a Conduct Rules non-executive director and must comply at all times with the applicable conduct standards, what ongoing disclosure obligation applies in relation to information the FCA or the PRA would reasonably expect to be notified of, and how must that disclosure be handled?", "gold_answer": "A Conduct Rules non-executive director is under a continuous obligation to comply with the applicable conduct standards at all times, meaning the duty is ongoing rather than event-limited and applies throughout the period they hold that status [#SRC:4b7d02b366371a2f]. Within that always-on compliance framework, one required standard is that the individual must make appropriate disclosure of any information that the FCA or the PRA would reasonably expect to have notice of [#TGT:1ac71628712a0761]. Practically, this requires the non-executive director to identify information that a reasonable regulator would expect to be brought to its attention and to ensure it is disclosed in an appropriate manner, rather than withheld or delayed. The obligation is framed as a “must” requirement and therefore is not discretionary: if the information meets the reasonable-expectation threshold, the director must disclose it appropriately. Because the duty to comply applies “at all times,” the disclosure requirement should be treated as continuing, so the director should be prepared to disclose whenever such information arises during their tenure, not only at periodic reporting points.", "method": "SCHEMA", "persona": "professional", "pair_uid": "f8006dad82c77ed0"}
{"item_id": "298aa087cf2c87e6", "source_passage_id": "4b7d02b366371a2f", "target_passage_id": "1ac71628712a0761", "question": "If you are a Conduct Rules non-executive director, you have to follow the conduct standards all the time. What does that mean for telling the FCA or the PRA about information they would reasonably expect to know?", "gold_answer": "If you are a Conduct Rules non-executive director, the requirement is to comply with the relevant conduct standards at all times, so the obligation is continuous and applies throughout your role rather than only at specific moments [#SRC:4b7d02b366371a2f]. One of those standards requires you to disclose appropriately any information that the FCA or the PRA would reasonably expect to have notice of [#TGT:1ac71628712a0761]. In effect, you must consider whether information is of a kind that a reasonable regulator would expect to be told, and if so you must ensure it is disclosed in an appropriate way. The wording makes this a mandatory duty (“must”), not an optional step, and it is tied to what the FCA or the PRA would reasonably expect to be notified about. Because your compliance duty applies “at all times,” you should treat the disclosure obligation as ongoing: whenever such information comes up while you are acting as a non-executive director, you are required to make the appropriate disclosure rather than waiting for a later point.", "method": "SCHEMA", "persona": "basic", "pair_uid": "f8006dad82c77ed0"}
{"item_id": "ab64667f4f818a5a", "source_passage_id": "da680341ca9e8782", "target_passage_id": "19c9e8d0b9a70534", "question": "For a firm whose general insurance business includes both health insurance based on actuarial principles and other general insurance business, what procedural approach must be used to ensure the calculations are performed separately for each part, and how does the health-insurance-specific percentage substitution apply when the relevant conditions are satisfied?", "gold_answer": "A firm must treat the health insurance based on actuarial principles and the other general insurance business as two distinct parts for the purposes of applying the relevant calculation steps, so that the process operates separately for each part and yields two separate outcomes: a sum for the health insurance part under the health-insurance calculation and a separate sum for the other business under the other-business calculation [#SRC:da680341ca9e8782]. Within that split approach, when the part being assessed is general insurance business consisting of health insurance based on actuarial principles, the firm must apply the rule that modifies how the relevant percentage is used: the procedure that would otherwise apply is applied with a substituted percentage of 8.66% in place of 26%, but only where the specified conditions are satisfied [#TGT:19c9e8d0b9a70534]. Practically, this means the firm should first identify and segregate the health insurance based on actuarial principles from the other business, then run the applicable calculation separately for each part, applying the percentage substitution only to the health insurance part and only if the stated conditions are met, while leaving the other business to be calculated under its own applicable step and resulting sum.", "method": "SCHEMA", "persona": "professional", "pair_uid": "44a1d2cb0d92b4c5"}
{"item_id": "f5a9bb65b265547d", "source_passage_id": "da680341ca9e8782", "target_passage_id": "19c9e8d0b9a70534", "question": "If a firm has some health insurance based on actuarial principles and some other general insurance business, what steps must it follow to keep the calculations separate, and when can it use the lower percentage for the health insurance part?", "gold_answer": "The firm must split its general insurance business into two parts—(1) health insurance based on actuarial principles and (2) the other business—and then apply the relevant calculation process separately to each part so that the process produces a sum for the health insurance part and a different sum for the other business part [#SRC:da680341ca9e8782]. For the health insurance part specifically, where the general insurance business consists of health insurance based on actuarial principles, the firm applies the relevant calculation with a modified percentage: it substitutes 8.66% for 26%, but only if the stated conditions are satisfied [#TGT:19c9e8d0b9a70534]. In practice, the sequencing is: identify which business falls into the health insurance based on actuarial principles category, keep that category separate from the other business, run the calculation for the health insurance category using the substituted percentage only when the conditions are met, and run the calculation for the other business separately to arrive at its own sum. This ensures the results are not blended across the two parts and that the health-insurance-specific adjustment is applied only in the correct circumstances.", "method": "SCHEMA", "persona": "basic", "pair_uid": "44a1d2cb0d92b4c5"}
{"item_id": "7501b2c32eb75511", "source_passage_id": "783eb897186947a6", "target_passage_id": "d0f5710ab3cb3488", "question": "When a sub-module within a module is itself composed of other sub-modules, how must the firm determine the capital requirement for that particular sub-module, and how does this interact with the requirement to generate the capital requirement using the standard formula with the specified inputs?", "gold_answer": "Where a sub-module within a module consists of other sub-modules, the calculation approach must follow the procedural distinction that applies to S i and S j: a sub-module that is not made up of other sub-modules is generated by the standard formula, whereas a sub-module that does consist of other sub-modules is calculated in accordance with the referenced calculation provision [#SRC:783eb897186947a6]. For all such sub-modules of the standard formula that fall within the scope of that cross-reference, the capital requirement for the particular sub-module must be generated by the formula set out in the specified standard-formula provision, applying the stated specifications [#TGT:d0f5710ab3cb3488]. Read together, this means the firm must (i) identify whether the sub-module is composite (i.e., consists of other sub-modules) under the source procedure, and then (ii) ensure that the resulting capital requirement is produced using the required standard-formula generation method and specifications for the relevant sub-modules, rather than treating the composite sub-module as if it were a standalone sub-module generated directly without the cross-referenced calculation step.", "method": "SCHEMA", "persona": "professional", "pair_uid": "df04395ac0e8ab89"}
{"item_id": "3599a237c6a4b1e5", "source_passage_id": "783eb897186947a6", "target_passage_id": "d0f5710ab3cb3488", "question": "If a sub-module is made up of other sub-modules, what method must be used to calculate its capital requirement, and how must that result be generated under the standard formula requirements?", "gold_answer": "You must first apply the source procedure that distinguishes how sub-modules are handled within a module: S i and S j are the capital requirements for sub-modules i and j, and the method depends on whether the sub-module is standalone or built from other sub-modules. If it does not consist of other sub-modules, it is generated by the standard formula; if it does consist of other sub-modules, it must be calculated in accordance with the cross-referenced calculation provision [#SRC:783eb897186947a6]. For all sub-modules of the standard formula that are within the scope of that cross-reference, the capital requirement for the particular sub-module must then be generated by the formula set out in the specified standard-formula provision, applying the required specifications [#TGT:d0f5710ab3cb3488]. In practice, this means you cannot treat a composite sub-module the same way as a simple one: you must recognize it as composite under the source rule and ensure the capital requirement is produced using the required formula and specifications for those sub-modules.", "method": "SCHEMA", "persona": "basic", "pair_uid": "df04395ac0e8ab89"}
{"item_id": "27513355399aff3d", "source_passage_id": "d236289c09b769e3", "target_passage_id": "71828950bd20348f", "question": "When applying the PRA’s procedure for informing a firm’s Pillar 2A capital requirement, how must the methodology be scoped between the chapter focused on credit risk and the broader set of risk categories covered by the PRA’s Pillar 2A methodologies, and what does that imply for sequencing the assessment across risks?", "gold_answer": "The PRA’s procedure for informing a firm’s Pillar 2A capital requirement should be scoped by reading the credit-risk methodology in the chapter as one component within the PRA’s wider Pillar 2A methodologies framework. The chapter establishes the methodology the PRA uses specifically to inform the setting of a firm’s Pillar 2A capital requirement for credit risk [#TGT:71828950bd20348f]. The broader Pillar 2A methodologies set out the methodologies the PRA will use to inform the setting of a firm’s Pillar 2A capital requirement across multiple risk categories, including credit risk as well as market risk, operational risk, counterparty credit risk, credit concentration risk, interest rate risk in the banking book (IRRBB), pension obligation risk, and group risk (including RFB group risk) [#SRC:d236289c09b769e3]. Taken together, this implies that the PRA’s overall Pillar 2A-setting process should treat credit risk as a defined methodological stream that sits alongside other risk streams, with the credit-risk chapter guiding the credit-risk component while the broader methodologies define the full set of risks that may need to be assessed to inform the firm’s overall Pillar 2A capital requirement.", "method": "SCHEMA", "persona": "professional", "pair_uid": "ead28cb36eb0cdb6"}
{"item_id": "227cdfb83a67cdda", "source_passage_id": "d236289c09b769e3", "target_passage_id": "71828950bd20348f", "question": "If you are following the PRA’s method to set a firm’s Pillar 2A capital requirement, how do you use the credit risk chapter together with the wider PRA Pillar 2A methodologies that also cover other risks?", "gold_answer": "You should use the credit risk chapter as the PRA’s specific methodology for informing the credit risk part of a firm’s Pillar 2A capital requirement, while also recognising that it sits within a broader PRA approach that covers additional risk types. The chapter is limited in scope to the methodology the PRA uses to inform the setting of a firm’s Pillar 2A capital requirement for credit risk [#TGT:71828950bd20348f]. Separately, the PRA’s Pillar 2A methodologies describe the methodologies the PRA will use to inform the setting of a firm’s Pillar 2A capital requirement across a wider range of risks, including credit risk, market risk, operational risk, counterparty credit risk, credit concentration risk, interest rate risk in the banking book (IRRBB), pension obligation risk, and group risk (including RFB group risk) [#SRC:d236289c09b769e3]. Using both together means you do not treat the credit risk chapter as the entire Pillar 2A process; instead, you apply it for credit risk and look to the broader methodologies to understand which other risk categories may also need to be addressed when informing the firm’s overall Pillar 2A capital requirement.", "method": "SCHEMA", "persona": "basic", "pair_uid": "ead28cb36eb0cdb6"}
{"item_id": "dfefbd2bc585495f", "source_passage_id": "9b1e1dd387715b19", "target_passage_id": "9efdd1275a936ea0", "question": "Where a participant firm stops conducting business that could generate a protected claim by an eligible claimant and notifies the FSCS during a financial year, how does the scope of continued treatment as a participant firm interact with the situation where a firm ceases to be a participant firm or begins carrying out activities within one or more insurance classes part way through that same financial year?", "gold_answer": "Taken together, the provisions address how a firm is treated for the remainder of a compensation scheme financial year when its status or activities change mid-year. Under the SOURCE, if a participant firm ceases to conduct business that could give rise to a protected claim by an eligible claimant and it notifies the FSCS accordingly, the firm does not immediately fall outside the relevant scope; instead, it continues to be treated as a participant firm for the rest of the financial year in which the notice is given, specifically as a participant firm to which the referenced application applies until year-end [#SRC:9b1e1dd387715b19]. The TARGET frames the same timing issue more broadly by capturing circumstances where a firm either ceases to be a participant firm or carries out activities within one or more insurance classes part way through a financial year of the compensation scheme [#TGT:9efdd1275a936ea0]. Read together, the scope boundary is that mid-year cessation or mid-year commencement of insurance-class activities does not necessarily end the firm’s treatment within the scheme immediately; rather, the year-end point is the relevant cut-off where the SOURCE’s notification condition is met and the TARGET’s mid-year change scenario is in view.", "method": "SCHEMA", "persona": "professional", "pair_uid": "49730399680fd27e"}
{"item_id": "18635d35024931b3", "source_passage_id": "9b1e1dd387715b19", "target_passage_id": "9efdd1275a936ea0", "question": "If a participant firm stops doing business that could lead to a protected claim and tells the FSCS during the year, is it still treated as a participant firm until the year ends, even if it stops being a participant firm or starts doing activities in one or more insurance classes part way through that year?", "gold_answer": "Yes, the combined scope indicates that a mid-year change does not automatically mean the firm is treated as outside the scheme for the rest of that year. The SOURCE sets a specific condition: when a participant firm ceases to conduct business that could give rise to a protected claim by an eligible claimant and it notifies the FSCS, the firm is treated as a participant firm for the remainder of the financial year of the compensation scheme in which the notice is given, and it is treated as one to which the referenced application applies until the end of that year [#SRC:9b1e1dd387715b19]. The TARGET highlights the broader mid-year scenarios that can trigger questions about scope—where a firm ceases to be a participant firm or carries out activities within one or more insurance classes part way through a financial year of the compensation scheme [#TGT:9efdd1275a936ea0]. Putting them together, if the SOURCE’s notification situation applies, the firm remains treated as a participant firm through year-end even though the TARGET contemplates that its participant status or insurance-class activities may change during the year.", "method": "SCHEMA", "persona": "basic", "pair_uid": "49730399680fd27e"}
{"item_id": "5e9944b6362037b2", "source_passage_id": "065e7bb215b17ee1", "target_passage_id": "6d25f010b1a021ba", "question": "Where a firm is permitted to adjust the relevant percentage factor for a currency pegged to the euro, how must it treat the financial resources of the parties that guarantee the pegging when assessing whether the conditions for that adjustment are satisfied?", "gold_answer": "When a firm is considering whether it can use the permission to adjust the relevant percentage factor for currencies pegged to the euro, it must ensure that its assessment of eligibility incorporates the financial strength of the parties that support the peg. Specifically, the firm’s ability to rely on the adjustment is conditional on meeting stated requirements for euro-pegged currencies, and the firm is permitted to make the adjustment only if those requirements are met [#TGT:6d25f010b1a021ba]. In parallel, for the purposes of the relevant assessment framework, the firm has an explicit obligation to take into account the financial resources of the parties that guarantee the pegging [#SRC:065e7bb215b17ee1]. Read together, this means the firm should not treat the peg as a purely mechanical feature of the currency; it must evaluate the guarantor parties’ financial resources as part of the overall determination of whether the prerequisites for applying the adjusted factor are satisfied. The firm should therefore document how those parties’ financial resources were considered in reaching the conclusion that the adjustment conditions are met, before applying any adjusted factor.", "method": "SCHEMA", "persona": "professional", "pair_uid": "8238224bf5f89bcd"}
{"item_id": "3b0c832036b01cba", "source_passage_id": "065e7bb215b17ee1", "target_passage_id": "6d25f010b1a021ba", "question": "If a firm wants to use the option to change the percentage factor for a currency pegged to the euro, does it have to look at the financial resources of the parties that keep the peg in place, and why?", "gold_answer": "Yes. The firm may change the relevant percentage factor for currencies pegged to the euro only if it meets the stated requirements attached to that permission [#TGT:6d25f010b1a021ba]. Separately, when applying the relevant framework for pegged currencies, the firm must take into account the financial resources of the parties that guarantee the pegging [#SRC:065e7bb215b17ee1]. Putting these together, the firm cannot decide it qualifies for the adjustment without considering whether the parties supporting the peg have sufficient financial resources, because that consideration is a required input to the pegging analysis. In practice, the firm should treat the guarantor parties’ financial resources as part of the evidence base for concluding that the conditions for using the adjustment are met. This helps ensure the firm’s decision to apply an adjusted factor is grounded in the robustness of the peg’s support, rather than assuming the peg is reliable without assessing the guarantors’ capacity.", "method": "SCHEMA", "persona": "basic", "pair_uid": "8238224bf5f89bcd"}
{"item_id": "d53dd7c11f6495e2", "source_passage_id": "ae60277c11940928", "target_passage_id": "b7ac6dbd1a20206b", "question": "Where a firm enters into a business relationship or contract with an organisation to provide a product or service, how should the firm determine whether that organisation is a third party and whether the arrangement is within the PRA Rulebook definition of outsourcing (including where performance is via sub-outsourcing and would otherwise be undertaken by the firm)?", "gold_answer": "Under the SOURCE definition, the organisation is treated as a third party where it has entered into a business relationship or contract with a firm to provide a product or service [#SRC:ae60277c11940928]. The TARGET then sets the test for whether the arrangement with that third party is “outsourcing”: it must be an arrangement of any form between the firm and a service provider (whether supervised or not) under which the service provider performs a process, service, or activity that the firm would otherwise undertake itself, including where delivery is indirect through sub-outsourcing [#TGT:b7ac6dbd1a20206b]. In applying that definition to an arrangement with a third party, firms should also assess whether the third party will perform the relevant function or service (or part of it) on a recurrent or ongoing basis, as this is a key consideration in determining whether the arrangement falls within the outsourcing definition [#TGT:b7ac6dbd1a20206b]. If the arrangement with the third party does not meet the outsourcing definition, the SOURCE clarifies that existing outsourcing requirements only apply to arrangements that do meet that definition, and do not apply to other firm–third party arrangements outside it [#SRC:ae60277c11940928].", "method": "SCHEMA", "persona": "professional", "pair_uid": "dfdc287b585a547d"}
{"item_id": "a9c2059e6de9783d", "source_passage_id": "ae60277c11940928", "target_passage_id": "b7ac6dbd1a20206b", "question": "How do the SOURCE definition of a third party and the TARGET definition of outsourcing interact to delineate which firm arrangements are captured as outsourcing versus other third-party arrangements, particularly where the service provider performs activities the firm would otherwise perform and does so on a recurrent or ongoing basis?", "gold_answer": "The SOURCE establishes who is in scope as a third party: an organisation that has entered into a business relationship or contract with a firm to provide a product or service [#SRC:ae60277c11940928]. The TARGET then determines when an arrangement with such a third party is classified as outsourcing: it is any arrangement between a firm and a service provider (whether a supervised entity or not) where the provider performs a process, service, or activity—directly or via sub-outsourcing—that would otherwise be undertaken by the firm itself [#TGT:b7ac6dbd1a20206b]. In addition, when assessing whether a third-party arrangement falls within that outsourcing definition, firms should consider whether the third party will perform the relevant function or service (or part of it) on a recurrent or ongoing basis [#TGT:b7ac6dbd1a20206b]. This interaction is important because the SOURCE clarifies that existing outsourcing requirements only apply to “outsourcing” as defined, and they do not apply to other arrangements between firms and third parties that fall outside the outsourcing definition [#SRC:ae60277c11940928].", "method": "SCHEMA", "persona": "professional", "pair_uid": "dfdc287b585a547d"}
{"item_id": "73c88407cc4b2fc2", "source_passage_id": "ae60277c11940928", "target_passage_id": "b7ac6dbd1a20206b", "question": "If a firm signs a contract with an organisation to provide a product or service, when is that organisation treated as a third party, and when does the arrangement count as outsourcing under the PRA Rulebook (including if the work is done through sub-outsourcing and would otherwise be done by the firm)?", "gold_answer": "The organisation is a third party where it has entered into a business relationship or contract with a firm to provide a product or service [#SRC:ae60277c11940928]. Whether the arrangement with that third party is “outsourcing” depends on the PRA Rulebook definition: it must be an arrangement of any form between the firm and a service provider (whether a supervised entity or not) where the provider performs a process, service, or activity that the firm would otherwise undertake itself, and this can be done directly or through sub-outsourcing [#TGT:b7ac6dbd1a20206b]. When deciding if a third-party arrangement fits that outsourcing definition, firms should also consider whether the third party will perform the relevant function or service (or part of it) on a recurrent or ongoing basis [#TGT:b7ac6dbd1a20206b]. This matters because the SOURCE explains that existing outsourcing requirements only apply to arrangements that meet the outsourcing definition, and they do not apply to other arrangements between firms and third parties that fall outside it [#SRC:ae60277c11940928].", "method": "SCHEMA", "persona": "basic", "pair_uid": "dfdc287b585a547d"}
{"item_id": "fe75ea9c5402c981", "source_passage_id": "ae60277c11940928", "target_passage_id": "b7ac6dbd1a20206b", "question": "How can a firm tell the difference between (1) a normal arrangement with a third party and (2) outsourcing, using the third-party definition and the outsourcing definition (including the idea of ongoing or recurrent performance)?", "gold_answer": "First, identify whether the counterparty is a third party: under the SOURCE, it is an organisation that has entered into a business relationship or contract with a firm to provide a product or service [#SRC:ae60277c11940928]. Next, decide whether the arrangement with that third party is outsourcing under the TARGET: outsourcing is any arrangement between a firm and a service provider (whether supervised or not) where the provider performs a process, service, or activity—either directly or via sub-outsourcing—that the firm would otherwise carry out itself [#TGT:b7ac6dbd1a20206b]. The TARGET also says that, when assessing whether a third-party arrangement falls within the outsourcing definition, firms should consider whether the third party will perform the relevant function or service (or part of it) on a recurrent or ongoing basis [#TGT:b7ac6dbd1a20206b]. Finally, the SOURCE clarifies the consequence of this classification: existing outsourcing requirements only apply to arrangements that meet the outsourcing definition, and they do not apply to other firm–third party arrangements outside it [#SRC:ae60277c11940928].", "method": "SCHEMA", "persona": "basic", "pair_uid": "dfdc287b585a547d"}
{"item_id": "c7b0ec84bc13fac3", "source_passage_id": "c3be98a9a9c0f744", "target_passage_id": "ea60bc9486906c80", "question": "Where a credit union provides transactional account services and also is carrying out any additional activity or has more than 15,000 members, what must it do on an ongoing basis while those transactional account services are being provided, and how does that continuing duty relate to the further requirements triggered by the additional-activity or membership threshold condition?", "gold_answer": "If a credit union provides transactional account services, it has a continuing obligation that applies for the entire period it is providing those services: it must at all times comply with the referenced compliance requirement tied to that service activity [#SRC:c3be98a9a9c0f744]. Separately, when the same credit union is carrying out any additional activity or has more than 15,000 members, it is also subject to an additional set of mandatory requirements that are triggered by that condition and expressed as “must” obligations [#TGT:ea60bc9486906c80]. Read together, the credit union must treat the “at all times” duty as an always-on baseline for its transactional account services, and it must also identify whether it meets either of the trigger conditions (additional activity or the membership threshold) and then comply with the further mandatory steps that follow from that trigger. In practice, this means the credit union cannot pause or defer the ongoing compliance duty while it addresses the separate obligations that arise from its additional activities or larger membership size; both sets of requirements apply concurrently when their respective conditions are met.", "method": "SCHEMA", "persona": "professional", "pair_uid": "b2843f68fad5edb4"}
{"item_id": "bfec041bc6a9c89c", "source_passage_id": "c3be98a9a9c0f744", "target_passage_id": "ea60bc9486906c80", "question": "If a credit union offers transactional account services, and it also either carries out any additional activity or has more than 15,000 members, what does it have to do the whole time it is offering those services, and what extra “must” requirements are triggered by the additional activity or member count?", "gold_answer": "A credit union that provides transactional account services has an ongoing duty that applies continuously during the period it is providing those services: it must at all times comply with the specified compliance requirement linked to providing transactional account services [#SRC:c3be98a9a9c0f744]. In addition, if that credit union is carrying out any additional activity or has more than 15,000 members, it falls into a category that triggers further mandatory obligations—introduced as requirements the credit union “must” meet—because of the additional activity or the size of its membership [#TGT:ea60bc9486906c80]. Put simply, the “all the time” requirement applies whenever the credit union is offering transactional account services, and the separate trigger (additional activity or more than 15,000 members) adds another layer of required actions. The credit union should therefore check whether it meets either trigger condition and ensure it satisfies those extra requirements while still maintaining continuous compliance for its transactional account services.", "method": "SCHEMA", "persona": "basic", "pair_uid": "b2843f68fad5edb4"}
{"item_id": "06915e04d56d8668", "source_passage_id": "e8a9cb26c138e38f", "target_passage_id": "78cd1c923c80862d", "question": "For capital adequacy calculations for financial conglomerates that apply after 01/01/2027, how should an institution align the future version of Annex 2 with the accounting consolidation approach referenced in the Financial Groups Directive, and what concrete method label should be used to evidence that alignment?", "gold_answer": "Where an institution is preparing capital adequacy calculations for financial conglomerates for the period after 01/01/2027, it should treat the applicable framework as the future version of Annex 2 and ensure that its calculation approach is aligned to the accounting consolidation approach identified in the Financial Groups Directive materials. Practically, that means the institution should map its post‑01/01/2027 capital adequacy calculation work under the future Annex 2 context to the method explicitly described as the Accounting Consolidation Method, and it should document that the method used corresponds to the table entry that identifies “PART 1” as the relevant method description. This provides a clear, auditable linkage between the timing and scope of the capital adequacy calculations for financial conglomerates (after 01/01/2027) and the specific consolidation method label used for the calculation basis, avoiding ambiguity about which consolidation approach is being applied. This alignment is supported by the future Annex 2 framing in the SOURCE [#SRC:e8a9cb26c138e38f] and the method identification in the TARGET table describing the Accounting Consolidation Method under the Financial Groups Directive [#TGT:78cd1c923c80862d].", "method": "SCHEMA", "persona": "professional", "pair_uid": "739b91beda4a7161"}
{"item_id": "0ebfee712c94193b", "source_passage_id": "e8a9cb26c138e38f", "target_passage_id": "78cd1c923c80862d", "question": "If you are doing capital adequacy calculations for a financial conglomerate for dates after 01/01/2027, which consolidation method should you tie them to, based on the Financial Groups Directive table, and how does that connect to the future Annex 2 version?", "gold_answer": "For capital adequacy calculations for a financial conglomerate that are intended to apply after 01/01/2027, you should treat the work as falling under the future version of Annex 2 and then anchor the calculation basis to the consolidation method identified in the Financial Groups Directive table. The table points you to the Accounting Consolidation Method, described as the method in “PART 1,” so your documentation and working papers should show that your post‑01/01/2027 Annex 2 calculations are being performed using that accounting consolidation approach. In other words, the SOURCE establishes the timing and scope—capital adequacy calculations for financial conglomerates after 01/01/2027—while the TARGET provides the concrete method label you should reference when describing how the calculations are consolidated. Keeping both references together helps ensure that reviewers can see (i) why the future Annex 2 version is relevant for the period in question and (ii) which consolidation method you used to implement it. This linkage is grounded in the SOURCE [#SRC:e8a9cb26c138e38f] and the TARGET method table [#TGT:78cd1c923c80862d].", "method": "SCHEMA", "persona": "basic", "pair_uid": "739b91beda4a7161"}
{"item_id": "bd4af6295d18f9fe", "source_passage_id": "701ce6aa38be752a", "target_passage_id": "9d80cba8634278ab", "question": "When calculating the basic SCR, how must a firm treat an exposure that is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1, and what constraints apply to whether that guarantee may be recognised in the basic SCR calculation?", "gold_answer": "A firm must apply two linked obligations. First, for the specified purposes, where an exposure is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1 and the guarantee meets the requirements set out in 3G9, the firm must treat that exposure as an exposure to the central government [#SRC:701ce6aa38be752a]. Second, when calculating the basic SCR, the firm must not automatically recognise every guarantee it identifies; it must only recognise guarantees where recognition is explicitly referred to in the relevant Chapter and only where, in addition to meeting the qualitative criteria in 3G2 and 3G3, the applicable criteria are met [#TGT:9d80cba8634278ab]. Read together, this means the “central government” treatment for the exposure depends on the guarantee meeting the stated conditions, but the use of that guarantee within the basic SCR calculation is further constrained by the Chapter’s explicit recognition framework and the required qualitative criteria, plus any additional criteria that must be satisfied.", "method": "SCHEMA", "persona": "professional", "pair_uid": "9f4064a21340b184"}
{"item_id": "2eb72e9097354272", "source_passage_id": "701ce6aa38be752a", "target_passage_id": "9d80cba8634278ab", "question": "If a firm has an exposure that is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1, what must the firm do with that exposure, and when is the firm allowed to count that guarantee in the basic SCR calculation?", "gold_answer": "The firm has to follow both rules at the same time. On the exposure treatment side, if the exposure is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1 and the guarantee meets the requirements in 3G9, the firm must treat the exposure as an exposure to the central government [#SRC:701ce6aa38be752a]. On the basic SCR side, the firm cannot assume that any guarantee it has identified can be used in the calculation: it must only recognise guarantees in the basic SCR where the Chapter explicitly refers to recognising them, and only where the qualitative criteria in 3G2 and 3G3 are met, along with the other criteria that must be satisfied [#TGT:9d80cba8634278ab]. So, even if the guarantee is strong enough to drive “central government” treatment under the first obligation, the firm still must check that the basic SCR rules explicitly allow recognition and that the qualitative and other required criteria are met before using it in the calculation.", "method": "SCHEMA", "persona": "basic", "pair_uid": "9f4064a21340b184"}
{"item_id": "a83ca8edd377579e", "source_passage_id": "0d11214b8a087d7c", "target_passage_id": "42ffe564af71a480", "question": "For purposes of interpreting EU Guidelines and Recommendations, how should a firm understand the Bank of England and PRA approach set out in their SoP after the UK’s withdrawal from the EU, and what is the publication date associated with the referenced Bank of England paper that supports that SoP?", "gold_answer": "A firm should treat the relevant interpretive position as the one articulated jointly by the Bank of England and PRA in their statement of policy (SoP) on the “Interpretation of EU Guidelines and Recommendations,” which is expressly framed as the Bank of England and PRA approach after the UK’s withdrawal from the EU [#SRC:0d11214b8a087d7c]. To evidence and anchor that approach, the cross-referenced Bank of England paper identified in the paired material is dated April 2019, and it is the item linked under the same “Interpretation of EU Guidelines and Recommendations—BoE and PRA approach SoP” description [#TGT:42ffe564af71a480]. Read together, the SOURCE establishes the subject matter and regulatory actors (the Bank of England and PRA) and clarifies that the SoP is specifically about how EU Guidelines and Recommendations are to be interpreted in the post-withdrawal context, while the TARGET provides the concrete publication timing (April 2019) and the corresponding Bank of England web reference for the paper. Accordingly, compliance documentation should cite the Bank of England and PRA SoP as the governing interpretive statement and record April 2019 as the associated publication date for the referenced supporting paper.", "method": "SCHEMA", "persona": "professional", "pair_uid": "dd9aeed788a5817c"}
{"item_id": "a2204f1d099b9f87", "source_passage_id": "0d11214b8a087d7c", "target_passage_id": "42ffe564af71a480", "question": "When you need to understand how EU Guidelines and Recommendations should be interpreted after the UK’s withdrawal from the EU, which Bank of England and PRA document should you look to, and what date is given for the linked Bank of England paper about that approach?", "gold_answer": "You should look to the Bank of England and PRA SoP that is specifically titled around the “Interpretation of EU Guidelines and Recommendations” and describes the Bank of England and PRA approach after the UK’s withdrawal from the EU [#SRC:0d11214b8a087d7c]. The paired reference then points you to the related Bank of England paper for that same topic and provides the publication date as April 2019, alongside the Bank of England URL where the paper is hosted [#TGT:42ffe564af71a480]. Using both pieces together matters: the SOURCE tells you the correct actors (the Bank of England and PRA) and the purpose of the document (how to interpret EU Guidelines and Recommendations in the post-withdrawal setting), while the TARGET supplies the concrete timing detail (April 2019) and the specific web reference for the paper. In practice, this means your internal compliance note should identify the Bank of England and PRA SoP as the interpretive basis and record April 2019 as the date associated with the linked Bank of England paper supporting that approach.", "method": "SCHEMA", "persona": "basic", "pair_uid": "dd9aeed788a5817c"}
{"item_id": "a81786e8f784e9f2", "source_passage_id": "9ee08e95e6588105", "target_passage_id": "7fd5f2cd8f30684f", "question": "Where a firm has already had an investigation into its financial condition for its long-term insurance business carried out other than under the relevant procedure, how must the firm still comply with the requirement to ensure an annual investigation is made, including who must perform it and the basis on which it must be conducted?", "gold_answer": "The firm’s core obligation is to ensure that an investigation is made annually into its financial condition in respect of its long-term insurance business. That annual investigation must be carried out using methods and assumptions determined by the firm, and it must be performed by the person or persons who for the time being are appointed to perform the actuarial function [#TGT:7fd5f2cd8f30684f]. The procedural context recognises that an investigation into the firm’s financial condition in respect of its long-term insurance business may have been made “other than” under the referenced procedure, and that situation triggers further procedural handling (“either …”) rather than removing the annual requirement [#SRC:9ee08e95e6588105]. Accordingly, even if the firm has already undertaken an investigation outside that procedure, it must still ensure the annual investigation requirement is met in the manner specified: the firm determines the methods and assumptions, and the appointed actuarial function holder(s) perform the investigation. The existence of a non-procedure investigation is therefore a sequencing/route issue, not an exemption from the annual investigation obligation.", "method": "SCHEMA", "persona": "professional", "pair_uid": "64058a504e096e53"}
{"item_id": "f06ed73a8976cadc", "source_passage_id": "9ee08e95e6588105", "target_passage_id": "7fd5f2cd8f30684f", "question": "If an investigation into the firm’s financial condition for its long-term insurance business has already been done outside the usual procedure, what does the firm still have to do each year, and who must carry out that work?", "gold_answer": "Even where an investigation into the financial condition of the firm in respect of its long-term insurance business has been made other than under the referenced procedure (which the procedure text anticipates and then directs into an “either …” pathway) [#SRC:9ee08e95e6588105], the firm still has an ongoing duty to ensure an investigation is made annually into its financial condition for that long-term insurance business [#TGT:7fd5f2cd8f30684f]. The annual investigation is not just a general review: it must be conducted in accordance with the methods and assumptions determined by the firm, and it must be carried out by the person or persons who for the time being are appointed to perform the actuarial function [#TGT:7fd5f2cd8f30684f]. In practical terms, the earlier investigation done outside the procedure does not remove the annual requirement; the firm must still ensure that, each year, the investigation is performed by the appointed actuarial function holder(s) and is based on the firm’s chosen methods and assumptions, while also treating the “other than under” situation as a procedural condition that requires following the specified route in the procedure text [#SRC:9ee08e95e6588105].", "method": "SCHEMA", "persona": "basic", "pair_uid": "64058a504e096e53"}
{"item_id": "c35593e969f849e9", "source_passage_id": "a9dcecc8a5a3b33a", "target_passage_id": "eac5c4e524b93e43", "question": "When a firm plans a solvent exit—i.e., ceasing its PRA-regulated activities while remaining solvent—how should it address the transfer or repayment of deposits and the end-state change to its permission, and what additional statutory framework is referenced for the control of any business transfer that may be used as part of that approach?", "gold_answer": "A solvent exit is described as the process through which a firm ceases its PRA-regulated activities while remaining solvent, and the firm should plan to transfer or repay (or both) all deposits as part of that process [#SRC:a9dcecc8a5a3b33a]. The planning expectation is that the firm builds in sufficient time and resources to support meeting liabilities when they fall due and to enable the transfer and/or repayment of all deposits, so that the firm can complete the exit in an orderly way while remaining solvent [#SRC:a9dcecc8a5a3b33a]. The solvent exit is then expected to end with the removal of deposit-taking activity from the firm’s Part 4A permission or with the cancellation of the firm’s Part 4A permission, described as removal of the firm’s Part 4A PRA permission [#SRC:a9dcecc8a5a3b33a]. Where the firm’s approach involves a business transfer as a mechanism to move deposits or related business, the cross-reference indicates that further details on the control of business transfer are set out in Part VII of the Financial Services and Markets Act 2000 (FSMA) [#TGT:eac5c4e524b93e43].", "method": "SCHEMA", "persona": "professional", "pair_uid": "7c5267a405cee611"}
{"item_id": "4386eeb235feca3a", "source_passage_id": "a9dcecc8a5a3b33a", "target_passage_id": "eac5c4e524b93e43", "question": "If a firm wants to do a solvent exit (stop its PRA-regulated activities but stay solvent), what does it need to plan for around paying back or moving deposits and changing its permission, and where should it look for more detail if it uses a business transfer to do that?", "gold_answer": "A solvent exit is the process through which a firm ceases its PRA-regulated activities while remaining solvent, and the firm should plan to transfer or repay (or both) all deposits as part of that exit [#SRC:a9dcecc8a5a3b33a]. The firm’s solvent exit planning should also include enough time and resources to support the firm in meeting liabilities when they fall due and in carrying out the transfer and/or repayment of all deposits, so the firm can complete the process without becoming insolvent [#SRC:a9dcecc8a5a3b33a]. The end of the solvent exit is tied to a permission outcome: it will end with the removal of deposit-taking activity from the firm’s Part 4A permission, or with cancellation of the firm’s Part 4A permission (referred to as removal of the firm’s Part 4A PRA permission) [#SRC:a9dcecc8a5a3b33a]. If the firm’s plan relies on a business transfer as the way to move business connected to deposits, the referenced place to find further details on the control of business transfer is Part VII of the Financial Services and Markets Act 2000 (FSMA) [#TGT:eac5c4e524b93e43].", "method": "SCHEMA", "persona": "basic", "pair_uid": "7c5267a405cee611"}
{"item_id": "fd9145aee2d74196", "source_passage_id": "db44207a07b3ce1d", "target_passage_id": "455a69762013a60b", "question": "For a firm, how should the Chief Executive function (SMF1) be classified when it is one of the functions listed in the specified range, and what responsibility test determines whether the role is in fact the Chief Executive function (SMF1) under the governing body’s immediate authority?", "gold_answer": "Where the Chief Executive function (SMF1) falls within the set of functions identified in the specified range, it must be treated as a controlled function and also as a PRA senior management function, because each function in that range is expressly classified in that way [#SRC:db44207a07b3ce1d]. Whether a particular individual is performing “The Chief Executive function (SMF1)” depends on the responsibility test in the definition: the person must have responsibility, under the immediate authority of the governing body, either alone or jointly with others, for carrying out the management of the conduct of the whole of the business (or relevant activities) of a firm [#TGT:455a69762013a60b]. In practice, this means the classification consequence (controlled function and PRA senior management function) attaches once the role is within the specified range, while the definitional trigger for SMF1 focuses on the nature and scope of responsibility (management of the conduct of the whole business or relevant activities) and the governance relationship (immediate authority of the governing body), including where responsibility is shared jointly with others. This aligns the label “The Chief Executive function (SMF1)” with both its responsibility criteria and its regulatory categorisation.", "method": "SCHEMA", "persona": "professional", "pair_uid": "86cb7875da3318c7"}
{"item_id": "ae49c4ee57a09055", "source_passage_id": "db44207a07b3ce1d", "target_passage_id": "455a69762013a60b", "question": "If someone is performing the Chief Executive function (SMF1), what does that role mean in terms of responsibility under the governing body, and how is it treated when it is one of the functions in the specified range?", "gold_answer": "“The Chief Executive function (SMF1)” means having responsibility, under the immediate authority of the governing body, either alone or jointly with others, for carrying out the management of the conduct of the whole of the business (or relevant activities) of a firm [#TGT:455a69762013a60b]. Separately, the regulatory treatment depends on whether the function is within the specified range: each of the functions in that range is a controlled function and a PRA senior management function [#SRC:db44207a07b3ce1d]. Put together, you identify SMF1 by checking the responsibility test (scope: whole business or relevant activities; reporting line: immediate authority of the governing body; and whether the responsibility is held alone or jointly). If the Chief Executive function (SMF1) is one of the functions in the specified range, then it is not just a title—it carries the formal status of being both a controlled function and a PRA senior management function. This combined reading ensures you apply the definition of SMF1 to the person’s actual responsibilities and then apply the classification that attaches to functions in the specified range.", "method": "SCHEMA", "persona": "basic", "pair_uid": "86cb7875da3318c7"}
