{"passage_uid": "d236289c09b769e3", "text": "Section I: Pillar 2A methodologies sets out the methodologies the PRA will use to inform the setting of a firm’s Pillar 2A capital requirement for credit risk, market risk, operational risk, counterparty credit risk, credit concentration risk, interest rate risk in the non-trading book (hereafter referred to as interest rate risk in the banking book (IRRBB)), pension obligation risk and group risk, including RFB group risk.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_statements-of-policy_sop---the-pras-methodologies-for-setting-pillar-2-capital::p000003"}
{"passage_uid": "71828950bd20348f", "text": "This chapter sets out the methodology the PRA uses to inform the setting of a firm’s Pillar 2A capital requirement for credit risk.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_statements-of-policy_sop---the-pras-methodologies-for-setting-pillar-2-capital::p000006"}
{"passage_uid": "cf55dc9054b4cdbf", "text": "The PRA considers that all buffers in the capital framework, including the PRA buffer, can be used as required in times of stress. When this happens, the PRA will be content for firms to rebuild their buffers over a reasonable period of time. In exercising its judgement on what constitutes a reasonable time to rebuild buffers drawn down in stress, the PRA will take into account the amount by which the buffer has been used and the expected duration of the stress. It will consider any firm-specific drivers of the use of the buffer, in the context of current and forecast macroeconomic and financial conditions. There is no expectation on firms to maintain additional amounts of capital to avoid being within the PRA buffer in the event of a stress. More detail on the PRA’s response to firms using buffers can be found in SS31/15. 34", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_statements-of-policy_sop---the-pras-methodologies-for-setting-pillar-2-capital::p000214"}
{"passage_uid": "a6f49674c529a776", "text": "34. ‘The Internal Capital Adequacy Assessment Process (ICAAP) and the Supervisory Review and Evaluation Process (SREP)’, March 2019: https://www.bankofengland.co.uk/prudential-regulation/publication/2013/the-internal-capital-adequacy-assessment-process-and-supervisory-review-ss .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_statements-of-policy_sop---the-pras-methodologies-for-setting-pillar-2-capital::footnote-34"}
{"passage_uid": "b7ac6dbd1a20206b", "text": "The PRA Rulebook defines ‘outsourcing’ as ‘an arrangement of any form between a firm and a service provider, whether a supervised entity or not, by which that service provider performs a process, a service or an activity, whether directly or by sub-outsourcing, which would otherwise be undertaken by the firm itself’. This definition derives from Article 2(3) of MODR (Commission Delegated Regulation on organisational requirements and operating conditions). In line with the EBA Outsourcing GL, when considering whether an arrangement with a third party falls within the definition of outsourcing, firms should consider whether the third party will perform the relevant function or service (or part thereof) on a recurrent or an ongoing basis.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss02-21-outsourcing-and-third-party-risk-management::p000047"}
{"passage_uid": "ae60277c11940928", "text": "Existing requirements on outsourcing, including Articles 30–32 of MODR and Conditions Governing Business 7 in the PRA Rulebook, only apply to ‘outsourcing’ as defined in paragraph 2.1 . They do not apply to other arrangements between firms and third parties which fall outside the definition of outsourcing. In line with the definition in the G7 Third Party Elements and EBA ICT GL, this SS defines a ‘third party’ as ‘an organisation that has entered into a business relationship or contract with a firm to provide a product or service’.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss02-21-outsourcing-and-third-party-risk-management::p000049"}
{"passage_uid": "b3afbbf8d96609e4", "text": "Credit unions should have proportionate risk management systems, adequate for the needs of their business. Where there is evidence of poor risk management and/or governance at a credit union, the credit union should expect the PRA to engage with it on its mitigation plans. Where the credit union fails to engage or make meaningful progress, it should expect the PRA to engage more fully on whether it has a viable future and, if not, what plans it has to close in an orderly fashion. This could be by way of insolvent wind-up, solvent wind-down, or the transfer of its engagements to another credit union.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss02-23-supervising-credit-unions::p000063"}
{"passage_uid": "865973d64c7565e2", "text": "In addition to the expectations set out in Chapters 9 and 11 , credit unions with more than £50 million in total assets and/or credit unions that carry out more complex lending (such as providing mortgages or lending to corporates), and/or credit unions that invest in more complex investment products (supranational bonds, corporate bonds, bank bonds, and money market funds) should expect to engage more with the PRA. The PRA expects these credit unions to undertake scenario analysis to identify the impact of key strategic initiatives and external risks on their businesses. Examples of scenarios a credit union may use include: poorer than expected loan book performance; greater than expected increase in shares, higher than expected arrears, changes to welfare benefits, changes in bank interest rates etc. The PRA considers it good practice to look at combined scenarios.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss02-23-supervising-credit-unions::p000111"}
{"passage_uid": "a9dcecc8a5a3b33a", "text": "A solvent exit means the process through which a firm ceases its PRA-regulated activities while remaining solvent. 2 The firm should transfer 3 or repay (or both) all deposits as part of its solvent exit. 4 In the firm’s solvent exit planning, it should build in sufficient time and resources to support the firm in meeting liabilities when they fall due and in transferring and/or repaying all deposits. At a point after this, a solvent exit will end with the removal of deposit-taking activity from the firm’s Part 4A permission, or with the cancellation of the firm’s Part 4A permission (hereinafter referred to as the removal of the firm’s Part 4A PRA permission). 5", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss02-24---solvent-exit-planning-for-non-systemic-banks-and-building-societies::p000004"}
{"passage_uid": "eac5c4e524b93e43", "text": "3. See Part VII of the Financial Services and Markets Act 2000 (FSMA) for further details of control of business transfer.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss02-24---solvent-exit-planning-for-non-systemic-banks-and-building-societies::footnote-3"}
{"passage_uid": "6ed49c6d770ad510", "text": "Conditions Governing Business 3.1(1A)(c) requires UK Solvency II firms, the Society and managing agents to implement and maintain a risk management system that includes approved risk tolerance limits that implement an insurer’s risk strategy and facilitate control mechanisms. Consistent with this obligation, the PRA expects a UK Solvency II firm, the Society and managing agents to establish and maintain a clearly defined liquidity risk appetite statement and for senior management to identify material sources of liquidity risk for which prudent risk limits should be set. For non-Directive firms, Non-Solvency II Firms – Governance 7.3(2) requires an insurer to document its policies in relation to liquidity risk, including its appetite or tolerance for this risk.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss05-19-liquidity-risk-management-for-insurers::p000047"}
{"passage_uid": "8e5451c44f63e11a", "text": "The PRA will make an overall assessment of whether the home state supervisor is sufficiently equivalent, and whether its regime is consistent with the UK regulatory framework in delivering appropriate outcomes that meet the PRA’s objectives. 9 The PRA assesses these factors in their totality, but will place considerable weight on assessing the extent and quality of co-operation with the home state supervisor. The PRA will take into account the supervision of individual firms (including branches) and their consolidated group, and it will consider the nature and scale of a firm’s activities in the UK.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss05-21-international-banks---pras-approach-to-branch-and-subsidiary-supervision::p000039"}
{"passage_uid": "b4c97c646d738581", "text": "9. The PRA’s assessment of equivalence is based on the outcomes achieved and is for the purposes of authorisation and supervision by the PRA, which is separate from advice the PRA may provide to HM Treasury where HM Treasury may make determinations of equivalence for other purposes. The PRA may give advice to HM Treasury pursuant to Regulation 4 of The Equivalence Determinations for Financial Services and Miscellaneous Provisions (Amendment etc.) (EU Exit) Regulations 2019 (SI 2019/541).", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss05-21-international-banks---pras-approach-to-branch-and-subsidiary-supervision::footnote-9"}
{"passage_uid": "a1be217c65884ad1", "text": "This SS provides guidance for significant 1 (PRA Category 1 and 2) Solvency II firms in complying with the requirements in Chapter 3A in the Conditions Governing Business Part of the PRA Rulebook. It may also be used as a guide for smaller firms when reviewing their remuneration policies and practices against Chapter 3A . This statement does not set absolute requirements as these are contained in the directly applicable Solvency II Regulation which came into force on 1 January 2016. Category 1 and 2 firms unable to meet or exceed the PRA’s expectations (as set out in this SS) should inform their PRA supervisory contact.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss10-16---solvency-ii-remuneration-requirements::p000004"}
{"passage_uid": "8f66b79fd6850545", "text": "Where remuneration contains a variable component, Conditions Governing Business 3A.2 requires firms to defer a ‘substantial portion of the variable remuneration component’ for a period of not less than three years for Solvency II staff. There is no flexibility in the Chapter 3A for Solvency II firms to elect a shorter period than this specified minimum three year period, with firms required to ensure that the period (be it three years or longer) is ‘correctly aligned with the nature of the business, its risks, and the activities of the employees in question’. The natural life cycle of the business and associated risks should be considered when setting the length of the deferral period. Variable remuneration payable under these deferral arrangements must vest no faster than pro-rata from year one. There may also be the potential for multi–period schemes to operate within the same deferred bonus plan or Long Term Incentive Plan (LTIP). The actual arrangements put in place to comply with this requirement will remain, however, a discretionary matter for the firm.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss10-16---solvency-ii-remuneration-requirements::p000036"}
{"passage_uid": "0d11214b8a087d7c", "text": "the Bank of England and PRA SoP – Interpretation of EU Guidelines and Recommendations: Bank of England and PRA approach after the UK’s withdrawal from the EU ; 4", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss17-16---solvency-ii---internal-models-assessment-model-change::p000018"}
{"passage_uid": "42ffe564af71a480", "text": "4. April 2019: http://www.bankofengland.co.uk/paper/2019/interpretation-of-eu-guidelines-and-recommendations-boe-and-pra-approach-sop .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_guidance_supervisory-statements_ss17-16---solvency-ii---internal-models-assessment-model-change::footnote-4"}
{"passage_uid": "1bc35205ce53c44d", "text": "MCR (gi,l) and MCR (l,l) must be calculated in the same way as MCR (linear,gi) and MCR (linear,l) referred to in Minimum Capital Requirement 3B and 3C respectively, but the technical provisions or premiums written used in the calculation must only relate to long-term insurance and reinsurance obligations .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_composites::p000094"}
{"passage_uid": "9f2e6ec1c2bc29ca", "text": "(1) A firm must establish, implement, and maintain an effective risk-management system comprising strategies, processes and reporting procedures necessary to identify, measure, monitor, manage and report on a continuous basis the risks, at an individual and at an aggregated level, to which it is or could be exposed, and their interdependencies.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_conditions-governing-business::p000097"}
{"passage_uid": "9c0a502a887dae03", "text": "When establishing and implementing the remuneration policy referred to in 2A.1(12) , a firm must comply with all of the following principles:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_conditions-governing-business::p000231"}
{"passage_uid": "682a94015e8ea157", "text": "A firm must ensure that the specific arrangements referred to in 3A.1(3) comply with all of the following principles:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_conditions-governing-business::p000239"}
{"passage_uid": "8c09e01dcc86affd", "text": "[Note: Article 272 (1), (2), (3), (4), (7), (9), (10), (11), and (13) to (25) remain in the CRR . Article 272 (6), (8), (12), and (26) are set out above at rule 1.2 . Article 272 (5) has been deleted]", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_counterparty-credit-risk-crr::p000043"}
{"passage_uid": "5eee0f901c042e7e", "text": "Future version of Article 272 Definitions after 01/01/2027", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_counterparty-credit-risk-crr::p000044"}
{"passage_uid": "c5ef344684d38393", "text": "Where an institution has ceased to calculate the exposure values of its derivative positions in accordance with Section 4 or 5 , as applicable, it shall only be permitted to resume calculating the exposure value of its derivative positions as set out in Section 4 or 5 where it demonstrates to the competent authority that all the conditions set out in Article 273a(1) or (2) have been met for an uninterrupted period of one year.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_counterparty-credit-risk-crr::p000098"}
{"passage_uid": "b16c73e93c0f2966", "text": "Institutions shall calculate a single exposure value at netting set level in accordance with Section 3 , subject to paragraph 2 of this Article.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_counterparty-credit-risk-crr::p000400"}
{"passage_uid": "c3be98a9a9c0f744", "text": "A credit union that provides transactional account services must at all times while providing such services comply with 10.3 .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_credit-unions::p000221"}
{"passage_uid": "ea60bc9486906c80", "text": "A credit union that is carrying out any additional activity or has more than 15,000 members must:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_credit-unions::p000280"}
{"passage_uid": "01b09661643bb171", "text": "Institutions shall disclose the following information regarding their leverage ratio as calculated in accordance with Article 429 of Chapter 3 of the Leverage Ratio (CRR) Part and their management of the risk of excessive leverage:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_disclosure-crr::p000369"}
{"passage_uid": "f531114f03d67d24", "text": "Institutions shall make the disclosures on the leverage ratio , required in Article 451 of the CRR as follows:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_disclosure-crr::p000489"}
{"passage_uid": "78cd1c923c80862d", "text": "1 Table: PART 1: Method of Annex I of the Financial Groups Directive (Accounting Consolidation Method)", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_financial-conglomerates::p000210"}
{"passage_uid": "e8a9cb26c138e38f", "text": "Future version of Annex 2 - Capital Adequacy Calculations for Financial Conglomerates after 01/01/2027", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_financial-conglomerates::p000216"}
{"passage_uid": "19c9e8d0b9a70534", "text": "In the case of general insurance business consisting of health insurance based on actuarial principles, 8.5 applies with the substitution of 8.66% for 26% if the conditions in 7.5 (1) to (5) are satisfied.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_friendly-society-required-margin::p000093"}
{"passage_uid": "da680341ca9e8782", "text": "Where 8.6 applies to a firm whose general insurance business consists partly of health insurance based on actuarial principles and partly of other business, 8.2 to 8.6 must operate separately for each part of the general insurance business , so as to produce a sum under 8.6 for the health insurance and a sum under 8.5 for the other business.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_friendly-society-required-margin::p000094"}
{"passage_uid": "d8d2715150b31137", "text": "Consolidated data for the calculation of group solvency according to method 1 shall consist of all of the following:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_group-supervision::p000350"}
{"passage_uid": "b59ae9eaea39bc4b", "text": "(1) an SCR calculated on the basis of consolidated data as referred to in points (1) to (3) of 11.1A , data of collective investment undertakings and investments packaged as funds which are subsidiaries of the parent undertaking , following the rules laid down in the Solvency Capital Requirement - General Provisions , Solvency Capital Requirement – Internal Models and Solvency Capital Requirement – Standard Formula Parts ;", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_group-supervision::p000379"}
{"passage_uid": "db44207a07b3ce1d", "text": "Each of the functions in 3 – 10 and 12 is a controlled function and a PRA senior management function .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_insurance---senior-management-functions::p000058"}
{"passage_uid": "455a69762013a60b", "text": "The Chief Executive function (SMF1) is the function of having responsibility, under the immediate authority of the governing body , alone or jointly with others, for carrying out the management of the conduct of the whole of the business (or relevant activities) of a firm .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_insurance---senior-management-functions::p000103"}
{"passage_uid": "4ea2648a6342b626", "text": "(1) comply with Insurance Company – Capital Resources Requirements 3.1 ; and", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_insurance-company---capital-resources::p000207"}
{"passage_uid": "7fd5f2cd8f30684f", "text": "A firm must ensure that an investigation is made annually into its financial condition in respect of its long-term insurance business , in accordance with the methods and assumptions determined by the firm , by the person or persons who for the time being are appointed to perform the actuarial function .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_insurance-company---reporting::p000263"}
{"passage_uid": "9ee08e95e6588105", "text": "When an investigation into the financial condition of the firm in respect of its long-term insurance business has been made other than under 5.8 either:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_insurance-company---reporting::p000264"}
{"passage_uid": "34d0efbb3e1b0536", "text": "A firm must maintain at all times capital resources equal to or in excess of its CR Requirement .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_insurance-company-capital-resources-requirements::p000057"}
{"passage_uid": "ac036858232f3caf", "text": "Unless the contrary intention appears, CRR rules and rules made under section 192XA FSMA shall be read as if they formed part of CRR , and accordingly words and expressions used in those rules shall bear the meaning they have in CRR (and not the meaning in the Glossary to the Rulebook).", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_interpretation::p000055"}
{"passage_uid": "4b7d02b366371a2f", "text": "If you are a Conduct Rules non-executive director , you must comply at all times with the conduct standards specified in 3.1 to 3.3 , 3.7 and 3.8 .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_large-non-solvency-ii-firms-conduct-standards::p000030"}
{"passage_uid": "1ac71628712a0761", "text": "Senior Manager Conduct Standard 4: You must disclose appropriately any information of which the FCA or the PRA would reasonably expect to have notice.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_large-non-solvency-ii-firms-conduct-standards::p000046"}
{"passage_uid": "c7e7f33bf6b32c41", "text": "Liquidity outflows shall be calculated by multiplying the outstanding balances of various categories or types of liabilities and off-balance sheet commitments by the rates at which they are expected to run off or be drawn down as indicated in this Chapter 2 of Title III (Liquidity Outflows and Inflows) .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_liquidity-coverage-ratio-crr::p000319"}
{"passage_uid": "c30fbe1b93b553fa", "text": "(13) ‘ liquidity buffer ’ means the amount of level 1 assets and level 2 assets that an institution holds in accordance with Chapter 2 of the Liquidity Coverage Ratio (CRR) Part of the PRA Rulebook;", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_liquidity-crr::p000087"}
{"passage_uid": "4ee46c40137426d7", "text": "The linear formula component for general insurance and reinsurance obligations referred to in 3A.1 must be equal to the following:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_minimum-capital-requirement::p000039"}
{"passage_uid": "40535db1194b8610", "text": "To the extent that the rules in this Part are not CRR rules, rule 2.13 of the Interpretation Part shall apply to the rules as if they were CRR rules.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_own-funds-and-eligible-liabilities-crr::p000026"}
{"passage_uid": "8b849964a198cf45", "text": "[Note 2: Related provisions in Article 12 of Chapter 4 of Own Funds (CRR) Part ]", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_own-funds-and-eligible-liabilities-crr::p000120"}
{"passage_uid": "6cc8b722cd5cd1e7", "text": "The concept of gain on sale referred to in point (a) paragraph 1 of Article 32 of the CRR shall mean any recognised gain on sale for the institution that is recorded as an increase in any element of own funds and is associated with future margin income arising from a sale of securitised assets when they are removed from the institution’s balance sheet in the context of a securitisation transaction.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_own-funds-and-eligible-liabilities-crr::p000856"}
{"passage_uid": "ddb71c7a316d2892", "text": "For the purpose of determining its basic own funds , a firm must reduce its basic own funds by the part of the value of all participations , as referred to in 3K.6 , in financial and credit institutions, other than participations referred to in 3K.1 , to the extent the aggregate value exceeds 10% of items included in 3A.1(1)(a) , 3A.1(1)(b) , 3A.1(1)(d) and 3A.1(1)(f) .", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_own-funds::p000362"}
{"passage_uid": "c6721f79b60bc179", "text": "A firm must make the deductions set out in 3K.1 and 3K.2 from the corresponding tier in which the participation has increased the own funds of the related undertaking as follows:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_own-funds::p000365"}
{"passage_uid": "9b1e1dd387715b19", "text": "If a participant firm ceases to conduct business that could give rise to a protected claim by an eligible claimant and notifies the FSCS of this under 21.5 (1)(a), it will be treated as a participant firm to which 21.48 applies until the end of the financial year of the compensation scheme in which the notice was given.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_policyholder-protection::p000621"}
{"passage_uid": "9efdd1275a936ea0", "text": "If a firm ceases to be a participant firm or carries out activities within one or more insurance classes part way through a financial year of the compensation scheme :", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_policyholder-protection::p000734"}
{"passage_uid": "d73e36dd5bef0292", "text": "(2) A firm must submit the quarterly quantitative reporting templates referred to in Articles 6(1) , 21A(6) and 37 of Chapter 2A no later than 30 business days after the end of each quarter of the firm’s financial year.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_reporting::p000096"}
{"passage_uid": "e36647fee0846ae4", "text": "Firms must submit information to the PRA quarterly using the following templates (as applicable):", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_reporting::p000156"}
{"passage_uid": "783eb897186947a6", "text": "(8) S i and S j denote the capital requirement for sub-modules i and j of that particular module, respectively, which are calculated in the following way: (a) the sub-module is generated by the standard formula provided that the sub-module does not consist of other sub-modules; and (b) the sub-module is calculated in accordance with 16F.3 provided that the sub-module consists of other sub-modules;", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---internal-models::p000314"}
{"passage_uid": "d0f5710ab3cb3488", "text": "For all sub-modules of the standard formula referred to in 16F.2(8)(b) , the capital requirement of a particular sub-module must be generated by the formula set out in 16F.1 , applying the following specifications:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---internal-models::p000318"}
{"passage_uid": "e722345e3cfbec34", "text": "Notwithstanding 3D21.3 , in respect of securitisations issued before 18 January 2015 that qualify as type 1 securitisations in accordance with Article 177(4) in the version of Commission Delegated Regulation (EU) 2015/35 that was in force on 31 December 2018, a firm must assign a risk factor stress i in accordance with Articles 177 and 178 in the version in force on 31 December 2018.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---standard-formula::p001162"}
{"passage_uid": "4baeb76490d6d9b2", "text": "For the purposes of 3D22.3 and 3D22.4 , Article 177 (in the version of Commission Delegated Regulation (EU) 2015/35 which was in force on 31 December 2018) continues to have effect notwithstanding its deletion by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, and has effect for those purposes with the following modifications:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---standard-formula::p001164"}
{"passage_uid": "701ce6aa38be752a", "text": "For the purposes of 3D31.3(1) , a firm must treat exposures that are fully, unconditionally and irrevocably guaranteed by bodies listed in 3D1 , where the guarantee meets the requirements set out in 3G9 , as exposures to the central government.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---standard-formula::p001293"}
{"passage_uid": "6d25f010b1a021ba", "text": "For currencies which are pegged to the euro, a firm may adjust the 25% factor referred to in 3D32.4 and 3D32.5 in accordance with 3D33 and 3D34 , provided that all of the following requirements are met:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---standard-formula::p001312"}
{"passage_uid": "065e7bb215b17ee1", "text": "For the purposes of 3D32.6(1) , the financial resources of the parties that guarantee the pegging must be taken into account.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---standard-formula::p001318"}
{"passage_uid": "9d80cba8634278ab", "text": "In the calculation of the basic SCR , a firm must only recognise guarantees where explicitly referred to in this Chapter, and where in addition to the qualitative criteria in 3G2 and 3G3 , all of the following criteria are met:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---standard-formula::p001599"}
{"passage_uid": "1340ce6852b2044b", "text": "(1) For the purposes of 7.1 (1), a firm must determine whether the simplified calculation is proportionate to the nature, scale and complexity of the risks by carrying out an assessment which must include all of the following: (a) an assessment of the nature, scale and complexity of the risks of the firm covered in the relevant module or sub-module; (b) an evaluation in qualitative or quantitative terms, as appropriate, of the error introduced in the results of the simplified calculation due to any deviation between the following: (i) the assumptions underlying the simplified calculation in relation to the risk; (ii) the results of the assessment referred to in (a).", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---standard-formula::p001710"}
{"passage_uid": "414827dbd2cd570d", "text": "Subject to 7.2 , a firm may calculate the capital requirement for health longevity risk in accordance with the following formula:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_solvency-capital-requirement---standard-formula::p001834"}
{"passage_uid": "a2326f65154f25e3", "text": "Institutions shall ensure that positions in the trading book shall be either free of restrictions on their tradability or able to be hedged.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_trading-book-crr::p000037"}
{"passage_uid": "93f9d67ba5aa8c4d", "text": "Institutions shall have in place clearly defined policies and procedures for determining which position to include in the trading book for the purposes of calculating their capital requirements, in accordance with the requirements set out in Article 102 and the definition of trading book in accordance with point (86) of Article 4(1), taking into account the institution's risk management capabilities and practices. The institution shall fully document its compliance with these policies and procedures and shall subject them to periodic internal audit.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_trading-book-crr::p000070"}
{"passage_uid": "afb555cc7b93169d", "text": "A firm with approval to use the risk-free interest rate transitional measure must:", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_transitional-measures::p000152"}
{"passage_uid": "a3e72f5534ea6d57", "text": "A firm with approval to use the risk-free interest rate transitional measure and that is required to submit a phasing-in plan in accordance with 12.1(3) must submit annually a report to the PRA setting out the measures taken and progress made to ensure compliance with the SCR by 1 January 2032.", "passage_id": "pra_rulebook__www.prarulebook.co.uk_pra-rules_transitional-measures::p000163"}
