{"qa_uid": "cc5acb874798644c", "method": "DPEL", "persona": "professional", "question": "When applying 3D22.3 and 3D22.4 to a firm’s treatment of securitisations issued before 18 January 2015, how should the firm determine whether the securitisation qualifies as a type 1 securitisation and which version of Article 177 should be used, given that Article 177 was later deleted by Commission Delegated Regulation (EU) 2018/1221?", "expected_answer": "A firm should assess “type 1 securitisation” status by applying Article 177(4) as it appeared in Commission Delegated Regulation (EU) 2015/35 in force on 31 December 2018, and it should treat Article 177 as continuing to apply for the purposes of 3D22.3 and 3D22.4 despite its later deletion. [#TGT:e722345e3cfbec34] [#SRC:4baeb76490d6d9b2] In particular, where the securitisation was issued before 18 January 2015 and qualifies as type 1 under that Article 177(4) version, the firm must assign the risk factor stress i using Articles 177 and 178 as in force on 31 December 2018. [#TGT:e722345e3cfbec34] The continued effect of Article 177 for 3D22.3 and 3D22.4 is explicitly preserved notwithstanding its deletion by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, and it applies for those purposes with modifications. [#SRC:4baeb76490d6d9b2] Accordingly, the firm’s classification step (type 1 under Article 177(4)) and its stress assignment step (risk factor stress i under Articles 177 and 178) both anchor to the 31 December 2018 version, while the rule context for continuing to use Article 177 is tied to 3D22.3 and 3D22.4. [#TGT:e722345e3cfbec34] [#SRC:4baeb76490d6d9b2]", "pair_uid": "ce92396d8db7aace", "source_passage_uid": "4baeb76490d6d9b2", "target_passage_uid": "e722345e3cfbec34", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769371964, "run_seed": 13, "debug_context": {"source_text": "For the purposes of 3D22.3 and 3D22.4 , Article 177 (in the version of Commission Delegated Regulation (EU) 2015/35 which was in force on 31 December 2018) continues to have effect notwithstanding its deletion by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, and has effect for those purposes with the following modifications:", "target_text": "Notwithstanding 3D21.3 , in respect of securitisations issued before 18 January 2015 that qualify as type 1 securitisations in accordance with Article 177(4) in the version of Commission Delegated Regulation (EU) 2015/35 that was in force on 31 December 2018, a firm must assign a risk factor stress i in accordance with Articles 177 and 178 in the version in force on 31 December 2018."}}
{"qa_uid": "174dd2ca7c0b499c", "method": "DPEL", "persona": "basic", "question": "If a firm is dealing with a securitisation issued before 18 January 2015, what does it need to check to treat it as a type 1 securitisation and which Articles must it use to set the risk factor stress i, considering Article 177 was deleted later but still matters for 3D22.3 and 3D22.4?", "expected_answer": "The firm needs to confirm the securitisation qualifies as a type 1 securitisation by using Article 177(4) from the version of Commission Delegated Regulation (EU) 2015/35 that was in force on 31 December 2018, and then it must set the risk factor stress i using Articles 177 and 178 from that same in-force version. [#TGT:e722345e3cfbec34] Even though Article 177 was deleted by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, it is treated as still applying for the purposes of 3D22.3 and 3D22.4, with modifications for those purposes. [#SRC:4baeb76490d6d9b2] Putting these together, the “issued before 18 January 2015” condition and the “type 1” test both point you to the 31 December 2018 version of Article 177(4), while the actual calculation step for risk factor stress i requires applying Articles 177 and 178 as in force on 31 December 2018. [#TGT:e722345e3cfbec34] The reason you can still rely on Article 177 in this context is that it continues to have effect specifically for 3D22.3 and 3D22.4 despite the later deletion. [#SRC:4baeb76490d6d9b2]", "pair_uid": "ce92396d8db7aace", "source_passage_uid": "4baeb76490d6d9b2", "target_passage_uid": "e722345e3cfbec34", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769371964, "run_seed": 13, "debug_context": {"source_text": "For the purposes of 3D22.3 and 3D22.4 , Article 177 (in the version of Commission Delegated Regulation (EU) 2015/35 which was in force on 31 December 2018) continues to have effect notwithstanding its deletion by Article 1(3) of Commission Delegated Regulation (EU) 2018/1221, and has effect for those purposes with the following modifications:", "target_text": "Notwithstanding 3D21.3 , in respect of securitisations issued before 18 January 2015 that qualify as type 1 securitisations in accordance with Article 177(4) in the version of Commission Delegated Regulation (EU) 2015/35 that was in force on 31 December 2018, a firm must assign a risk factor stress i in accordance with Articles 177 and 178 in the version in force on 31 December 2018."}}
{"qa_uid": "838fa5f60c5858a5", "method": "DPEL", "persona": "professional", "question": "Where a rule in this Part is not a CRR rule, how should it be interpreted in relation to CRR—specifically, should it be treated as if it were a CRR rule for interpretive purposes, and which meaning (CRR vs the Glossary to the Rulebook) should be applied to words and expressions used in that rule?", "expected_answer": "A rule in this Part that is not itself a CRR rule should still be interpreted on a CRR-aligned basis, because the Part directs that rule 2.13 of the Interpretation Part applies to those non‑CRR rules as though they were CRR rules. [#SRC:40535db1194b8610] In parallel, the interpretive approach for CRR rules (and rules made under section 192XA FSMA) is to read them as if they formed part of CRR unless there is a clear contrary intention, and to give words and expressions the meanings they have in CRR rather than the meanings in the Glossary to the Rulebook. [#TGT:ac036858232f3caf] Taken together for a non‑CRR rule in this Part, the practical compliance outcome is that you should apply the Interpretation Part mechanism that treats the rule like a CRR rule, and then interpret the terminology using CRR meanings (not Glossary meanings) unless the text shows a contrary intention. [#SRC:40535db1194b8610] [#TGT:ac036858232f3caf] This linkage matters because the Part’s “as if they were CRR rules” instruction determines the interpretive frame, while the CRR “read as if part of CRR” instruction determines which definitional source governs the words and expressions used. [#SRC:40535db1194b8610] [#TGT:ac036858232f3caf]", "pair_uid": "1d10c725ff93c556", "source_passage_uid": "40535db1194b8610", "target_passage_uid": "ac036858232f3caf", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769371978, "run_seed": 13, "debug_context": {"source_text": "To the extent that the rules in this Part are not CRR rules, rule 2.13 of the Interpretation Part shall apply to the rules as if they were CRR rules.", "target_text": "Unless the contrary intention appears, CRR rules and rules made under section 192XA FSMA shall be read as if they formed part of CRR , and accordingly words and expressions used in those rules shall bear the meaning they have in CRR (and not the meaning in the Glossary to the Rulebook)."}}
{"qa_uid": "32667586ce7b3bcc", "method": "DPEL", "persona": "basic", "question": "If a rule in this Part isn’t a CRR rule, do you still read it like it’s part of CRR, and when you see defined terms in it, do you use the CRR meaning or the Glossary to the Rulebook meaning?", "expected_answer": "Yes: even when a rule in this Part is not a CRR rule, the Part says rule 2.13 of the Interpretation Part applies to it as though it were a CRR rule, so you approach interpretation on that “treat it like CRR” basis. [#SRC:40535db1194b8610] Separately, the interpretive direction for CRR rules and rules made under section 192XA FSMA is that, unless the text clearly indicates otherwise, they are read as if they were part of CRR, and the words and expressions used in them take their meaning from CRR rather than from the Glossary to the Rulebook. [#TGT:ac036858232f3caf] Combining those two instructions, when you are working with a non‑CRR rule in this Part you should (i) apply the Interpretation Part rule that treats it as if it were a CRR rule, and (ii) interpret its terminology using CRR meanings, not Glossary meanings, unless a contrary intention appears in the text. [#SRC:40535db1194b8610] [#TGT:ac036858232f3caf] This is a single interpretive approach that depends on both passages: one tells you to treat the Part’s non‑CRR rules like CRR rules, and the other tells you what that implies for how terms are read and where their meanings come from. [#SRC:40535db1194b8610] [#TGT:ac036858232f3caf]", "pair_uid": "1d10c725ff93c556", "source_passage_uid": "40535db1194b8610", "target_passage_uid": "ac036858232f3caf", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769371978, "run_seed": 13, "debug_context": {"source_text": "To the extent that the rules in this Part are not CRR rules, rule 2.13 of the Interpretation Part shall apply to the rules as if they were CRR rules.", "target_text": "Unless the contrary intention appears, CRR rules and rules made under section 192XA FSMA shall be read as if they formed part of CRR , and accordingly words and expressions used in those rules shall bear the meaning they have in CRR (and not the meaning in the Glossary to the Rulebook)."}}
{"qa_uid": "e4beed7e5156cd8e", "method": "DPEL", "persona": "professional", "question": "How should a UK Solvency II firm, the Society or managing agents demonstrate that its risk-management system is “effective” and operates on a continuous basis, specifically in relation to liquidity risk appetite and limits?", "expected_answer": "A UK Solvency II firm, the Society or managing agents should treat liquidity risk as a concrete application of the broader requirement to run an effective risk-management system that continuously identifies, measures, monitors, manages and reports risks and their interdependencies at both individual and aggregated levels. [#TGT:9f2e6ec1c2bc29ca] In practice, this means the firm’s risk-management system should include approved risk tolerance limits that implement the insurer’s risk strategy and support control mechanisms, and liquidity risk should be addressed through a clearly defined liquidity risk appetite statement. [#SRC:6ed49c6d770ad510] Senior management should identify material sources of liquidity risk and set prudent risk limits for those sources, so that liquidity risk can be monitored and managed in a way that aligns with the system’s continuous measurement and reporting expectations. [#SRC:6ed49c6d770ad510] To evidence “effectiveness,” the liquidity appetite statement and related limits should be embedded within the system’s strategies, processes and reporting procedures, enabling ongoing monitoring and reporting of liquidity risk both on its own and in combination with other risks. [#TGT:9f2e6ec1c2bc29ca] This linkage between liquidity-specific appetite/limits and the system-wide continuous risk processes helps show that liquidity risk is not handled ad hoc but is integrated into the firm’s overall risk-management framework. [#SRC:6ed49c6d770ad510]", "pair_uid": "33ff5729e8ec9f1e", "source_passage_uid": "6ed49c6d770ad510", "target_passage_uid": "9f2e6ec1c2bc29ca", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769371989, "run_seed": 13, "debug_context": {"source_text": "Conditions Governing Business 3.1(1A)(c) requires UK Solvency II firms, the Society and managing agents to implement and maintain a risk management system that includes approved risk tolerance limits that implement an insurer’s risk strategy and facilitate control mechanisms. Consistent with this obligation, the PRA expects a UK Solvency II firm, the Society and managing agents to establish and maintain a clearly defined liquidity risk appetite statement and for senior management to identify material sources of liquidity risk for which prudent risk limits should be set. For non-Directive firms, Non-Solvency II Firms – Governance 7.3(2) requires an insurer to document its policies in relation to liquidity risk, including its appetite or tolerance for this risk.", "target_text": "(1) A firm must establish, implement, and maintain an effective risk-management system comprising strategies, processes and reporting procedures necessary to identify, measure, monitor, manage and report on a continuous basis the risks, at an individual and at an aggregated level, to which it is or could be exposed, and their interdependencies."}}
{"qa_uid": "eb76f7f42525ae39", "method": "DPEL", "persona": "basic", "question": "If a firm must run a risk-management system that continuously identifies, measures, monitors, manages and reports risks, what liquidity-risk documents or statements should it have, and who should set the key liquidity limits?", "expected_answer": "To align liquidity risk with a risk-management system that must operate continuously and cover risks at both individual and aggregated levels (including their interdependencies), the firm should make liquidity risk explicit within its strategies, processes and reporting procedures. [#TGT:9f2e6ec1c2bc29ca] For UK Solvency II firms, the Society and managing agents, this includes implementing and maintaining a risk management system with approved risk tolerance limits that implement the insurer’s risk strategy and support control mechanisms, and establishing a clearly defined liquidity risk appetite statement. [#SRC:6ed49c6d770ad510] Senior management should identify the material sources of liquidity risk and set prudent risk limits for those sources, so the firm can monitor and manage liquidity risk in a structured way rather than informally. [#SRC:6ed49c6d770ad510] For non-Directive firms, the liquidity-risk expectation is framed as documentation: the insurer should document its policies on liquidity risk, including its appetite or tolerance for that risk, so the liquidity approach can be incorporated into the system’s ongoing identification, measurement, monitoring and reporting cycle. [#SRC:6ed49c6d770ad510] Overall, the liquidity appetite/tolerance and limits should be positioned as part of the firm’s continuous risk-management system, not as standalone statements. [#TGT:9f2e6ec1c2bc29ca]", "pair_uid": "33ff5729e8ec9f1e", "source_passage_uid": "6ed49c6d770ad510", "target_passage_uid": "9f2e6ec1c2bc29ca", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769371989, "run_seed": 13, "debug_context": {"source_text": "Conditions Governing Business 3.1(1A)(c) requires UK Solvency II firms, the Society and managing agents to implement and maintain a risk management system that includes approved risk tolerance limits that implement an insurer’s risk strategy and facilitate control mechanisms. Consistent with this obligation, the PRA expects a UK Solvency II firm, the Society and managing agents to establish and maintain a clearly defined liquidity risk appetite statement and for senior management to identify material sources of liquidity risk for which prudent risk limits should be set. For non-Directive firms, Non-Solvency II Firms – Governance 7.3(2) requires an insurer to document its policies in relation to liquidity risk, including its appetite or tolerance for this risk.", "target_text": "(1) A firm must establish, implement, and maintain an effective risk-management system comprising strategies, processes and reporting procedures necessary to identify, measure, monitor, manage and report on a continuous basis the risks, at an individual and at an aggregated level, to which it is or could be exposed, and their interdependencies."}}
{"qa_uid": "aac11aad00e351cf", "method": "DPEL", "persona": "professional", "question": "For a significant 1 (PRA Category 1 or 2) Solvency II firm establishing and implementing the remuneration policy referred to in 2A.1(12), how should it use the supervisory statement’s guidance alongside the requirement to comply with all principles, and what must it do if it cannot meet or exceed the PRA’s expectations?", "expected_answer": "A significant 1 (PRA Category 1 or 2) Solvency II firm should treat the supervisory statement as guidance to help it comply with the requirements in Chapter 3A of the Conditions Governing Business Part of the PRA Rulebook while it establishes and implements the remuneration policy referred to in 2A.1(12), which must comply with all of the stated principles. [#SRC:a1be217c65884ad1] [#TGT:9c0a502a887dae03] The firm should also recognise that the supervisory statement itself does not create absolute requirements, because the binding requirements are contained in the directly applicable Solvency II Regulation that took effect on 1 January 2016. [#SRC:a1be217c65884ad1] In practice, this means the firm uses the statement to benchmark and shape its remuneration policies and practices against Chapter 3A while ensuring the policy implementation aligns with the principles applicable to the 2A.1(12) remuneration policy. [#SRC:a1be217c65884ad1] [#TGT:9c0a502a887dae03] If the firm is unable to meet or exceed the PRA’s expectations as described in the supervisory statement, it must notify its PRA supervisory contact. [#SRC:a1be217c65884ad1]", "pair_uid": "b47b023690038093", "source_passage_uid": "a1be217c65884ad1", "target_passage_uid": "9c0a502a887dae03", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372005, "run_seed": 13, "debug_context": {"source_text": "This SS provides guidance for significant 1 (PRA Category 1 and 2) Solvency II firms in complying with the requirements in Chapter 3A in the Conditions Governing Business Part of the PRA Rulebook. It may also be used as a guide for smaller firms when reviewing their remuneration policies and practices against Chapter 3A . This statement does not set absolute requirements as these are contained in the directly applicable Solvency II Regulation which came into force on 1 January 2016. Category 1 and 2 firms unable to meet or exceed the PRA’s expectations (as set out in this SS) should inform their PRA supervisory contact.", "target_text": "When establishing and implementing the remuneration policy referred to in 2A.1(12) , a firm must comply with all of the following principles:"}}
{"qa_uid": "ecb2b200f7a31790", "method": "DPEL", "persona": "basic", "question": "If a firm is setting up and using the remuneration policy mentioned in 2A.1(12), how do the “principles” it must follow fit with the PRA guidance for significant 1 (PRA Category 1 and 2) Solvency II firms, and what should a Category 1 or 2 firm do if it can’t meet the PRA’s expectations?", "expected_answer": "When a firm establishes and implements the remuneration policy referred to in 2A.1(12), it must follow all of the principles that apply to that policy, and a significant 1 (PRA Category 1 or 2) Solvency II firm can use the supervisory statement as guidance to help it comply with the Chapter 3A requirements in the Conditions Governing Business Part of the PRA Rulebook. [#TGT:9c0a502a887dae03] [#SRC:a1be217c65884ad1] The supervisory statement is positioned as a guide rather than a source of absolute requirements, because the binding requirements are in the directly applicable Solvency II Regulation that came into force on 1 January 2016. [#SRC:a1be217c65884ad1] So, the firm should implement its 2A.1(12) remuneration policy in a way that satisfies the principles, while using the statement to assess and shape its remuneration policies and practices against Chapter 3A. [#TGT:9c0a502a887dae03] [#SRC:a1be217c65884ad1] If a Category 1 or 2 firm cannot meet or exceed the PRA’s expectations described in the supervisory statement, it should inform its PRA supervisory contact. [#SRC:a1be217c65884ad1]", "pair_uid": "b47b023690038093", "source_passage_uid": "a1be217c65884ad1", "target_passage_uid": "9c0a502a887dae03", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372005, "run_seed": 13, "debug_context": {"source_text": "This SS provides guidance for significant 1 (PRA Category 1 and 2) Solvency II firms in complying with the requirements in Chapter 3A in the Conditions Governing Business Part of the PRA Rulebook. It may also be used as a guide for smaller firms when reviewing their remuneration policies and practices against Chapter 3A . This statement does not set absolute requirements as these are contained in the directly applicable Solvency II Regulation which came into force on 1 January 2016. Category 1 and 2 firms unable to meet or exceed the PRA’s expectations (as set out in this SS) should inform their PRA supervisory contact.", "target_text": "When establishing and implementing the remuneration policy referred to in 2A.1(12) , a firm must comply with all of the following principles:"}}
{"qa_uid": "6fb36406ba06417a", "method": "DPEL", "persona": "professional", "question": "When setting and evidencing an institution’s policies and procedures for deciding which positions are included in the trading book for capital requirement calculations, how must those policies incorporate the requirement that trading book positions be unrestricted in tradability or capable of being hedged, and what governance steps must the institution apply to demonstrate compliance?", "expected_answer": "An institution must embed, within its trading book position-allocation policies and procedures used for capital requirement calculations, a control that only permits inclusion of positions that are either not subject to tradability restrictions or can be hedged. [#TGT:a2326f65154f25e3] Those policies and procedures must be clearly defined and used to determine which positions are included in the trading book for the purpose of calculating capital requirements, and they must be designed in line with the referenced trading book framework and with regard to the institution’s risk management capabilities and practices. [#SRC:93f9d67ba5aa8c4d] To demonstrate compliance, the institution must fully document how it complies with its own policies and procedures, including how the tradability/hedgeability condition is applied in the determination process. [#SRC:93f9d67ba5aa8c4d] In addition, the institution must subject these policies and procedures to periodic internal audit, which should therefore cover whether positions included in the trading book meet the requirement of being free of tradability restrictions or able to be hedged. [#SRC:93f9d67ba5aa8c4d][#TGT:a2326f65154f25e3]", "pair_uid": "ebe0ee65253ea7fc", "source_passage_uid": "93f9d67ba5aa8c4d", "target_passage_uid": "a2326f65154f25e3", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372015, "run_seed": 13, "debug_context": {"source_text": "Institutions shall have in place clearly defined policies and procedures for determining which position to include in the trading book for the purposes of calculating their capital requirements, in accordance with the requirements set out in Article 102 and the definition of trading book in accordance with point (86) of Article 4(1), taking into account the institution's risk management capabilities and practices. The institution shall fully document its compliance with these policies and procedures and shall subject them to periodic internal audit.", "target_text": "Institutions shall ensure that positions in the trading book shall be either free of restrictions on their tradability or able to be hedged."}}
{"qa_uid": "f10c3493895b7208", "method": "DPEL", "persona": "basic", "question": "If an institution is deciding whether a position should go into the trading book for capital calculations, what does it need to check about tradability or hedging, and what paperwork and review does it need to keep for its trading book decision process?", "expected_answer": "For a position to be treated as a trading book position under the institution’s decision process for capital calculations, the institution must ensure the position is either not restricted in how it can be traded or, if there are constraints, that it can be hedged. [#TGT:a2326f65154f25e3] This check needs to be built into the institution’s clearly defined policies and procedures that determine which positions are included in the trading book for the purpose of calculating capital requirements, and those policies must be set with regard to the institution’s risk management capabilities and practices. [#SRC:93f9d67ba5aa8c4d] The institution must also fully document that it is following its policies and procedures—meaning it should keep records showing how the tradability/hedgeability requirement was applied when deciding to include a position in the trading book. [#SRC:93f9d67ba5aa8c4d][#TGT:a2326f65154f25e3] Finally, the institution must arrange for periodic internal audit of these policies and procedures, which should include reviewing whether trading book positions meet the tradability-or-hedgeability condition. [#SRC:93f9d67ba5aa8c4d][#TGT:a2326f65154f25e3]", "pair_uid": "ebe0ee65253ea7fc", "source_passage_uid": "93f9d67ba5aa8c4d", "target_passage_uid": "a2326f65154f25e3", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372015, "run_seed": 13, "debug_context": {"source_text": "Institutions shall have in place clearly defined policies and procedures for determining which position to include in the trading book for the purposes of calculating their capital requirements, in accordance with the requirements set out in Article 102 and the definition of trading book in accordance with point (86) of Article 4(1), taking into account the institution's risk management capabilities and practices. The institution shall fully document its compliance with these policies and procedures and shall subject them to periodic internal audit.", "target_text": "Institutions shall ensure that positions in the trading book shall be either free of restrictions on their tradability or able to be hedged."}}
{"qa_uid": "73aa20ca52ff6d38", "method": "DPEL", "persona": "professional", "question": "If an institution is required to calculate a single exposure value at netting set level in accordance with Section 3, but it has previously ceased calculating exposure values of its derivative positions under Section 4 or 5, when may it resume using Section 4 or 5 and what must it show to the competent authority?", "expected_answer": "An institution that is otherwise expected to calculate a single exposure value at netting set level under Section 3 may only switch back to calculating the exposure value of its derivative positions under Section 4 or 5 after meeting a specific re-entry condition tied to supervisory demonstration. [#TGT:b16c73e93c0f2966] The precondition is that the institution has ceased to calculate exposure values of its derivative positions in accordance with Section 4 or 5 (as applicable), and it now seeks to resume those Section 4 or 5 calculations rather than continuing solely with the Section 3 netting-set exposure value approach. [#SRC:c5ef344684d38393] To resume Section 4 or 5, the institution must demonstrate to the competent authority that all conditions in Article 273a(1) or Article 273a(2) (as relevant) have been satisfied continuously for an uninterrupted period of one year. [#SRC:c5ef344684d38393] In practical terms, the institution’s ability to move away from the Section 3 single exposure value at netting set level and back to Section 4 or 5 is contingent on that one-year uninterrupted compliance demonstration to the competent authority. [#SRC:c5ef344684d38393][#TGT:b16c73e93c0f2966]", "pair_uid": "4b66bfe901b9fe43", "source_passage_uid": "c5ef344684d38393", "target_passage_uid": "b16c73e93c0f2966", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372029, "run_seed": 13, "debug_context": {"source_text": "Where an institution has ceased to calculate the exposure values of its derivative positions in accordance with Section 4 or 5 , as applicable, it shall only be permitted to resume calculating the exposure value of its derivative positions as set out in Section 4 or 5 where it demonstrates to the competent authority that all the conditions set out in Article 273a(1) or (2) have been met for an uninterrupted period of one year.", "target_text": "Institutions shall calculate a single exposure value at netting set level in accordance with Section 3 , subject to paragraph 2 of this Article."}}
{"qa_uid": "9e68cfd93af1fd28", "method": "DPEL", "persona": "basic", "question": "An institution normally calculates one exposure value for each netting set under Section 3. If it stopped using Section 4 or 5 for derivative exposure values, what has to happen before it can start using Section 4 or 5 again?", "expected_answer": "Even though institutions are to calculate a single exposure value at netting set level in line with Section 3, an institution that previously stopped calculating derivative exposure values under Section 4 or 5 cannot simply restart those Section 4 or 5 calculations whenever it wants. [#TGT:b16c73e93c0f2966] The rule for restarting is triggered specifically when the institution has ceased to calculate the exposure values of its derivative positions in accordance with Section 4 or 5 (whichever applied to it). [#SRC:c5ef344684d38393] Before it is permitted to resume calculating those derivative exposure values as set out in Section 4 or 5, it must demonstrate to the competent authority that all conditions in Article 273a(1) or Article 273a(2) have been met continuously for one uninterrupted year. [#SRC:c5ef344684d38393] This means the institution’s return to Section 4 or 5 sits alongside the baseline expectation of a Section 3 single exposure value at netting set level, but is only allowed after the one-year uninterrupted-conditions demonstration to the competent authority. [#SRC:c5ef344684d38393][#TGT:b16c73e93c0f2966]", "pair_uid": "4b66bfe901b9fe43", "source_passage_uid": "c5ef344684d38393", "target_passage_uid": "b16c73e93c0f2966", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372029, "run_seed": 13, "debug_context": {"source_text": "Where an institution has ceased to calculate the exposure values of its derivative positions in accordance with Section 4 or 5 , as applicable, it shall only be permitted to resume calculating the exposure value of its derivative positions as set out in Section 4 or 5 where it demonstrates to the competent authority that all the conditions set out in Article 273a(1) or (2) have been met for an uninterrupted period of one year.", "target_text": "Institutions shall calculate a single exposure value at netting set level in accordance with Section 3 , subject to paragraph 2 of this Article."}}
{"qa_uid": "8fc8da23008c4b91", "method": "DPEL", "persona": "professional", "question": "When the PRA assesses whether a home state supervisor is sufficiently equivalent for the PRA’s authorisation and supervision purposes (distinct from any equivalence determinations HM Treasury may make), what factors must the PRA evaluate and what aspect does it treat as particularly important?", "expected_answer": "For the PRA’s own authorisation and supervision functions, the PRA makes an overall, outcomes-focused judgement on whether the home state supervisor is sufficiently equivalent and whether that supervisor’s regime aligns with the UK regulatory framework in delivering outcomes that support the PRA’s objectives, while treating this assessment as separate from any equivalence determinations HM Treasury may make for other purposes. [#SRC:8e5451c44f63e11a] [#TGT:b4c97c646d738581] In forming that overall view, the PRA considers the relevant factors together rather than in isolation, and it gives considerable weight to the extent and quality of co-operation with the home state supervisor. [#SRC:8e5451c44f63e11a] The PRA also takes into account how individual firms (including branches) are supervised as well as how the consolidated group is supervised, and it considers the nature and scale of the firm’s activities in the UK as part of the equivalence assessment. [#SRC:8e5451c44f63e11a] Although the PRA may provide advice to HM Treasury under Regulation 4 of The Equivalence Determinations for Financial Services and Miscellaneous Provisions (Amendment etc.) (EU Exit) Regulations 2019 (SI 2019/541), that advisory role does not change that the PRA’s equivalence assessment here is for its own authorisation and supervision purposes. [#TGT:b4c97c646d738581]", "pair_uid": "e9c7fd0415677b06", "source_passage_uid": "8e5451c44f63e11a", "target_passage_uid": "b4c97c646d738581", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372039, "run_seed": 13, "debug_context": {"source_text": "The PRA will make an overall assessment of whether the home state supervisor is sufficiently equivalent, and whether its regime is consistent with the UK regulatory framework in delivering appropriate outcomes that meet the PRA’s objectives. 9 The PRA assesses these factors in their totality, but will place considerable weight on assessing the extent and quality of co-operation with the home state supervisor. The PRA will take into account the supervision of individual firms (including branches) and their consolidated group, and it will consider the nature and scale of a firm’s activities in the UK.", "target_text": "9. The PRA’s assessment of equivalence is based on the outcomes achieved and is for the purposes of authorisation and supervision by the PRA, which is separate from advice the PRA may provide to HM Treasury where HM Treasury may make determinations of equivalence for other purposes. The PRA may give advice to HM Treasury pursuant to Regulation 4 of The Equivalence Determinations for Financial Services and Miscellaneous Provisions (Amendment etc.) (EU Exit) Regulations 2019 (SI 2019/541)."}}
{"qa_uid": "254670797c435fc5", "method": "DPEL", "persona": "basic", "question": "If the PRA is checking whether a home state supervisor is “equivalent” for the PRA’s own authorisation and supervision (not for HM Treasury’s separate equivalence decisions), what does the PRA look at, and what does it put the most weight on?", "expected_answer": "In the PRA’s equivalence assessment for its own authorisation and supervision, the PRA looks at whether the home state supervisor is sufficiently equivalent and whether its regime fits with the UK regulatory framework in producing outcomes that meet the PRA’s objectives, and it treats this as separate from any equivalence determinations HM Treasury may make for other purposes. [#SRC:8e5451c44f63e11a] [#TGT:b4c97c646d738581] The PRA evaluates the relevant factors as a whole, but it places considerable weight on how strong and effective co-operation is with the home state supervisor. [#SRC:8e5451c44f63e11a] It also considers supervision at both levels—individual firms (including branches) and the consolidated group—and it factors in the nature and scale of the firm’s UK activities when reaching its overall view. [#SRC:8e5451c44f63e11a] Separately, the PRA may provide advice to HM Treasury under Regulation 4 of the 2019 EU Exit equivalence regulations, but that advisory function is distinct from the PRA’s own outcomes-based equivalence assessment for authorisation and supervision. [#TGT:b4c97c646d738581]", "pair_uid": "e9c7fd0415677b06", "source_passage_uid": "8e5451c44f63e11a", "target_passage_uid": "b4c97c646d738581", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372039, "run_seed": 13, "debug_context": {"source_text": "The PRA will make an overall assessment of whether the home state supervisor is sufficiently equivalent, and whether its regime is consistent with the UK regulatory framework in delivering appropriate outcomes that meet the PRA’s objectives. 9 The PRA assesses these factors in their totality, but will place considerable weight on assessing the extent and quality of co-operation with the home state supervisor. The PRA will take into account the supervision of individual firms (including branches) and their consolidated group, and it will consider the nature and scale of a firm’s activities in the UK.", "target_text": "9. The PRA’s assessment of equivalence is based on the outcomes achieved and is for the purposes of authorisation and supervision by the PRA, which is separate from advice the PRA may provide to HM Treasury where HM Treasury may make determinations of equivalence for other purposes. The PRA may give advice to HM Treasury pursuant to Regulation 4 of The Equivalence Determinations for Financial Services and Miscellaneous Provisions (Amendment etc.) (EU Exit) Regulations 2019 (SI 2019/541)."}}
{"qa_uid": "d3176afdca24e1aa", "method": "DPEL", "persona": "professional", "question": "For a credit union with more than £50 million in total assets that also undertakes more complex lending or invests in more complex investment products, how should it use scenario analysis to support proportionate risk management, and what escalation in PRA engagement should it anticipate if there is evidence of poor risk management/governance and it does not engage or make meaningful progress on mitigation plans?", "expected_answer": "A credit union in this profile should treat scenario analysis as a core tool within proportionate risk management, and it should also plan for progressively deeper PRA engagement if risk management or governance is found to be weak and remediation does not progress. [#TGT:b3afbbf8d96609e4] For credit unions with more than £50 million in total assets and/or those undertaking more complex lending (including mortgages or lending to corporates) and/or investing in more complex products (including supranational bonds, corporate bonds, bank bonds, and money market funds), the PRA expects greater engagement and expects them to run scenario analysis to assess how key strategic initiatives and external risks could affect the business. [#SRC:865973d64c7565e2] Scenario analysis can include stresses such as poorer loan book performance, higher arrears, changes to welfare benefits, changes in bank interest rates, or a greater-than-expected increase in shares, and it is presented as good practice to consider combined scenarios. [#SRC:865973d64c7565e2] If there is evidence of poor risk management and/or governance, the credit union should expect the PRA to engage on its mitigation plans; if it then fails to engage or make meaningful progress, it should expect fuller PRA engagement focused on viability and, where viability is lacking, on orderly closure planning (insolvent wind-up, solvent wind-down, or transfer of engagements to another credit union). [#TGT:b3afbbf8d96609e4]", "pair_uid": "3ed584e137f90505", "source_passage_uid": "865973d64c7565e2", "target_passage_uid": "b3afbbf8d96609e4", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372051, "run_seed": 13, "debug_context": {"source_text": "In addition to the expectations set out in Chapters 9 and 11 , credit unions with more than £50 million in total assets and/or credit unions that carry out more complex lending (such as providing mortgages or lending to corporates), and/or credit unions that invest in more complex investment products (supranational bonds, corporate bonds, bank bonds, and money market funds) should expect to engage more with the PRA. The PRA expects these credit unions to undertake scenario analysis to identify the impact of key strategic initiatives and external risks on their businesses. Examples of scenarios a credit union may use include: poorer than expected loan book performance; greater than expected increase in shares, higher than expected arrears, changes to welfare benefits, changes in bank interest rates etc. The PRA considers it good practice to look at combined scenarios.", "target_text": "Credit unions should have proportionate risk management systems, adequate for the needs of their business. Where there is evidence of poor risk management and/or governance at a credit union, the credit union should expect the PRA to engage with it on its mitigation plans. Where the credit union fails to engage or make meaningful progress, it should expect the PRA to engage more fully on whether it has a viable future and, if not, what plans it has to close in an orderly fashion. This could be by way of insolvent wind-up, solvent wind-down, or the transfer of its engagements to another credit union."}}
{"qa_uid": "1e4763f15724755c", "method": "DPEL", "persona": "basic", "question": "If a credit union is big (over £50 million in total assets) or does more complex lending/investing, what kinds of scenarios should it test, and how does that connect to what the PRA may do if the credit union’s risk management or governance is poor and it doesn’t improve its mitigation plans?", "expected_answer": "A credit union that is larger or more complex should use scenario testing to understand how shocks could affect it, and it should be aware that weak risk management can trigger escalating PRA involvement if fixes do not progress. [#TGT:b3afbbf8d96609e4] For credit unions with more than £50 million in total assets and/or those doing more complex lending (such as mortgages or lending to corporates) and/or investing in more complex products (such as supranational bonds, corporate bonds, bank bonds, and money market funds), the PRA expects them to engage more and expects them to carry out scenario analysis covering the impact of key strategic initiatives and external risks. [#SRC:865973d64c7565e2] The scenarios can include worse-than-expected loan book performance, a bigger-than-expected increase in shares, higher arrears, changes to welfare benefits, and changes in bank interest rates, and it is described as good practice to test combined scenarios rather than only single-factor events. [#SRC:865973d64c7565e2] Separately, credit unions are expected to have risk management systems that are proportionate and adequate for their business; where there is evidence of poor risk management and/or governance, the PRA may engage on mitigation plans, and if the credit union does not engage or make meaningful progress, the PRA may move to fuller engagement about whether the credit union has a viable future and, if not, how it would close in an orderly way (insolvent wind-up, solvent wind-down, or transfer of engagements). [#TGT:b3afbbf8d96609e4]", "pair_uid": "3ed584e137f90505", "source_passage_uid": "865973d64c7565e2", "target_passage_uid": "b3afbbf8d96609e4", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372051, "run_seed": 13, "debug_context": {"source_text": "In addition to the expectations set out in Chapters 9 and 11 , credit unions with more than £50 million in total assets and/or credit unions that carry out more complex lending (such as providing mortgages or lending to corporates), and/or credit unions that invest in more complex investment products (supranational bonds, corporate bonds, bank bonds, and money market funds) should expect to engage more with the PRA. The PRA expects these credit unions to undertake scenario analysis to identify the impact of key strategic initiatives and external risks on their businesses. Examples of scenarios a credit union may use include: poorer than expected loan book performance; greater than expected increase in shares, higher than expected arrears, changes to welfare benefits, changes in bank interest rates etc. The PRA considers it good practice to look at combined scenarios.", "target_text": "Credit unions should have proportionate risk management systems, adequate for the needs of their business. Where there is evidence of poor risk management and/or governance at a credit union, the credit union should expect the PRA to engage with it on its mitigation plans. Where the credit union fails to engage or make meaningful progress, it should expect the PRA to engage more fully on whether it has a viable future and, if not, what plans it has to close in an orderly fashion. This could be by way of insolvent wind-up, solvent wind-down, or the transfer of its engagements to another credit union."}}
{"qa_uid": "05971e2815dc85b7", "method": "DPEL", "persona": "professional", "question": "For a firm whose general insurance business includes both (i) health insurance based on actuarial principles and (ii) other general insurance business, how should the firm apply the calculation rules so that the correct percentage substitution is used for the health insurance element, and what separate outputs must be produced for each part?", "expected_answer": "A firm with mixed general insurance business must run the relevant calculation provisions separately for each part of its business, and then apply the health-insurance-specific percentage modification only to the health insurance part where it is permitted. [#SRC:da680341ca9e8782] Specifically, where 8.6 applies to such a firm, the rules in 8.2 through 8.6 are required to operate independently for (i) the health insurance based on actuarial principles and (ii) the other general insurance business, so that the firm ends up with a distinct sum under 8.6 for the health insurance part and a distinct sum under 8.5 for the other business. [#SRC:da680341ca9e8782] For the health insurance part (and only that part), 8.5 is applied using a different percentage—8.66% instead of 26%—but only if the conditions in 7.5(1) to (5) are satisfied. [#TGT:19c9e8d0b9a70534] The practical result is that the firm must (a) calculate the health insurance component on its own track and, when eligible, use the substituted 8.66% rate within the 8.5 application for that component, and (b) calculate the non-health component separately and produce the sum under 8.5 for that other business without that health-insurance substitution. [#SRC:da680341ca9e8782] [#TGT:19c9e8d0b9a70534]", "pair_uid": "44a1d2cb0d92b4c5", "source_passage_uid": "da680341ca9e8782", "target_passage_uid": "19c9e8d0b9a70534", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372064, "run_seed": 13, "debug_context": {"source_text": "Where 8.6 applies to a firm whose general insurance business consists partly of health insurance based on actuarial principles and partly of other business, 8.2 to 8.6 must operate separately for each part of the general insurance business , so as to produce a sum under 8.6 for the health insurance and a sum under 8.5 for the other business.", "target_text": "In the case of general insurance business consisting of health insurance based on actuarial principles, 8.5 applies with the substitution of 8.66% for 26% if the conditions in 7.5 (1) to (5) are satisfied."}}
{"qa_uid": "d4b2e005a6aa6357", "method": "DPEL", "persona": "basic", "question": "If a firm sells both health insurance based on actuarial principles and other general insurance, do they have to do the calculations separately, and when can they use 8.66% instead of 26%?", "expected_answer": "Yes—when the firm’s general insurance business is split between health insurance based on actuarial principles and other business, the calculation rules must be run separately for each part so the outputs are kept distinct. [#SRC:da680341ca9e8782] In that situation, 8.2 to 8.6 are applied independently to each part, producing a sum under 8.6 for the health insurance part and a separate sum under 8.5 for the other business part. [#SRC:da680341ca9e8782] For the health insurance part specifically, there is a special adjustment to how 8.5 is applied: the percentage used is changed from 26% to 8.66%, but only where the conditions in 7.5(1) to (5) are met. [#TGT:19c9e8d0b9a70534] Putting these together, the firm should (1) isolate the health insurance calculations from the other business calculations, (2) apply the 8.66% substitution only within the health insurance track and only if the stated 7.5 conditions are satisfied, and (3) still produce the separate sums required for each part (8.6 for health insurance and 8.5 for other business). [#SRC:da680341ca9e8782] [#TGT:19c9e8d0b9a70534]", "pair_uid": "44a1d2cb0d92b4c5", "source_passage_uid": "da680341ca9e8782", "target_passage_uid": "19c9e8d0b9a70534", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372064, "run_seed": 13, "debug_context": {"source_text": "Where 8.6 applies to a firm whose general insurance business consists partly of health insurance based on actuarial principles and partly of other business, 8.2 to 8.6 must operate separately for each part of the general insurance business , so as to produce a sum under 8.6 for the health insurance and a sum under 8.5 for the other business.", "target_text": "In the case of general insurance business consisting of health insurance based on actuarial principles, 8.5 applies with the substitution of 8.66% for 26% if the conditions in 7.5 (1) to (5) are satisfied."}}
{"qa_uid": "9f305def52bf28ea", "method": "DPEL", "persona": "professional", "question": "When determining S i and S j for sub-modules within a module, how should an insurer decide whether the capital requirement is generated directly by the standard formula or calculated under 16F.3, and how does that decision affect the requirement to use the 16F.1 formula for sub-modules referenced in 16F.2(8)(b)?", "expected_answer": "S i and S j are the capital requirements for sub-modules i and j within a particular module, and the method used depends on whether the relevant sub-module is itself composed of other sub-modules. [#SRC:783eb897186947a6] If a sub-module does not consist of other sub-modules, its capital requirement is generated by the standard formula (i.e., produced directly by that formula rather than via a further aggregation step). [#SRC:783eb897186947a6] If, instead, the sub-module consists of other sub-modules, its capital requirement is calculated in accordance with 16F.3. [#SRC:783eb897186947a6] For the category of sub-modules that fall under 16F.2(8)(b)—i.e., those sub-modules whose capital requirement is determined via the 16F.3 route because they consist of other sub-modules—the capital requirement for that particular sub-module must be generated using the formula set out in 16F.1, applying the stated specifications. [#TGT:d0f5710ab3cb3488] In practice, this means the structural test in 16F.2(8) (whether the sub-module contains other sub-modules) determines whether the 16F.1 formula requirement is triggered for that sub-module under the 16F.2(8)(b) pathway. [#SRC:783eb897186947a6][#TGT:d0f5710ab3cb3488]", "pair_uid": "df04395ac0e8ab89", "source_passage_uid": "783eb897186947a6", "target_passage_uid": "d0f5710ab3cb3488", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372075, "run_seed": 13, "debug_context": {"source_text": "(8) S i and S j denote the capital requirement for sub-modules i and j of that particular module, respectively, which are calculated in the following way: (a) the sub-module is generated by the standard formula provided that the sub-module does not consist of other sub-modules; and (b) the sub-module is calculated in accordance with 16F.3 provided that the sub-module consists of other sub-modules;", "target_text": "For all sub-modules of the standard formula referred to in 16F.2(8)(b) , the capital requirement of a particular sub-module must be generated by the formula set out in 16F.1 , applying the following specifications:"}}
{"qa_uid": "5ec25868b7089b08", "method": "DPEL", "persona": "basic", "question": "If a sub-module is made up of other sub-modules, what method is used to calculate its capital requirement, and what extra rule applies to those sub-modules mentioned in 16F.2(8)(b) about using the 16F.1 formula?", "expected_answer": "Where a sub-module consists of other sub-modules, its capital requirement is not generated directly as a stand-alone standard-formula sub-module; instead, it is calculated in accordance with 16F.3. [#SRC:783eb897186947a6] This is the situation described in 16F.2(8)(b), which distinguishes composite sub-modules from sub-modules that do not contain other sub-modules. [#SRC:783eb897186947a6] For all sub-modules of the standard formula that are referred to in 16F.2(8)(b), there is an additional requirement about how the capital requirement must be produced: the capital requirement of the particular sub-module must be generated by the formula set out in 16F.1, and it must be done using the specifications that follow that instruction. [#TGT:d0f5710ab3cb3488] Put together, you first identify that the sub-module is composite (so it falls under the 16F.3 calculation route), and then, because it is one of the sub-modules referenced in 16F.2(8)(b), you ensure the capital requirement is generated using the 16F.1 formula with the stated specifications. [#SRC:783eb897186947a6][#TGT:d0f5710ab3cb3488]", "pair_uid": "df04395ac0e8ab89", "source_passage_uid": "783eb897186947a6", "target_passage_uid": "d0f5710ab3cb3488", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372075, "run_seed": 13, "debug_context": {"source_text": "(8) S i and S j denote the capital requirement for sub-modules i and j of that particular module, respectively, which are calculated in the following way: (a) the sub-module is generated by the standard formula provided that the sub-module does not consist of other sub-modules; and (b) the sub-module is calculated in accordance with 16F.3 provided that the sub-module consists of other sub-modules;", "target_text": "For all sub-modules of the standard formula referred to in 16F.2(8)(b) , the capital requirement of a particular sub-module must be generated by the formula set out in 16F.1 , applying the following specifications:"}}
{"qa_uid": "e9ff12bdf9b28f31", "method": "DPEL", "persona": "professional", "question": "For purposes of determining whether Articles 30–32 of MODR and Conditions Governing Business 7 apply to an arrangement, how should a firm distinguish between (i) an arrangement that is “outsourcing” under the PRA Rulebook definition (including sub-outsourcing and the “otherwise undertaken by the firm itself” test) and (ii) a non-outsourcing “third party” relationship as defined in the SS, and what role does the “recurrent or ongoing basis” consideration play in that classification?", "expected_answer": "Articles 30–32 of MODR and Conditions Governing Business 7 apply only where the arrangement meets the applicable definition of “outsourcing”; arrangements that fall outside that definition are not captured by those requirements even if they involve a third party. [#SRC:ae60277c11940928] To classify an arrangement as outsourcing, the firm should assess whether it is an arrangement (of any form) under which a service provider performs a process, service, or activity—directly or via sub-outsourcing—that the firm would otherwise carry out itself. [#TGT:b7ac6dbd1a20206b] In parallel, the SS frames “third party” more broadly as any organisation that has a business relationship or contract with the firm to provide a product or service, which can include relationships that are not outsourcing. [#SRC:ae60277c11940928] When deciding whether a third-party arrangement is within the outsourcing definition (and therefore within scope of the MODR/PRA Rulebook outsourcing requirements), the firm should also consider whether the third party will perform the relevant function or service (or part of it) on a recurrent or ongoing basis, consistent with the EBA Outsourcing GL approach described. [#TGT:b7ac6dbd1a20206b] Accordingly, the firm should (i) identify the counterparty as a “third party” under the SS where there is a contract/business relationship for a product or service, and then (ii) apply the PRA Rulebook outsourcing tests (including “otherwise undertaken by the firm itself,” sub-outsourcing, and recurrence/ongoing performance) to determine whether the outsourcing-specific requirements apply. [#SRC:ae60277c11940928] [#TGT:b7ac6dbd1a20206b]", "pair_uid": "dfdc287b585a547d", "source_passage_uid": "ae60277c11940928", "target_passage_uid": "b7ac6dbd1a20206b", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372091, "run_seed": 13, "debug_context": {"source_text": "Existing requirements on outsourcing, including Articles 30–32 of MODR and Conditions Governing Business 7 in the PRA Rulebook, only apply to ‘outsourcing’ as defined in paragraph 2.1 . They do not apply to other arrangements between firms and third parties which fall outside the definition of outsourcing. In line with the definition in the G7 Third Party Elements and EBA ICT GL, this SS defines a ‘third party’ as ‘an organisation that has entered into a business relationship or contract with a firm to provide a product or service’.", "target_text": "The PRA Rulebook defines ‘outsourcing’ as ‘an arrangement of any form between a firm and a service provider, whether a supervised entity or not, by which that service provider performs a process, a service or an activity, whether directly or by sub-outsourcing, which would otherwise be undertaken by the firm itself’. This definition derives from Article 2(3) of MODR (Commission Delegated Regulation on organisational requirements and operating conditions). In line with the EBA Outsourcing GL, when considering whether an arrangement with a third party falls within the definition of outsourcing, firms should consider whether the third party will perform the relevant function or service (or part thereof) on a recurrent or an ongoing basis."}}
{"qa_uid": "ae3a86371d734517", "method": "DPEL", "persona": "basic", "question": "If a firm has a contract with an organisation to provide a product or service, how can it tell whether this is just a “third party” relationship or whether it counts as “outsourcing” that brings in Articles 30–32 of MODR and Conditions Governing Business 7, especially if the work is done repeatedly or on an ongoing basis (including through sub-outsourcing)?", "expected_answer": "A contract for a product or service makes the counterparty a “third party” under the SS, but that label alone does not mean the arrangement is “outsourcing” for regulatory scope. [#SRC:ae60277c11940928] The outsourcing-specific requirements in Articles 30–32 of MODR and Conditions Governing Business 7 apply only to arrangements that meet the outsourcing definition referenced in the SS, and they do not extend to other third-party arrangements outside that definition. [#SRC:ae60277c11940928] To decide if the third-party relationship is outsourcing, the firm should check whether the arrangement is one where a service provider performs a process, service, or activity that the firm would otherwise do itself, and this can be performed either directly or through sub-outsourcing. [#TGT:b7ac6dbd1a20206b] The firm should also factor in whether the third party will carry out the relevant function or service (or part of it) on a recurrent or ongoing basis, because that consideration is used when assessing whether the arrangement falls within the outsourcing definition. [#TGT:b7ac6dbd1a20206b] Putting these together, the firm should first recognise the existence of a third-party contract, then apply the “otherwise undertaken by the firm itself” and sub-outsourcing elements, and finally use the recurrent/ongoing performance indicator to support the classification decision that determines whether the outsourcing requirements apply. [#SRC:ae60277c11940928] [#TGT:b7ac6dbd1a20206b]", "pair_uid": "dfdc287b585a547d", "source_passage_uid": "ae60277c11940928", "target_passage_uid": "b7ac6dbd1a20206b", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372091, "run_seed": 13, "debug_context": {"source_text": "Existing requirements on outsourcing, including Articles 30–32 of MODR and Conditions Governing Business 7 in the PRA Rulebook, only apply to ‘outsourcing’ as defined in paragraph 2.1 . They do not apply to other arrangements between firms and third parties which fall outside the definition of outsourcing. In line with the definition in the G7 Third Party Elements and EBA ICT GL, this SS defines a ‘third party’ as ‘an organisation that has entered into a business relationship or contract with a firm to provide a product or service’.", "target_text": "The PRA Rulebook defines ‘outsourcing’ as ‘an arrangement of any form between a firm and a service provider, whether a supervised entity or not, by which that service provider performs a process, a service or an activity, whether directly or by sub-outsourcing, which would otherwise be undertaken by the firm itself’. This definition derives from Article 2(3) of MODR (Commission Delegated Regulation on organisational requirements and operating conditions). In line with the EBA Outsourcing GL, when considering whether an arrangement with a third party falls within the definition of outsourcing, firms should consider whether the third party will perform the relevant function or service (or part thereof) on a recurrent or an ongoing basis."}}
{"qa_uid": "0b9d75ebed86bb17", "method": "DPEL", "persona": "professional", "question": "When calculating the basic SCR, under what conditions may a firm recognise a guarantee and, if the exposure is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1, how must that exposure be treated for the purposes of 3D31.3(1)?", "expected_answer": "A firm may recognise a guarantee in the calculation of the basic SCR only if the Chapter explicitly allows recognition of that type of guarantee and the guarantee also satisfies the qualitative criteria referenced in 3G2 and 3G3, together with the additional criteria that the Chapter requires to be met. [#TGT:9d80cba8634278ab] Where the guarantee being relied on is one that is fully, unconditionally and irrevocably provided by a body listed in 3D1, and the guarantee meets the requirements set out in 3G9, the firm must treat the resulting exposure as an exposure to the central government for the purposes of 3D31.3(1). [#SRC:701ce6aa38be752a] In practice, this means the firm needs both (i) a basis in the Chapter to recognise the guarantee for basic SCR purposes and (ii) confirmation that the guarantee meets the relevant qualitative and other criteria, while separately applying the specific treatment rule that reclassifies the exposure to central government when the 3D1/3G9 conditions are satisfied. [#TGT:9d80cba8634278ab] [#SRC:701ce6aa38be752a]", "pair_uid": "9f4064a21340b184", "source_passage_uid": "701ce6aa38be752a", "target_passage_uid": "9d80cba8634278ab", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372102, "run_seed": 13, "debug_context": {"source_text": "For the purposes of 3D31.3(1) , a firm must treat exposures that are fully, unconditionally and irrevocably guaranteed by bodies listed in 3D1 , where the guarantee meets the requirements set out in 3G9 , as exposures to the central government.", "target_text": "In the calculation of the basic SCR , a firm must only recognise guarantees where explicitly referred to in this Chapter, and where in addition to the qualitative criteria in 3G2 and 3G3 , all of the following criteria are met:"}}
{"qa_uid": "0a2b67ce8c99eb9f", "method": "DPEL", "persona": "basic", "question": "If a firm is working out the basic SCR, when is it allowed to count a guarantee, and what does it do with an exposure that is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1 (assuming the guarantee meets 3G9)?", "expected_answer": "For basic SCR purposes, a firm is allowed to recognise a guarantee only when this Chapter explicitly says that guarantees can be recognised, and only if the guarantee meets the qualitative criteria in 3G2 and 3G3 as well as the other criteria required by the Chapter. [#TGT:9d80cba8634278ab] Separately, for the purposes of 3D31.3(1), if the exposure is fully, unconditionally and irrevocably guaranteed by a body listed in 3D1 and the guarantee meets the requirements in 3G9, the firm must treat that exposure as an exposure to the central government. [#SRC:701ce6aa38be752a] Put together, the firm needs to (1) check that the Chapter actually permits recognising the guarantee in the basic SCR calculation and that the qualitative and other criteria are met, and (2) apply the specific classification outcome for exposures that meet the 3D1 and 3G9 guarantee conditions by treating them as central government exposures for 3D31.3(1). [#TGT:9d80cba8634278ab] [#SRC:701ce6aa38be752a]", "pair_uid": "9f4064a21340b184", "source_passage_uid": "701ce6aa38be752a", "target_passage_uid": "9d80cba8634278ab", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372102, "run_seed": 13, "debug_context": {"source_text": "For the purposes of 3D31.3(1) , a firm must treat exposures that are fully, unconditionally and irrevocably guaranteed by bodies listed in 3D1 , where the guarantee meets the requirements set out in 3G9 , as exposures to the central government.", "target_text": "In the calculation of the basic SCR , a firm must only recognise guarantees where explicitly referred to in this Chapter, and where in addition to the qualitative criteria in 3G2 and 3G3 , all of the following criteria are met:"}}
{"qa_uid": "4bb7b4067be08563", "method": "DPEL", "persona": "professional", "question": "For a Conduct Rules non-executive director, how does the requirement to comply at all times with the conduct standards specified in 3.1 to 3.3, 3.7 and 3.8 interact with Senior Manager Conduct Standard 4 on disclosing information the FCA or the PRA would reasonably expect to have notice of, and what does this mean in practice for ongoing disclosure expectations?", "expected_answer": "A Conduct Rules non-executive director is required to comply continuously with the specified conduct standards (3.1 to 3.3, 3.7 and 3.8), meaning the obligation is ongoing rather than event-driven. [#SRC:4b7d02b366371a2f] In practice, that continuous compliance framework must be applied in a way that includes meeting the disclosure expectation described in Senior Manager Conduct Standard 4, namely that the individual discloses appropriately any information that the FCA or the PRA would reasonably expect to be told. [#TGT:1ac71628712a0761] Taken together, this means the director should treat disclosure as part of their day-to-day conduct posture: when they become aware of information that would reasonably be expected to be notified to the FCA or the PRA, they should ensure it is disclosed in an appropriate manner, and they should do so on an ongoing basis consistent with the “at all times” nature of their conduct standards compliance. [#SRC:4b7d02b366371a2f] The key practical implication is that the disclosure duty is not limited to periodic reporting; it is aligned with continuous adherence to the applicable conduct standards and is triggered by the reasonable expectations of the FCA or the PRA regarding notice of the information. [#TGT:1ac71628712a0761]", "pair_uid": "f8006dad82c77ed0", "source_passage_uid": "4b7d02b366371a2f", "target_passage_uid": "1ac71628712a0761", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372938, "run_seed": 13, "debug_context": {"source_text": "If you are a Conduct Rules non-executive director , you must comply at all times with the conduct standards specified in 3.1 to 3.3 , 3.7 and 3.8 .", "target_text": "Senior Manager Conduct Standard 4: You must disclose appropriately any information of which the FCA or the PRA would reasonably expect to have notice."}}
{"qa_uid": "12413a32be23e7b5", "method": "DPEL", "persona": "basic", "question": "If you are a Conduct Rules non-executive director, what do you need to do “at all times,” and how does that connect to the rule that you must tell the FCA or the PRA information they would reasonably expect to know about?", "expected_answer": "If you are a Conduct Rules non-executive director, you have a continuous duty to follow the conduct standards listed as 3.1 to 3.3, 3.7 and 3.8, meaning you are expected to comply at all times rather than only at specific moments. [#SRC:4b7d02b366371a2f] Alongside that always-on expectation, Senior Manager Conduct Standard 4 requires you to disclose appropriately any information that the FCA or the PRA would reasonably expect to have notice of. [#TGT:1ac71628712a0761] Putting these together, you should treat disclosure as part of your ongoing conduct: when you have information that the FCA or the PRA would reasonably expect to be told, you should make an appropriate disclosure, and you should do so in a way that fits with the fact that your conduct standards compliance is required at all times. [#SRC:4b7d02b366371a2f] The practical takeaway is that your compliance posture is continuous, and within that posture you must be ready to provide appropriate notice to the FCA or the PRA whenever the information meets the “reasonably expect to have notice” threshold. [#TGT:1ac71628712a0761]", "pair_uid": "f8006dad82c77ed0", "source_passage_uid": "4b7d02b366371a2f", "target_passage_uid": "1ac71628712a0761", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769372938, "run_seed": 13, "debug_context": {"source_text": "If you are a Conduct Rules non-executive director , you must comply at all times with the conduct standards specified in 3.1 to 3.3 , 3.7 and 3.8 .", "target_text": "Senior Manager Conduct Standard 4: You must disclose appropriately any information of which the FCA or the PRA would reasonably expect to have notice."}}
{"qa_uid": "00fa36d722a8e59c", "method": "DPEL", "persona": "professional", "question": "For a firm (or one or more underwriting members of the Society of Lloyd’s, including persons who have ceased to be such a member) proposing to apply under section 107 of the FSMA to transfer the whole or part of its business by an insurance business transfer scheme (or to accept such a transfer), how should it frame its compliance planning given the PRA’s stated approach to consulting with the Financial Conduct Authority (FCA) and the FCA’s separate published approach to Part VII transfers?", "expected_answer": "A firm (or relevant underwriting members of the Society of Lloyd’s, including persons who have ceased to be such a member) planning to apply under section 107 of the FSMA for an insurance business transfer scheme, or to accept such a transfer, should plan on a dual-regulator interface: the PRA will consult with the Financial Conduct Authority (FCA) before making certain transfer-related decisions, and the FCA has its own stated approach and expectations for Part VII insurance business transfers. [#TGT:c07f687cc71ea64f] [#SRC:8bd54938895a298a] In practical terms, the applicant’s preparation should be structured so that it can support PRA decision-making that may involve FCA input, while also being aligned with the FCA’s published materials on Part VII transfers. [#SRC:8bd54938895a298a] The relevant scope for this planning includes applications to transfer the whole or part of the firm’s business under an insurance business transfer scheme and situations where the firm proposes to accept such a transfer. [#TGT:c07f687cc71ea64f] The same overall planning context should also recognize that Chapter 2 is directed not only at transferring/accepting firms and Lloyd’s members, but also at the independent expert approved by the PRA to produce the scheme report under section 109 of FSMA, which is part of the transfer process that the PRA will be considering when consulting the FCA on certain decisions. [#TGT:c07f687cc71ea64f] [#SRC:8bd54938895a298a]", "pair_uid": "0ff0c080d9275991", "source_passage_uid": "8bd54938895a298a", "target_passage_uid": "c07f687cc71ea64f", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535829, "run_seed": 13, "debug_context": {"source_text": "While this statement sets out the PRA’s expectations in relation to insurance business transfers, the PRA will consult with the Financial Conduct Authority (FCA) in advance of making certain decisions in respect of a transfer and will seek to avoid introducing, inadvertently, incompatible requirements. 1 The FCA has also set out its own approach to and expectations in respect of insurance business transfers in SUP 18 of the FCA Handbook and FCA Final Guidance (FG) 18/4: The FCA’s approach to the review of Part VII insurance business transfers. 2", "target_text": "Chapter 2 is aimed at any firm, or one or more underwriting members of the Society of Lloyd’s, or one or more persons who have ceased to be such a member, proposing to make an application to transfer the whole or part of its business by an insurance business transfer scheme under section 107 of the FSMA or to accept such a transfer. Chapter 2 is also aimed at the independent expert approved by the PRA to make the scheme report under section 109 of FSMA."}}
{"qa_uid": "3a5fb2af944b182e", "method": "DPEL", "persona": "basic", "question": "If a firm (or Lloyd’s underwriting member, including someone who has stopped being a member) is planning to transfer all or part of its business under section 107 of FSMA, or to accept a transfer, who else besides the PRA should it expect to be involved in some decisions, and what other published approach should it look at?", "expected_answer": "In that situation, the firm should expect that the PRA will involve the Financial Conduct Authority (FCA) in advance of making certain decisions about the transfer, and the PRA says it will try not to create incompatible requirements when doing so. [#SRC:8bd54938895a298a] This expectation applies in the context described for Chapter 2: it is aimed at any firm, or one or more underwriting members of the Society of Lloyd’s (including persons who have ceased to be such a member), that proposes to apply to transfer the whole or part of its business by an insurance business transfer scheme under section 107 of the FSMA, or that proposes to accept such a transfer. [#TGT:c07f687cc71ea64f] Alongside anticipating PRA–FCA consultation, the firm should also look at the FCA’s own published approach and expectations for insurance business transfers, which the PRA notes are set out in SUP 18 of the FCA Handbook and in FCA Final Guidance (FG) 18/4 on the FCA’s approach to reviewing Part VII insurance business transfers. [#SRC:8bd54938895a298a] Finally, because Chapter 2 is also aimed at the independent expert approved by the PRA to produce the scheme report under section 109 of FSMA, the firm should factor that role into its overall transfer planning when considering how decisions may be reviewed. [#TGT:c07f687cc71ea64f]", "pair_uid": "0ff0c080d9275991", "source_passage_uid": "8bd54938895a298a", "target_passage_uid": "c07f687cc71ea64f", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535829, "run_seed": 13, "debug_context": {"source_text": "While this statement sets out the PRA’s expectations in relation to insurance business transfers, the PRA will consult with the Financial Conduct Authority (FCA) in advance of making certain decisions in respect of a transfer and will seek to avoid introducing, inadvertently, incompatible requirements. 1 The FCA has also set out its own approach to and expectations in respect of insurance business transfers in SUP 18 of the FCA Handbook and FCA Final Guidance (FG) 18/4: The FCA’s approach to the review of Part VII insurance business transfers. 2", "target_text": "Chapter 2 is aimed at any firm, or one or more underwriting members of the Society of Lloyd’s, or one or more persons who have ceased to be such a member, proposing to make an application to transfer the whole or part of its business by an insurance business transfer scheme under section 107 of the FSMA or to accept such a transfer. Chapter 2 is also aimed at the independent expert approved by the PRA to make the scheme report under section 109 of FSMA."}}
{"qa_uid": "edb46a155db31a8a", "method": "DPEL", "persona": "professional", "question": "Where a firm is a small CRR firm or a small third country CRR firm and therefore treats certain Remuneration Part provisions as inapplicable, what specific disclosures must the institution make when indicating it benefits from a derogation under point (k), including how it should reference the relevant Rulebook provisions and what remuneration data must be provided?", "expected_answer": "An institution that benefits from a derogation for the purposes of point (k) must still make a structured set of disclosures about that derogation, even where the firm is a small CRR firm or a small third country CRR firm and therefore considers 12.2 (along with other listed provisions) not to apply. [#TGT:a4ec0f032fd53c03] Specifically, the institution must state whether it benefits from the derogation by reference to the Remuneration Part of the PRA Rulebook at 5.3 and/or 12.2 (second subparagraph), and 15.A1 (3), which requires it to identify the Rulebook basis it is relying on (including 12.2 where relevant). [#SRC:709d7a650b1d24f6] In addition, it must explain the scope of its use of the derogation by identifying which remuneration principles are subject to the derogation(s). [#SRC:709d7a650b1d24f6] The institution must also quantify who is affected by stating the number of staff members benefiting from the derogation(s). [#SRC:709d7a650b1d24f6] Finally, it must provide the total remuneration for those staff, and present that total split into fixed and variable remuneration, so the impact of the derogation can be assessed in remuneration terms. [#SRC:709d7a650b1d24f6]", "pair_uid": "7965ee75acf40762", "source_passage_uid": "709d7a650b1d24f6", "target_passage_uid": "a4ec0f032fd53c03", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535847, "run_seed": 13, "debug_context": {"source_text": "For the purposes of point (k) of the first subparagraph of this paragraph, institutions that benefit from such a derogation shall indicate whether they benefit from that derogation on the basis of the Remuneration Part of the PRA Rulebook at 5.3 , and/or 12.2 (second subparagraph), and 15.A1 (3) . They shall also indicate for which of the remuneration principles they apply the derogation(s), the number of staff members that benefit from the derogation(s) and their total remuneration , split into fixed and variable remuneration .", "target_text": "12.2 , 15.15 to 15.19 , 15.20 (2) and (3A), 15.20A to 15.23 and 15A do not apply to a firm that is a small CRR firm or a small third country CRR firm ."}}
{"qa_uid": "e4223cf908061d50", "method": "DPEL", "persona": "basic", "question": "If a firm is a small CRR firm (or a small third country CRR firm) and says 12.2 doesn’t apply to it, what does it still need to report when it claims a derogation under point (k), and what details about staff pay must be broken out?", "expected_answer": "Even if a firm is a small CRR firm or a small third country CRR firm and therefore treats 12.2 as not applying to it, the institution must still provide the point (k) derogation information in the form described for institutions benefiting from such a derogation. [#TGT:a4ec0f032fd53c03] The institution must indicate whether it benefits from the derogation by citing the Remuneration Part of the PRA Rulebook at 5.3 and/or 12.2 (second subparagraph), and 15.A1 (3), so its stated basis for the derogation is clear (including any reference to 12.2). [#SRC:709d7a650b1d24f6] It must also specify which remuneration principles it applies the derogation(s) to, rather than leaving the scope implicit. [#SRC:709d7a650b1d24f6] In terms of who is covered, it must report the number of staff members who benefit from the derogation(s). [#SRC:709d7a650b1d24f6] In terms of pay, it must report those staff members’ total remuneration and present that total split into fixed remuneration and variable remuneration. [#SRC:709d7a650b1d24f6] This combination of applicability context (small CRR firm status) and the required derogation disclosures ensures the institution’s position and its remuneration impacts are both transparent. [#TGT:a4ec0f032fd53c03]", "pair_uid": "7965ee75acf40762", "source_passage_uid": "709d7a650b1d24f6", "target_passage_uid": "a4ec0f032fd53c03", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535847, "run_seed": 13, "debug_context": {"source_text": "For the purposes of point (k) of the first subparagraph of this paragraph, institutions that benefit from such a derogation shall indicate whether they benefit from that derogation on the basis of the Remuneration Part of the PRA Rulebook at 5.3 , and/or 12.2 (second subparagraph), and 15.A1 (3) . They shall also indicate for which of the remuneration principles they apply the derogation(s), the number of staff members that benefit from the derogation(s) and their total remuneration , split into fixed and variable remuneration .", "target_text": "12.2 , 15.15 to 15.19 , 15.20 (2) and (3A), 15.20A to 15.23 and 15A do not apply to a firm that is a small CRR firm or a small third country CRR firm ."}}
{"qa_uid": "b1bdc2a7fe77b7e0", "method": "DPEL", "persona": "professional", "question": "How should the compensation cap be applied when a single depositor has both aggregate eligible deposits and a temporary high balance, including the interaction between the general maximum for deposits, the temporary high balance maximum, and the no-limit carve-out for certain personal injury or incapacity payments?", "expected_answer": "For one depositor, you must apply separate maximum compensation sums depending on whether the amount is treated as aggregate eligible deposits or as a temporary high balance, and then apply the specific exceptions that modify those maxima. [#SRC:336f75f8cdcde56e] For the depositor’s aggregate eligible deposits, the stated maximum compensation sum is £120,000, but this is not absolute because the text anticipates that additional compensation can be payable where the circumstances fall within 4.3 or 4.4. [#SRC:336f75f8cdcde56e] For a temporary high balance, the maximum compensation sum is £1,400,000, but that cap is expressly framed as operating “subject to 4.4,” meaning it may be altered where 4.4 applies. [#TGT:b5fbb2a524d9ce87] In addition, there is a distinct carve-out for temporary high balances: if the temporary high balance arises from a payment connected with personal injury or incapacity, then there is no limit on the compensation payable for that temporary high balance. [#TGT:b5fbb2a524d9ce87] Accordingly, the £120,000 cap governs aggregate eligible deposits unless 4.3/4.4 increase it, while temporary high balances are capped at £1,400,000 unless 4.4 changes that, and are uncapped when tied to personal injury or incapacity payments. [#SRC:336f75f8cdcde56e] [#TGT:b5fbb2a524d9ce87]", "pair_uid": "f486a0a3b8870da4", "source_passage_uid": "336f75f8cdcde56e", "target_passage_uid": "b5fbb2a524d9ce87", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535875, "run_seed": 13, "debug_context": {"source_text": "The maximum compensation sum payable for the aggregate eligible deposits of each depositor is £120,000, save that additional compensation may be payable in cases to which 4.3 or 4.4 apply.", "target_text": "Subject to 4.4 , the maximum compensation sum payable for a temporary high balance is £1,400,000, save that no limit shall apply to the compensation payable for a temporary high balance arising from a payment in connection with personal injury or incapacity."}}
{"qa_uid": "a3b5276f37343b33", "method": "DPEL", "persona": "basic", "question": "If a depositor’s balance includes normal eligible deposits and also a temporary high balance, what are the two different maximum compensation amounts, and when does the temporary high balance have no maximum at all?", "expected_answer": "You must distinguish between (1) the depositor’s aggregate eligible deposits and (2) any temporary high balance, because each category has its own maximum compensation rule and its own exceptions. [#SRC:336f75f8cdcde56e] For aggregate eligible deposits, the maximum compensation sum payable for each depositor is £120,000, but the text also indicates that extra compensation can be payable in cases covered by 4.3 or 4.4, so the £120,000 figure may not be the final amount in those specified cases. [#SRC:336f75f8cdcde56e] For a temporary high balance, the maximum compensation sum is £1,400,000, and that maximum is expressly stated to operate “subject to 4.4,” meaning the 4.4 situation can affect how the cap applies. [#TGT:b5fbb2a524d9ce87] Separately, there is an explicit no-cap situation for temporary high balances: if the temporary high balance comes from a payment connected with personal injury or incapacity, then there is no limit on the compensation payable for that temporary high balance. [#TGT:b5fbb2a524d9ce87] In practice, this means you apply £120,000 to aggregate eligible deposits (unless 4.3/4.4 allow more) and apply £1,400,000 to temporary high balances (unless 4.4 changes it), except that personal injury or incapacity-related temporary high balances are not capped. [#SRC:336f75f8cdcde56e] [#TGT:b5fbb2a524d9ce87]", "pair_uid": "f486a0a3b8870da4", "source_passage_uid": "336f75f8cdcde56e", "target_passage_uid": "b5fbb2a524d9ce87", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535875, "run_seed": 13, "debug_context": {"source_text": "The maximum compensation sum payable for the aggregate eligible deposits of each depositor is £120,000, save that additional compensation may be payable in cases to which 4.3 or 4.4 apply.", "target_text": "Subject to 4.4 , the maximum compensation sum payable for a temporary high balance is £1,400,000, save that no limit shall apply to the compensation payable for a temporary high balance arising from a payment in connection with personal injury or incapacity."}}
{"qa_uid": "b7744c0f6b220520", "method": "DPEL", "persona": "professional", "question": "Where an institution has trading book and non-trading book exposures that are adjusted in accordance with Article 34 and Article 105, and those positions are measured at fair value and therefore subject to the prudent valuation standards in the PRA Rulebook, what specific prudent valuation adjustment breakdown must the institution produce, and how must it be separated across books and risk types?", "expected_answer": "An institution must produce a prudent valuation adjustment breakdown that both (i) reflects the application of prudent valuation standards to all trading book positions and non-trading book positions measured at fair value and (ii) disaggregates the prudent valuation adjustment into its constituent elements in a way that is separated by book and by risk type. [#TGT:fab620639def0122] Specifically, for exposures from the trading book and the non-trading book that are adjusted in accordance with Article 34 and Article 105, the institution must set out the amounts of the constituent elements of its prudent valuation adjustment broken down by type of risks, and it must also present the total of those constituent elements separately for trading book positions and for non-trading book positions. [#SRC:2523899445035439] This output should be prepared in a manner consistent with the requirement that all such fair value positions are subject to the prudent valuation standards in the relevant Article and in Chapter 4 of the Trading Book (CRR) Part of the PRA Rulebook. [#TGT:fab620639def0122] The separation by trading book versus non-trading book is not optional: the totals must be shown independently for each book, alongside the risk-type breakdown of the constituent elements. [#SRC:2523899445035439]", "pair_uid": "38e1d182240bab0d", "source_passage_uid": "2523899445035439", "target_passage_uid": "fab620639def0122", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535892, "run_seed": 13, "debug_context": {"source_text": "(e) for exposures from the trading book and the non-trading book that are adjusted in accordance with Article 34 and Article 105 , a breakdown of the amounts of the constituent elements of an institution's prudent valuation adjustment, by type of risks, and the total of constituent elements separately for the trading book and non-trading book positions;", "target_text": "Institutions shall ensure that all trading book positions and non-trading book positions measured at fair value shall be subject to the standards for prudent valuation specified in this Article and in Chapter 4 of the Trading Book (CRR) Part of the PRA Rulebook. Institutions shall in particular ensure that the prudent valuation of their trading book positions achieves an appropriate degree of certainty having regard to the dynamic nature of trading book positions and non-trading book positions measured at fair value, the demands of prudential soundness and the mode of operation and purpose of capital requirements in respect of trading book positions and non-trading book positions measured at fair value."}}
{"qa_uid": "2b8f62b9accd2e94", "method": "DPEL", "persona": "basic", "question": "If an institution has trading book and non-trading book positions measured at fair value (so they must follow the PRA prudent valuation standards), and some exposures are adjusted under Article 34 and Article 105, what does it need to show in its prudent valuation adjustment breakdown?", "expected_answer": "It needs to show a prudent valuation adjustment breakdown that ties the fair value positions to the prudent valuation standards and also splits the adjustment into detailed components. [#TGT:fab620639def0122] For the trading book and non-trading book exposures that are adjusted in accordance with Article 34 and Article 105, the institution must list the amounts for each constituent element that makes up its prudent valuation adjustment, and it must organise those elements by type of risks. [#SRC:2523899445035439] In addition, it must calculate and present the total of the constituent elements separately for trading book positions and separately for non-trading book positions, rather than combining them into one figure. [#SRC:2523899445035439] This breakdown is required in the context that all trading book positions and non-trading book positions measured at fair value are required to be subject to the prudent valuation standards in the relevant Article and in Chapter 4 of the Trading Book (CRR) Part of the PRA Rulebook. [#TGT:fab620639def0122] The result should therefore be a risk-type breakdown plus book-by-book totals, aligned to the prudent valuation framework that applies to those fair value positions. [#TGT:fab620639def0122]", "pair_uid": "38e1d182240bab0d", "source_passage_uid": "2523899445035439", "target_passage_uid": "fab620639def0122", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535892, "run_seed": 13, "debug_context": {"source_text": "(e) for exposures from the trading book and the non-trading book that are adjusted in accordance with Article 34 and Article 105 , a breakdown of the amounts of the constituent elements of an institution's prudent valuation adjustment, by type of risks, and the total of constituent elements separately for the trading book and non-trading book positions;", "target_text": "Institutions shall ensure that all trading book positions and non-trading book positions measured at fair value shall be subject to the standards for prudent valuation specified in this Article and in Chapter 4 of the Trading Book (CRR) Part of the PRA Rulebook. Institutions shall in particular ensure that the prudent valuation of their trading book positions achieves an appropriate degree of certainty having regard to the dynamic nature of trading book positions and non-trading book positions measured at fair value, the demands of prudential soundness and the mode of operation and purpose of capital requirements in respect of trading book positions and non-trading book positions measured at fair value."}}
{"qa_uid": "2ce3f0506541b465", "method": "DPEL", "persona": "professional", "question": "For a firm that has achieved SRT for a particular transaction and uses unfunded credit protection, what does the PRA expect the firm to monitor and stress test regarding the protection provider, and how should those assessments feed into the firm’s capital planning and Pillar 2 processes?", "expected_answer": "A firm that has achieved SRT is still expected to keep monitoring the transaction-related risks it remains exposed to, and to run regular stress testing over its securitisation activities and off balance sheet exposures, with outcomes feeding into its internal processes and Pillar 2 consideration. [#TGT:a1f555dbe3d2d607] Within that monitoring and stress-testing, originators are expected to assess the risk that the protection provider is downgraded and what that would mean for both the effectiveness of the unfunded credit protection and the provider’s ongoing eligibility to provide that protection, and to incorporate those implications into capital planning. [#SRC:e7a6b6de3819019b] In addition, the PRA expects firms to consider capital planning implications if securitised assets return onto the balance sheet, and to ensure stress tests consider firm-wide impacts of stressed market conditions on securitisation activities and off balance sheet exposures, including knock-on implications for other risk sources such as counterparty risk and credit risk. [#TGT:a1f555dbe3d2d607] The firm is also expected to have procedures to assess and respond to stress test results, and the PRA would expect those results to be taken into account under Pillar 2, which is where the protection-provider downgrade assessment should be operationalised alongside the broader securitisation stress-testing programme. [#TGT:a1f555dbe3d2d607] The stress-testing scope should cover existing securitisations and pipeline transactions, so the downgrade/eligibility analysis is not limited only to closed deals. [#TGT:a1f555dbe3d2d607]", "pair_uid": "3ab54988b8693520", "source_passage_uid": "e7a6b6de3819019b", "target_passage_uid": "a1f555dbe3d2d607", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535933, "run_seed": 13, "debug_context": {"source_text": "The PRA expects originators, as part of the monitoring and stress-testing mentioned in paragraph 2.11 of this SS, to assess the risk of a downgrade of the protection provider and the implications for the effectiveness of the unfunded credit protection and the eligibility of the provider to continue to provide the unfunded credit protection, and to reflect this in their capital planning.", "target_text": "Where a firm achieves SRT for a particular transaction, the PRA expects it to continue to monitor risks related to the transaction to which it may still be exposed. The PRA expects firms to consider the capital planning implications of securitised assets returning onto their balance sheets. The Internal Capital Adequacy Assessment Part of the PRA Rulebook requires firms to conduct regular stress testing of their securitisation activities and off balance sheet exposures. 5 The PRA expects those stress tests to consider the firm-wide impact of stressed market conditions on those activities and exposures and the implications for other sources of risk, for example, credit risk, concentration risk, counterparty risk, market risk, liquidity risk and reputational risk. The PRA expects a firm’s stress testing of securitisation activities to take into account existing securitisations and pipeline transactions. The PRA expects a firm to have in place procedures to assess and respond to the results of that stress testing and would expect them to be taken into account under Pillar 2."}}
{"qa_uid": "cd4df30c2391eff5", "method": "DPEL", "persona": "professional", "question": "When conducting the regular stress testing of securitisation activities and off balance sheet exposures required by the Internal Capital Adequacy Assessment Part of the PRA Rulebook, how should an originator integrate assessment of a protection provider downgrade affecting unfunded credit protection, and what capital planning considerations does the PRA expect to be addressed for SRT transactions?", "expected_answer": "In the regular stress testing of securitisation activities and off balance sheet exposures, an originator should explicitly build in an assessment of the risk that the protection provider is downgraded and evaluate the consequences for (i) the effectiveness of the unfunded credit protection and (ii) whether the provider remains eligible to continue providing that protection, and then reflect those consequences in capital planning. [#SRC:e7a6b6de3819019b] This integration sits within a broader PRA expectation that stress tests consider the firm-wide impact of stressed market conditions on securitisation activities and off balance sheet exposures and the implications for other sources of risk (including counterparty risk and credit risk), so the downgrade scenario should be analysed not only as a standalone issue but also for its wider risk interactions. [#TGT:a1f555dbe3d2d607] Where the firm has achieved SRT for a particular transaction, the PRA still expects ongoing monitoring of risks related to the transaction to which the firm may remain exposed, and it expects firms to consider capital planning implications of securitised assets returning onto their balance sheets. [#TGT:a1f555dbe3d2d607] The firm should have procedures to assess and respond to stress test results, and the PRA would expect those results to be taken into account under Pillar 2, which is the governance channel through which the protection-provider downgrade findings should be actioned. [#TGT:a1f555dbe3d2d607] The stress-testing programme should also take into account existing securitisations and pipeline transactions, ensuring the downgrade/eligibility assessment is applied across the securitisation lifecycle. [#TGT:a1f555dbe3d2d607]", "pair_uid": "3ab54988b8693520", "source_passage_uid": "e7a6b6de3819019b", "target_passage_uid": "a1f555dbe3d2d607", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535933, "run_seed": 13, "debug_context": {"source_text": "The PRA expects originators, as part of the monitoring and stress-testing mentioned in paragraph 2.11 of this SS, to assess the risk of a downgrade of the protection provider and the implications for the effectiveness of the unfunded credit protection and the eligibility of the provider to continue to provide the unfunded credit protection, and to reflect this in their capital planning.", "target_text": "Where a firm achieves SRT for a particular transaction, the PRA expects it to continue to monitor risks related to the transaction to which it may still be exposed. The PRA expects firms to consider the capital planning implications of securitised assets returning onto their balance sheets. The Internal Capital Adequacy Assessment Part of the PRA Rulebook requires firms to conduct regular stress testing of their securitisation activities and off balance sheet exposures. 5 The PRA expects those stress tests to consider the firm-wide impact of stressed market conditions on those activities and exposures and the implications for other sources of risk, for example, credit risk, concentration risk, counterparty risk, market risk, liquidity risk and reputational risk. The PRA expects a firm’s stress testing of securitisation activities to take into account existing securitisations and pipeline transactions. The PRA expects a firm to have in place procedures to assess and respond to the results of that stress testing and would expect them to be taken into account under Pillar 2."}}
{"qa_uid": "7808a6ba1e6b3f7d", "method": "DPEL", "persona": "professional", "question": "When an institution applies the derogation for derivative transactions with more than one material risk driver and maps the transaction to each relevant risk category on the basis of the most material risk driver in that category, how should it determine whether its position in that most material risk driver is long or short for purposes of the Section’s definition (in the context of transactions referred to in Article 277(3))?", "expected_answer": "For a derivative transaction that has more than one material risk driver, the institution must first map the transaction to risk categories using the derogation: if all material risk drivers fall in one risk category, it maps the transaction once to that category using the most material risk driver; if the material risk drivers span different risk categories, it maps the transaction once to each such category using the most material risk driver within each category. [#TGT:28d975e9bccdd9ad] Once the relevant “most material risk driver” has been identified for the mapped risk category (or for each mapped risk category), the institution determines whether its position in that driver is long or short by assessing how the transaction’s market value responds to an increase in the value of that risk driver for transactions referred to in Article 277(3). [#SRC:c6e60ca38b4dc301] Specifically, the position is long in the primary risk driver or the most material risk driver in the given risk category if the transaction’s market value increases when that risk driver’s value increases, and it is short if the transaction’s market value decreases when that risk driver’s value increases. [#SRC:c6e60ca38b4dc301] This long/short determination is applied to the same risk-driver selection that the mapping rule requires (i.e., the most material risk driver used as the basis for mapping in each risk category). [#TGT:28d975e9bccdd9ad]", "pair_uid": "bf7667e18c3f3a6c", "source_passage_uid": "c6e60ca38b4dc301", "target_passage_uid": "28d975e9bccdd9ad", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535948, "run_seed": 13, "debug_context": {"source_text": "For the purposes of this Section, a long position in the primary risk driver or in the most material risk driver in the given risk category for transactions referred to in Article 277(3) means that the market value of the transaction increases when the value of that risk driver increases and a short position in the primary risk driver or in the most material risk driver in the given risk category for transactions referred to in Article 277(3) means that the market value of the transaction decreases when the value of that risk driver increases.", "target_text": "By way of derogation from paragraph 2 , institutions shall map derivative transactions that have more than one material risk driver to more than one risk category. Where all the material risk drivers of one of those transactions belong to the same risk category, institutions shall only be required to map that transaction once to that risk category on the basis of the most material of those risk drivers. Where the material risk drivers of one of those transactions belong to different risk categories, institutions shall map that transaction once to each risk category for which the transaction has at least one material risk driver, on the basis of the most material of the risk drivers in that risk category."}}
{"qa_uid": "68491b3401590ede", "method": "DPEL", "persona": "basic", "question": "If a derivative has several material risk drivers and you have to map it to one or more risk categories using the most material risk driver in each category, how do you tell whether you are “long” or “short” in that driver (for transactions referred to in Article 277(3))?", "expected_answer": "Start by mapping the derivative transaction using the special mapping approach for transactions with more than one material risk driver: map it to more than one risk category, unless all its material risk drivers are in the same risk category, in which case you map it only once to that category using the most material risk driver. [#TGT:28d975e9bccdd9ad] If the material risk drivers sit in different risk categories, map the transaction once to each risk category where it has at least one material risk driver, and in each category use the most material risk driver in that category as the basis for the mapping. [#TGT:28d975e9bccdd9ad] After you have identified the most material risk driver for the relevant risk category (or for each category), decide whether the position in that driver is long or short by looking at what happens to the transaction’s market value when the value of that risk driver increases, for transactions referred to in Article 277(3). [#SRC:c6e60ca38b4dc301] If the market value rises when the risk driver rises, the position is long; if the market value falls when the risk driver rises, the position is short. [#SRC:c6e60ca38b4dc301] This ties the long/short label directly to the same “most material risk driver” that you used to map the transaction. [#TGT:28d975e9bccdd9ad]", "pair_uid": "bf7667e18c3f3a6c", "source_passage_uid": "c6e60ca38b4dc301", "target_passage_uid": "28d975e9bccdd9ad", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535948, "run_seed": 13, "debug_context": {"source_text": "For the purposes of this Section, a long position in the primary risk driver or in the most material risk driver in the given risk category for transactions referred to in Article 277(3) means that the market value of the transaction increases when the value of that risk driver increases and a short position in the primary risk driver or in the most material risk driver in the given risk category for transactions referred to in Article 277(3) means that the market value of the transaction decreases when the value of that risk driver increases.", "target_text": "By way of derogation from paragraph 2 , institutions shall map derivative transactions that have more than one material risk driver to more than one risk category. Where all the material risk drivers of one of those transactions belong to the same risk category, institutions shall only be required to map that transaction once to that risk category on the basis of the most material of those risk drivers. Where the material risk drivers of one of those transactions belong to different risk categories, institutions shall map that transaction once to each risk category for which the transaction has at least one material risk driver, on the basis of the most material of the risk drivers in that risk category."}}
{"qa_uid": "b6e9863a5fbff68e", "method": "DPEL", "persona": "professional", "question": "Where a firm has been notified by the Bank of England that it is, or is likely to be, subject to external or internal MREL in excess of regulatory capital requirements, what information is the firm expected to provide, and in what reporting context and section cross-references should that information be presented?", "expected_answer": "A firm that has received a notification from the Bank of England indicating it is, or is likely to be, subject to external or internal MREL above regulatory capital requirements is expected to provide a defined set of MREL-related information. [#TGT:de6e936130cf1aef] This expectation is framed within the firm’s disclosures on loss-absorbing capacity, meaning the information should be provided as part of the information on loss-absorbing capacity referenced in section A1.1. [#SRC:e7a2fb552183d06d] Specifically, the content to be provided comprises: information on MREL resources, information on projected resources, and information on individual instrument characteristics. [#TGT:de6e936130cf1aef] The same three categories are also identified as the MREL information that should be included within the loss-absorbing capacity package, and the instrument-level detail is to be aligned with the characteristics framework referenced for section A4. [#SRC:e7a2fb552183d06d] In practical terms, the Bank of England notification establishes when the PRA’s expectation applies, while the loss-absorbing capacity context and the section A1.1 and A4 references indicate where in the firm’s materials this information should sit and how it should be structured. [#TGT:de6e936130cf1aef] [#SRC:e7a2fb552183d06d]", "pair_uid": "7de18413489d8ed4", "source_passage_uid": "e7a2fb552183d06d", "target_passage_uid": "de6e936130cf1aef", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535979, "run_seed": 13, "debug_context": {"source_text": "As part of the information on loss-absorbing capacity ( section A1.1 ), firms should also provide information on MREL resources, projected resources, and individual instrument characteristics as set out in section A4 .", "target_text": "The PRA expects firms that have been notified by the Bank of England that they are, or are likely to be, subject to external or internal MREL in excess of regulatory capital requirements to provide information on MREL resources, projected resources, and individual instrument characteristics."}}
{"qa_uid": "9fbb3bbe36846bda", "method": "DPEL", "persona": "basic", "question": "If the Bank of England tells a firm it is, or will probably be, subject to external or internal MREL above regulatory capital requirements, what MREL details does the firm need to give, and how does that tie into the loss-absorbing capacity information in section A1.1 and the section A4 instrument detail?", "expected_answer": "When a firm has been notified by the Bank of England that it is, or is likely to be, subject to external or internal MREL that is higher than its regulatory capital requirements, the PRA expects the firm to provide specific MREL information. [#TGT:de6e936130cf1aef] The required information covers three areas: (1) MREL resources, (2) projected resources, and (3) individual instrument characteristics. [#TGT:de6e936130cf1aef] This is not meant to be provided in isolation; it should be included as part of the firm’s information on loss-absorbing capacity identified in section A1.1. [#SRC:e7a2fb552183d06d] In addition, the instrument-level information should follow the approach for individual instrument characteristics referenced in section A4, because the loss-absorbing capacity materials point to section A4 for how those characteristics are set out. [#SRC:e7a2fb552183d06d] Put together, the Bank of England notification explains when the expectation applies, and the section A1.1 and A4 references explain the reporting context and where the MREL resources, projected resources, and instrument characteristics should be presented within the loss-absorbing capacity information. [#TGT:de6e936130cf1aef] [#SRC:e7a2fb552183d06d]", "pair_uid": "7de18413489d8ed4", "source_passage_uid": "e7a2fb552183d06d", "target_passage_uid": "de6e936130cf1aef", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535979, "run_seed": 13, "debug_context": {"source_text": "As part of the information on loss-absorbing capacity ( section A1.1 ), firms should also provide information on MREL resources, projected resources, and individual instrument characteristics as set out in section A4 .", "target_text": "The PRA expects firms that have been notified by the Bank of England that they are, or are likely to be, subject to external or internal MREL in excess of regulatory capital requirements to provide information on MREL resources, projected resources, and individual instrument characteristics."}}
{"qa_uid": "fa8d1d2db9996267", "method": "DPEL", "persona": "professional", "question": "For a composite firm, how should the requirement to separately manage activities relating to general insurance business and long-term insurance business be applied in practice to managing agents and syndicates, including the situation where a single syndicate carries on both types of business under an exception?", "expected_answer": "A composite firm is required to run the activities for its general insurance business and its long-term insurance business under separate management arrangements, and this separation must be implemented in the way the firm manages those activities. [#TGT:fc6847c8e99d5a6a] In practical application for the Lloyd’s market context described, this means managing agents should operate separate management for syndicates that write general insurance business versus syndicates that write long-term insurance business, so that the two lines are not managed together as a single set of activities. [#SRC:112b43b1150a4cf8] Where the firm’s structure includes a single syndicate that writes both general insurance business and long-term insurance business, the separation requirement is not ignored; instead, the application of the Composites Part to managing agents in that mixed-syndicate scenario is intended to be guided by the material identified as paragraphs 3.1–3.3 of SS8/15 on Composites, referenced in connection with the exceptions at Composites 6.2. [#SRC:112b43b1150a4cf8] Accordingly, compliance should be assessed by (i) confirming the firm is a composite firm subject to separate management of the two sets of activities, and (ii) implementing that separation through the managing agent’s syndicate management model, with additional interpretive assistance used when a single syndicate carries both types of business under the stated exception. [#TGT:fc6847c8e99d5a6a] [#SRC:112b43b1150a4cf8]", "pair_uid": "9f1221df4e429644", "source_passage_uid": "112b43b1150a4cf8", "target_passage_uid": "fc6847c8e99d5a6a", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535999, "run_seed": 13, "debug_context": {"source_text": "Composites 2.2 requires composite firms to maintain separate management of general insurance business and long-term insurance business. In practical terms, this requires that managing agents separately manage syndicates which carry on general insurance business from syndicates which carry on long-term insurance business. However, where a single syndicate carries on both general insurance business and long-term insurance business pursuant to the exceptions referred to at Composites 6.2 , paragraphs 3.1 – 3.3 of SS8/15 on Composites are intended to assist in determining how the requirements of the Composites Part will apply to managing agents.", "target_text": "A composite firm must separately manage the activities relating to its general insurance business and the activities relating to its long-term insurance business in such a way that:"}}
{"qa_uid": "6345f07bb37096d2", "method": "DPEL", "persona": "basic", "question": "If a composite firm has to keep its general insurance business and long-term insurance business managed separately, what does that mean for how managing agents run syndicates, and what happens if one syndicate does both types of business under an exception?", "expected_answer": "The core requirement is that a composite firm must manage the activities for its general insurance business separately from the activities for its long-term insurance business, meaning the firm’s management approach must keep those two activity sets distinct. [#TGT:fc6847c8e99d5a6a] In the practical Lloyd’s market framing provided, this separation is implemented by having managing agents manage syndicates that carry on general insurance business separately from syndicates that carry on long-term insurance business, rather than managing them together. [#SRC:112b43b1150a4cf8] If there is a single syndicate that carries on both general insurance business and long-term insurance business, and it does so under the exceptions referred to at Composites 6.2, the separation requirement still needs to be applied, but the text indicates that paragraphs 3.1–3.3 of SS8/15 on Composites are intended to help determine how the Composites Part requirements apply to managing agents in that mixed-syndicate case. [#SRC:112b43b1150a4cf8] So, the expected approach is: keep the two lines’ activities separately managed at the firm level, implement that through separate syndicate management where possible, and use the referenced SS8/15 guidance to work out the application when one syndicate writes both lines under the stated exception. [#TGT:fc6847c8e99d5a6a] [#SRC:112b43b1150a4cf8]", "pair_uid": "9f1221df4e429644", "source_passage_uid": "112b43b1150a4cf8", "target_passage_uid": "fc6847c8e99d5a6a", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769535999, "run_seed": 13, "debug_context": {"source_text": "Composites 2.2 requires composite firms to maintain separate management of general insurance business and long-term insurance business. In practical terms, this requires that managing agents separately manage syndicates which carry on general insurance business from syndicates which carry on long-term insurance business. However, where a single syndicate carries on both general insurance business and long-term insurance business pursuant to the exceptions referred to at Composites 6.2 , paragraphs 3.1 – 3.3 of SS8/15 on Composites are intended to assist in determining how the requirements of the Composites Part will apply to managing agents.", "target_text": "A composite firm must separately manage the activities relating to its general insurance business and the activities relating to its long-term insurance business in such a way that:"}}
{"qa_uid": "a460bee12027038b", "method": "DPEL", "persona": "professional", "question": "When preparing the Statement for a merger under Schedule 16 to the 1986 Act, how should the society address any member bonus in the Statement, and how must the required member approval be structured within the Merger Resolutions depending on whether the total gross cost of the proposed bonus(es) is within or exceeds the prescribed limit?", "expected_answer": "The Statement must expressly cover whether a bonus will be paid to members as consideration for the merger, because Schedule 16 requires the Statement to specify the bonus (if any). [#SRC:3c15426a910415a8] In parallel, the society must ensure that members approve any bonus payments through the Merger Resolutions, because member approval of bonus payments is required as part of those resolutions. [#TGT:9dfe512afd4bf0e8] In practice, this means the Statement’s disclosure about the bonus should be aligned with how the bonus approval is presented for voting in the Merger Resolutions, using the PRA’s views on what may or may not be regarded as a bonus to frame what is being specified and approved. [#SRC:3c15426a910415a8] [#TGT:9dfe512afd4bf0e8] The placement of the approval within the Merger Resolutions depends on the total gross cost of the proposed bonus(es), calculated without adjusting for prospective corporation tax recovery. [#TGT:9dfe512afd4bf0e8] If that gross cost is within the prescribed limit, the approval need only be included in each Merger Resolution of the society whose funds are to be distributed. [#TGT:9dfe512afd4bf0e8] If it exceeds the prescribed limit, the approval must be included in each Merger Resolution of each participating society. [#TGT:9dfe512afd4bf0e8]", "pair_uid": "a54dd5817224cbd1", "source_passage_uid": "3c15426a910415a8", "target_passage_uid": "9dfe512afd4bf0e8", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536016, "run_seed": 13, "debug_context": {"source_text": "Paragraph 1(4)(d) of Schedule 16 to the 1986 Act requires the Statement to specify the bonus, if any, to be paid to members in consideration of the merger. The PRA’s views on what may, or may not, be regarded as bonus are given in paragraphs 3.41 to 3.42 , and the statutory requirements for approval of bonus payments are described in paragraph 3.107 .", "target_text": "The members approval of bonus payments is required as part of the Merger Resolutions (see section 96(4) to (6) of the 1986 Act) and see paragraph 3.59 for the PRA’s view of what may constitute a bonus). If the total gross cost of the proposed bonus(es) (ie without any adjustment for prospective corporation tax recovery) is within the prescribed limit, then approval for it need only be included in each of the Merger Resolutions of the society whose funds are to be distributed. If it exceeds that limit then it must be included in each of the Merger Resolutions of each participating society. The prescribed limit was changed by the Building Societies (Mergers) (Amendment) Regulations SI 1995/1874 amending S1 1987/2005 and now is:"}}
{"qa_uid": "7126354239725f29", "method": "DPEL", "persona": "basic", "question": "If a merger includes a payment to members, what does the Statement have to say about that payment, and how do you decide which societies’ Merger Resolutions must include the members’ approval when the total gross cost is (a) within the prescribed limit or (b) above it?", "expected_answer": "You must treat the member payment as something the Statement needs to address directly: the Statement is required to state the bonus, if any, that will be paid to members as part of the merger consideration. [#SRC:3c15426a910415a8] Separately, you must build the member vote on that bonus into the Merger Resolutions, because members’ approval of bonus payments is required as part of those resolutions. [#TGT:9dfe512afd4bf0e8] To decide where that approval language goes, use the rule based on the total gross cost of the proposed bonus(es), measured without any adjustment for prospective corporation tax recovery. [#TGT:9dfe512afd4bf0e8] If the total gross cost is within the prescribed limit, the bonus approval only needs to appear in each Merger Resolution of the society whose funds are to be distributed. [#TGT:9dfe512afd4bf0e8] If the total gross cost is above the prescribed limit, the bonus approval must appear in each Merger Resolution of every participating society. [#TGT:9dfe512afd4bf0e8] When drafting, use the PRA’s views on what may or may not count as a bonus to ensure the Statement’s description matches what members are being asked to approve. [#SRC:3c15426a910415a8] [#TGT:9dfe512afd4bf0e8]", "pair_uid": "a54dd5817224cbd1", "source_passage_uid": "3c15426a910415a8", "target_passage_uid": "9dfe512afd4bf0e8", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536016, "run_seed": 13, "debug_context": {"source_text": "Paragraph 1(4)(d) of Schedule 16 to the 1986 Act requires the Statement to specify the bonus, if any, to be paid to members in consideration of the merger. The PRA’s views on what may, or may not, be regarded as bonus are given in paragraphs 3.41 to 3.42 , and the statutory requirements for approval of bonus payments are described in paragraph 3.107 .", "target_text": "The members approval of bonus payments is required as part of the Merger Resolutions (see section 96(4) to (6) of the 1986 Act) and see paragraph 3.59 for the PRA’s view of what may constitute a bonus). If the total gross cost of the proposed bonus(es) (ie without any adjustment for prospective corporation tax recovery) is within the prescribed limit, then approval for it need only be included in each of the Merger Resolutions of the society whose funds are to be distributed. If it exceeds that limit then it must be included in each of the Merger Resolutions of each participating society. The prescribed limit was changed by the Building Societies (Mergers) (Amendment) Regulations SI 1995/1874 amending S1 1987/2005 and now is:"}}
{"qa_uid": "c1a1eeb774d75315", "method": "DPEL", "persona": "professional", "question": "When an institution publicly discloses information under Titles II and III, what presentation and content standard applies to the qualitative narrative that accompanies quantitative disclosures made in accordance with Article 431 of the CRR, and where must that narrative be positioned relative to the templates it explains?", "expected_answer": "An institution that is making public disclosures of the information referred to in Titles II and III must do so in line with the disclosure provisions in the relevant Title, while recognising that this framework operates with exceptions referenced in Article 432. [#TGT:8764079e3800c628] Within that public disclosure context, where the institution provides quantitative disclosures in accordance with Article 431 of the CRR, any accompanying qualitative narrative (and any other necessary supplementary information) must meet a specific clarity and completeness standard and must be presented in a specific location. [#SRC:352a11b8f7285ab2] Concretely, the qualitative narrative and supplementary information must be sufficiently clear and comprehensive so that users can understand the quantitative disclosures it accompanies. [#SRC:352a11b8f7285ab2] In addition, that narrative must be placed next to the templates that it describes, so the explanatory text is directly adjacent to the related quantitative templates within the public disclosure materials. [#SRC:352a11b8f7285ab2] This placement and quality requirement applies when the institution is publicly disclosing under Titles II and III in accordance with the applicable Title’s provisions (noting the existence of exceptions referred to in Article 432). [#TGT:8764079e3800c628]", "pair_uid": "f7305aa58dfe5d9d", "source_passage_uid": "352a11b8f7285ab2", "target_passage_uid": "8764079e3800c628", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536031, "run_seed": 13, "debug_context": {"source_text": "The qualitative narrative and any other necessary supplementary information accompanying quantitative disclosures in accordance with Article 431 of the CRR shall be adequately clear and comprehensive, enabling users of information to understand the quantitative disclosures and shall be placed next to the templates, which they describe.", "target_text": "Institutions shall publicly disclose the information referred to in Titles II and III in accordance with the provisions laid down in this Title, subject to the exceptions referred to in Article 432 ."}}
{"qa_uid": "e5e520ca29c96c3d", "method": "DPEL", "persona": "basic", "question": "If an institution is publishing the disclosures for Titles II and III, what does it need to do to make the written explanation around Article 431 quantitative templates usable, and where should that explanation sit on the page?", "expected_answer": "When an institution publicly discloses the information referred to in Titles II and III, it must do so following the provisions laid down in the relevant Title, while taking into account that there are exceptions referred to in Article 432. [#TGT:8764079e3800c628] In that public disclosure package, if the institution includes quantitative disclosures made in accordance with Article 431 of the CRR, the accompanying qualitative narrative (and any other necessary supplementary information) has to be drafted and positioned in a way that helps readers understand what the numbers mean. [#SRC:352a11b8f7285ab2] Specifically, the qualitative narrative and supplementary information must be adequately clear and comprehensive so that users of the information can understand the quantitative disclosures. [#SRC:352a11b8f7285ab2] It also must be placed next to the templates it describes, rather than separated elsewhere, so the explanation sits alongside the relevant quantitative templates within the public disclosures. [#SRC:352a11b8f7285ab2] This requirement is applied in the context of the institution’s obligation to publicly disclose Titles II and III information in accordance with the Title’s provisions (subject to the exceptions referred to in Article 432). [#TGT:8764079e3800c628]", "pair_uid": "f7305aa58dfe5d9d", "source_passage_uid": "352a11b8f7285ab2", "target_passage_uid": "8764079e3800c628", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536031, "run_seed": 13, "debug_context": {"source_text": "The qualitative narrative and any other necessary supplementary information accompanying quantitative disclosures in accordance with Article 431 of the CRR shall be adequately clear and comprehensive, enabling users of information to understand the quantitative disclosures and shall be placed next to the templates, which they describe.", "target_text": "Institutions shall publicly disclose the information referred to in Titles II and III in accordance with the provisions laid down in this Title, subject to the exceptions referred to in Article 432 ."}}
{"qa_uid": "ee6b1bd33dd923de", "method": "DPEL", "persona": "professional", "question": "When a firm is determining its basic own funds and identifies participations in a financial and credit institution that exceed the 10% threshold tied to items in 3A.1(1)(a), (b), (d) and (f), how should it apply the required reduction and, if a deduction is necessary but Own Funds 3K.5 cannot be applied straightforwardly, what process should it follow to determine which tier of own-funds the adjustment affects?", "expected_answer": "In determining its basic own funds, the firm must apply a reduction equal to the entire value of the relevant participations once the participations in a financial and credit institution exceed 10% of the specified items included in 3A.1(1)(a), 3A.1(1)(b), 3A.1(1)(d) and 3A.1(1)(f). [#TGT:0627964a494e4b18] This reduction is framed as a deduction from own-funds in the context of the Own Funds 3K calculation framework, so the firm should also observe Guidelines 4 and 5 as supporting guidance for carrying out those calculations. [#SRC:f70061d7218c187e] If, in implementing the required deduction, a straightforward application of Own Funds 3K.5 is not possible, the firm should use Guideline 6 to identify the tier of own-funds to which the adjustment should apply. [#SRC:f70061d7218c187e] Practically, this means the firm (i) checks whether the participations are those referred to in 3K.6 and whether they breach the 10% test against the listed 3A.1(1) items, (ii) reduces basic own funds by the full value of the participations that meet that condition, and (iii) where tier allocation is unclear under Own Funds 3K.5, applies Guideline 6 to determine the appropriate tier impact. [#TGT:0627964a494e4b18] [#SRC:f70061d7218c187e]", "pair_uid": "0ae4617c4105a055", "source_passage_uid": "f70061d7218c187e", "target_passage_uid": "0627964a494e4b18", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536050, "run_seed": 13, "debug_context": {"source_text": "Firms should observe Guidelines 4 and 5 which support the carrying out of the calculations required by Own Funds 3K . Where a deduction from own-funds is necessary, and where a straightforward application of Own Funds 3K.5 is not possible, firms should follow Guideline 6 to identify the tier of own-funds to which the adjustment should apply.", "target_text": "A firm must, for the purpose of determining its basic own funds , reduce its basic own funds by the full value of participations , as referred to in 3K.6 , in a financial and credit institution that exceeds 10% of items included in 3A.1(1)(a) , 3A.1(1)(b) , 3A.1(1)(d) and 3A.1(1)(f) ."}}
{"qa_uid": "a35a709cd26a5472", "method": "DPEL", "persona": "basic", "question": "If a firm is working out its basic own funds and it has participations in a financial and credit institution that go over 10% of the items listed in 3A.1(1)(a), (b), (d) and (f), what exactly must it subtract, and what should it do if it can’t apply Own Funds 3K.5 in a simple way to decide which tier the adjustment belongs to?", "expected_answer": "The firm must reduce its basic own funds by the entire value of the participations that meet the condition: participations (as referred to in 3K.6) in a financial and credit institution that exceed 10% of the items included in 3A.1(1)(a), 3A.1(1)(b), 3A.1(1)(d) and 3A.1(1)(f). [#TGT:0627964a494e4b18] Because this is a deduction from own-funds made within the Own Funds 3K calculation context, the firm should use Guidelines 4 and 5 as supporting guidance when performing the calculations. [#SRC:f70061d7218c187e] If the firm needs to make the deduction but cannot apply Own Funds 3K.5 in a straightforward way, it should follow Guideline 6 to work out which tier of own-funds the adjustment should be applied to. [#SRC:f70061d7218c187e] In other words, the firm first confirms the 10% threshold test against the specified 3A.1(1) items and then subtracts the full participation value from basic own funds; if it is not clear how to allocate that deduction across tiers using Own Funds 3K.5, it uses Guideline 6 to determine the tier impact. [#TGT:0627964a494e4b18] [#SRC:f70061d7218c187e]", "pair_uid": "0ae4617c4105a055", "source_passage_uid": "f70061d7218c187e", "target_passage_uid": "0627964a494e4b18", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536050, "run_seed": 13, "debug_context": {"source_text": "Firms should observe Guidelines 4 and 5 which support the carrying out of the calculations required by Own Funds 3K . Where a deduction from own-funds is necessary, and where a straightforward application of Own Funds 3K.5 is not possible, firms should follow Guideline 6 to identify the tier of own-funds to which the adjustment should apply.", "target_text": "A firm must, for the purpose of determining its basic own funds , reduce its basic own funds by the full value of participations , as referred to in 3K.6 , in a financial and credit institution that exceeds 10% of items included in 3A.1(1)(a) , 3A.1(1)(b) , 3A.1(1)(d) and 3A.1(1)(f) ."}}
{"qa_uid": "9d9e57f0a9717914", "method": "DPEL", "persona": "professional", "question": "When a firm is recognising and valuing deferred taxes for all assets and liabilities (including technical provisions) recognised for solvency or tax purposes, can it use IFRS for the deferred tax valuation, and if so, which Valuation provisions continue to apply alongside that approach?", "expected_answer": "A firm may use IFRS when recognising and valuing deferred taxes for all assets and liabilities (including technical provisions) that are recognised for solvency or tax purposes, because the relevant provisions are described as consistent with IFRS and using IFRS is not expected to create disproportionate costs. [#SRC:ce67e40da8a3c610] This IFRS-based approach is applied in the context where the firm must recognise and value deferred taxes in relation to all such assets and liabilities recognised for solvency or tax purposes. [#TGT:d84bdc975f6ad72f] However, adopting IFRS for this purpose does not displace all valuation requirements: Valuation 11.2 and Valuation 11.3 continue to apply even where IFRS is used. [#SRC:ce67e40da8a3c610] In practical terms, the firm should (i) ensure deferred taxes are recognised and valued across the full population of assets and liabilities (explicitly including technical provisions) that are recognised for solvency or tax purposes, and (ii) apply IFRS consistently with Valuation 11.1 while still complying with the continuing requirements in Valuation 11.2 and 11.3. [#TGT:d84bdc975f6ad72f] [#SRC:ce67e40da8a3c610]", "pair_uid": "e93b1f24fbe706b5", "source_passage_uid": "ce67e40da8a3c610", "target_passage_uid": "d84bdc975f6ad72f", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536067, "run_seed": 13, "debug_context": {"source_text": "Deferred tax — Provisions are consistent with IFRS as regards Valuation 11.1 so using IFRS would not impose disproportionate costs. Valuation 11.2 and 11.3 still apply.", "target_text": "A firm must recognise and value deferred taxes in relation to all assets and liabilities, including technical provisions , that are recognised for solvency or tax purposes in accordance with 5 ."}}
{"qa_uid": "063dc5a3b34ff877", "method": "DPEL", "persona": "basic", "question": "If a firm has to account for deferred taxes on all assets and liabilities it recognises for solvency or tax purposes (including technical provisions), is it allowed to use IFRS to do the valuation, and what other Valuation rules still have to be followed?", "expected_answer": "Yes. Where the firm must recognise and value deferred taxes for all assets and liabilities it recognises for solvency or tax purposes (and this includes technical provisions), it can use IFRS for the deferred tax valuation because the relevant provisions are stated to align with IFRS and using IFRS would not create disproportionate costs. [#TGT:d84bdc975f6ad72f] [#SRC:ce67e40da8a3c610] The key limitation is that using IFRS does not replace every valuation requirement: Valuation 11.2 and Valuation 11.3 still apply and must be complied with alongside the IFRS-consistent treatment under Valuation 11.1. [#SRC:ce67e40da8a3c610] So, the firm’s process should combine both texts by (1) covering deferred taxes for the full set of assets and liabilities recognised for solvency or tax purposes (explicitly including technical provisions), and (2) applying IFRS in a way that is consistent with Valuation 11.1 while continuing to apply Valuation 11.2 and 11.3. [#TGT:d84bdc975f6ad72f] [#SRC:ce67e40da8a3c610]", "pair_uid": "e93b1f24fbe706b5", "source_passage_uid": "ce67e40da8a3c610", "target_passage_uid": "d84bdc975f6ad72f", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536067, "run_seed": 13, "debug_context": {"source_text": "Deferred tax — Provisions are consistent with IFRS as regards Valuation 11.1 so using IFRS would not impose disproportionate costs. Valuation 11.2 and 11.3 still apply.", "target_text": "A firm must recognise and value deferred taxes in relation to all assets and liabilities, including technical provisions , that are recognised for solvency or tax purposes in accordance with 5 ."}}
{"qa_uid": "231719288789bb89", "method": "DPEL", "persona": "professional", "question": "When setting up indicator monitoring to support decision-making for a solvent exit, may a firm rely on its existing management information framework and the indicator framework developed under the PRA’s recovery planning expectations rather than creating a new set of indicators, and if so what aspects of those indicators should it monitor?", "expected_answer": "A firm may use and tailor its existing management information framework and any indicator framework it already developed under the PRA’s recovery planning expectations, and it does not have to create and monitor an entirely new set of indicators solely for this purpose. [#SRC:123f8b7afeb33b32] However, whichever indicators the firm uses (including those adapted from existing frameworks), it should actively monitor both projected and actual levels and also track the trend over time, because the indicators—together with other relevant information—are intended to enable clear and timely decision-making about a solvent exit. [#TGT:30201d932e512926] In practice, this means the firm should not treat reuse of existing frameworks as a reason to reduce monitoring discipline; instead, it should ensure the adapted indicators are monitored in a way that captures forward-looking expectations (projected levels), realised outcomes (actual levels), and directional movement (trend). [#TGT:30201d932e512926] The linkage is that the flexibility to draw on and adapt existing management information and recovery-planning indicator frameworks is compatible with, and must still satisfy, the expectation that the firm monitors projected and actual indicator levels and their trend to support solvent-exit decisions. [#SRC:123f8b7afeb33b32] [#TGT:30201d932e512926]", "pair_uid": "0549e921a726059d", "source_passage_uid": "123f8b7afeb33b32", "target_passage_uid": "30201d932e512926", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536086, "run_seed": 13, "debug_context": {"source_text": "To meet the expectations in paragraphs 2.7 and 2.8 , a firm may draw on and adapt its existing management information framework, and indicator framework developed under the PRA’s recovery planning expectations, 24 without necessarily creating and monitoring a new set of indicators.", "target_text": "A firm should monitor the projected and actual levels of these indicators, as well as their trend. These indicators, alongside other relevant information, 23 should support clear and timely decision-making regarding a solvent exit."}}
{"qa_uid": "89eb5175448a193f", "method": "DPEL", "persona": "basic", "question": "If a firm wants indicators that help it make clear and timely decisions about a solvent exit, can it reuse and tweak its current management information and PRA recovery-planning indicator framework instead of building a brand-new set, and what exactly does it need to keep an eye on for those indicators?", "expected_answer": "Yes. A firm can draw on and adapt its existing management information framework and the indicator framework it developed under the PRA’s recovery planning expectations, and it is not required to create and monitor a separate new set of indicators just for meeting the relevant expectations. [#SRC:123f8b7afeb33b32] But reusing those frameworks does not change what good monitoring looks like: the firm should monitor the projected levels and the actual levels of the indicators, and it should also monitor their trend. [#TGT:30201d932e512926] The reason is that the indicators, together with other relevant information, are meant to support clear and timely decision-making about a solvent exit. [#TGT:30201d932e512926] So the practical linkage is: you may reuse and tailor existing management information and recovery-planning indicators, but you still need to track forward-looking values, realised values, and how the indicators are moving over time so they can inform solvent-exit decisions. [#SRC:123f8b7afeb33b32] [#TGT:30201d932e512926]", "pair_uid": "0549e921a726059d", "source_passage_uid": "123f8b7afeb33b32", "target_passage_uid": "30201d932e512926", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536086, "run_seed": 13, "debug_context": {"source_text": "To meet the expectations in paragraphs 2.7 and 2.8 , a firm may draw on and adapt its existing management information framework, and indicator framework developed under the PRA’s recovery planning expectations, 24 without necessarily creating and monitoring a new set of indicators.", "target_text": "A firm should monitor the projected and actual levels of these indicators, as well as their trend. These indicators, alongside other relevant information, 23 should support clear and timely decision-making regarding a solvent exit."}}
{"qa_uid": "07d3303fdc47f082", "method": "DPEL", "persona": "professional", "question": "When a firm is validating an internal model, what evidence does the PRA expect the firm to be able to produce to demonstrate board oversight and issue resolution, and how should that evidence be framed in light of the chapter that addresses the role of the non-executive directors (NEDs) when considering a firm’s internal model?", "expected_answer": "A firm should be able to evidence that its board is actively owning and directing validation, and that this governance is demonstrable in a way that aligns with the PRA’s expectations for how non-executive directors (NEDs) engage when considering the firm’s internal model. [#TGT:2885987365954da3] Concretely, the PRA expects validation to combine detailed testing from the bottom up with top-down ownership by boards, so the firm’s evidence should show both the technical work and the board’s steering role. [#SRC:b487bdf1b63b4a0b] The evidence should cover: how boards oversee and influence the design of the validation process; how validation findings are summarised and reported to the board; and how boards are involved in tracking validation issues through to resolution. [#SRC:b487bdf1b63b4a0b] The firm should also be able to demonstrate that boards use validation as a tool to gain a sufficient understanding of the model, including its strengths and weaknesses, which is directly relevant to NEDs’ role when considering the internal model. [#SRC:b487bdf1b63b4a0b][#TGT:2885987365954da3] In practice, this means the firm’s documentation and reporting should make board (including NED) engagement visible across design, reporting, and follow-through on issues, rather than treating validation as solely a technical exercise. [#SRC:b487bdf1b63b4a0b][#TGT:2885987365954da3]", "pair_uid": "84b1180aefe63cc7", "source_passage_uid": "b487bdf1b63b4a0b", "target_passage_uid": "2885987365954da3", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536106, "run_seed": 13, "debug_context": {"source_text": "The PRA expects validation to be a combination of detailed ‘bottom-up’ testing and ‘top-down’ ownership by boards. 12 The PRA expects firms to be able to produce clear evidence showing how boards are overseeing and influencing the design of the validation process, how the findings from validation work are summarised and reported to them and how boards are then involved in tracking validation issues through to resolution. The PRA expects firms to demonstrate clearly that boards are using validation as a tool to enable them to gain a sufficient understanding of a model and its strengths and weaknesses. The PRA has high-level expectations on board involvement in validation, as described in the following paragraphs. See also Chapter 6 ‘Role of non-executive directors’ .", "target_text": "This chapter sets out the PRA’s expectations regarding the role of the non-executive directors (NEDs) when considering a firm’s internal model. 8"}}
{"qa_uid": "25f571ec020034d5", "method": "DPEL", "persona": "basic", "question": "What does the PRA want a firm to be able to show about how its board uses validation to understand an internal model, and how does that connect to the chapter about the role of the non-executive directors (NEDs) when looking at the firm’s internal model?", "expected_answer": "The PRA expects a firm to be able to show clear, practical evidence that its board is not just informed about validation but is actively using it to understand the internal model, and this should be consistent with the PRA’s expectations for the role of the non-executive directors (NEDs) when considering that internal model. [#TGT:2885987365954da3] Specifically, validation is expected to mix detailed “bottom-up” testing with “top-down” ownership by boards, so the firm should be able to demonstrate both the testing work and the board’s ownership. [#SRC:b487bdf1b63b4a0b] The firm should be able to evidence how the board oversees and influences the design of the validation process, how validation findings are pulled together and reported to the board, and how the board then helps track validation issues until they are resolved. [#SRC:b487bdf1b63b4a0b] The firm should also be able to demonstrate that the board uses validation as a tool to reach a sufficient understanding of the model’s strengths and weaknesses—an outcome that is directly relevant to how NEDs are expected to approach consideration of the firm’s internal model. [#SRC:b487bdf1b63b4a0b][#TGT:2885987365954da3] Overall, the evidence should make board (including NED) involvement visible from process design through to issue closure. [#SRC:b487bdf1b63b4a0b][#TGT:2885987365954da3]", "pair_uid": "84b1180aefe63cc7", "source_passage_uid": "b487bdf1b63b4a0b", "target_passage_uid": "2885987365954da3", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536106, "run_seed": 13, "debug_context": {"source_text": "The PRA expects validation to be a combination of detailed ‘bottom-up’ testing and ‘top-down’ ownership by boards. 12 The PRA expects firms to be able to produce clear evidence showing how boards are overseeing and influencing the design of the validation process, how the findings from validation work are summarised and reported to them and how boards are then involved in tracking validation issues through to resolution. The PRA expects firms to demonstrate clearly that boards are using validation as a tool to enable them to gain a sufficient understanding of a model and its strengths and weaknesses. The PRA has high-level expectations on board involvement in validation, as described in the following paragraphs. See also Chapter 6 ‘Role of non-executive directors’ .", "target_text": "This chapter sets out the PRA’s expectations regarding the role of the non-executive directors (NEDs) when considering a firm’s internal model. 8"}}
{"qa_uid": "b8c8f9eed7e245e4", "method": "DPEL", "persona": "professional", "question": "Where identity verification has not been completed in line with the relevant anti-money laundering requirements referred to in Depositor Protection 2.2(4)(f) before a firm’s compensation date, how does the PRA indicate the court-appointed insolvency practitioner may proceed to support an FSCS eligibility determination, and what additional consideration should the insolvency practitioner apply under Section 99 of the Banking Act 2009?", "expected_answer": "If identity verification has not been completed in accordance with the relevant anti-money laundering requirements referred to in Depositor Protection 2.2(4)(f) before the firm’s compensation date, the PRA’s view is that Depositor Protection 2.2(4)(f) permits the relevant insolvency practitioner appointed by the court to facilitate identity verification for the purpose of determining eligibility for FSCS protection. [#SRC:eb355065b8865baf] In applying that facilitation role, insolvency practitioners are also expected to consider their actions in line with the insolvency practitioner’s objectives and responsibilities under Section 99 of the Banking Act 2009. [#TGT:02363a43a51fdf7b] Practically, this means the insolvency practitioner’s facilitation of identity checks is framed by two linked conditions: (i) the trigger is the absence of compliant identity verification ahead of the compensation date, and (ii) the facilitation is directed specifically at enabling an FSCS eligibility determination. [#SRC:eb355065b8865baf] At the same time, the insolvency practitioner should evaluate how undertaking (or arranging) that verification aligns with the objectives and responsibilities that apply to them under Section 99, rather than treating the facilitation as a standalone administrative step. [#TGT:02363a43a51fdf7b] The combined effect is that the insolvency practitioner may facilitate identity verification to resolve eligibility for FSCS protection when the pre-compensation-date verification gap exists, while ensuring the approach is consistent with their Section 99 role. [#SRC:eb355065b8865baf] [#TGT:02363a43a51fdf7b]", "pair_uid": "1e6db390cf60b4fe", "source_passage_uid": "eb355065b8865baf", "target_passage_uid": "02363a43a51fdf7b", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536127, "run_seed": 13, "debug_context": {"source_text": "In the event that identity verification has not been carried out in accordance with the relevant anti-money laundering requirements referred to in Depositor Protection 2.2(4)(f) ahead of the firm’s compensation date, the PRA considers that Depositor Protection 2.2(4)(f) would allow the relevant insolvency practitioner appointed by the court to facilitate the identity verification for the purposes of determining eligibility for FSCS (Financial Services Compensation Scheme) protection. 2", "target_text": "2. Insolvency practitioners should consider in line with the insolvency practitioner’s objectives and responsibilities under Section 99 of the Banking Act 2009."}}
{"qa_uid": "247a842d07cfc3d2", "method": "DPEL", "persona": "basic", "question": "If a firm hasn’t done the required identity checks before its compensation date, what does the PRA say a court-appointed insolvency practitioner can do to help decide if someone is eligible for FSCS protection, and what should the insolvency practitioner keep in mind about Section 99 of the Banking Act 2009?", "expected_answer": "When identity verification has not been carried out in line with the relevant anti-money laundering requirements referred to in Depositor Protection 2.2(4)(f) before the firm’s compensation date, the PRA indicates that Depositor Protection 2.2(4)(f) allows the relevant insolvency practitioner appointed by the court to facilitate identity verification. [#SRC:eb355065b8865baf] The stated purpose of that facilitation is to support determining whether a person is eligible for FSCS protection, so the identity verification step is tied directly to the FSCS eligibility decision. [#SRC:eb355065b8865baf] Alongside that, insolvency practitioners should consider their actions in line with the insolvency practitioner’s objectives and responsibilities under Section 99 of the Banking Act 2009. [#TGT:02363a43a51fdf7b] Read together, the passages mean the insolvency practitioner’s role is not simply to “fill in” missing checks; it is to facilitate identity verification specifically because it is needed for an FSCS eligibility determination, and to do so in a way that reflects the objectives and responsibilities that apply to them under Section 99. [#SRC:eb355065b8865baf] [#TGT:02363a43a51fdf7b] The key conditions are therefore (1) the timing gap—verification was not completed ahead of the compensation date—and (2) the role constraint—facilitation should be considered through the lens of the insolvency practitioner’s Section 99 responsibilities. [#SRC:eb355065b8865baf] [#TGT:02363a43a51fdf7b]", "pair_uid": "1e6db390cf60b4fe", "source_passage_uid": "eb355065b8865baf", "target_passage_uid": "02363a43a51fdf7b", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536127, "run_seed": 13, "debug_context": {"source_text": "In the event that identity verification has not been carried out in accordance with the relevant anti-money laundering requirements referred to in Depositor Protection 2.2(4)(f) ahead of the firm’s compensation date, the PRA considers that Depositor Protection 2.2(4)(f) would allow the relevant insolvency practitioner appointed by the court to facilitate the identity verification for the purposes of determining eligibility for FSCS (Financial Services Compensation Scheme) protection. 2", "target_text": "2. Insolvency practitioners should consider in line with the insolvency practitioner’s objectives and responsibilities under Section 99 of the Banking Act 2009."}}
{"qa_uid": "844af4cae9284c1c", "method": "DPEL", "persona": "professional", "question": "When the PRA assesses, for a given risk type, whether minimum requirements applied to an entity established outside the United Kingdom on an individual or sub-consolidated basis exceed that entity’s share of the consolidated group requirements for the same risk, how must the entity’s share be calculated, and what categories of requirements would the PRA generally exclude from that assessment (including where exposures net off in consolidation)?", "expected_answer": "In this assessment, the entity’s “share” of a particular consolidated group capital requirement is determined by applying a Pillar 1 RWA-based allocation to the consolidated group requirement, and the PRA would generally disregard certain requirements that do not represent incremental consolidated risk. [#SRC:ef9de1e6e4142317] Specifically, the entity’s share is calculated by multiplying the consolidated group capital requirement by the proportion of the consolidated group’s Pillar 1 RWAs attributable to that entity. [#TGT:0b98872ee0444604] The RWAs attributable to the entity are computed as the entity’s Pillar 1 RWAs (calculated on the same basis as the group RWAs) minus the entity’s risk-weighted exposures to other group entities, which operationalizes the consolidation netting concept in the allocation. [#TGT:0b98872ee0444604] When comparing the outside-UK minimum requirements (on an individual or sub-consolidated basis) to that allocated share for the same risk type, the PRA would not generally take into account requirements attributable to risks that are already mitigated through the risk based capital framework or by other means. [#SRC:ef9de1e6e4142317] The PRA would also not generally take into account requirements attributable to risks that net off in consolidation, such as intragroup risks and offsetting positions, aligning with the exclusion of exposures to other group entities in the attributable-RWA calculation. [#SRC:ef9de1e6e4142317] [#TGT:0b98872ee0444604]", "pair_uid": "957d76d273cfc042", "source_passage_uid": "ef9de1e6e4142317", "target_passage_uid": "0b98872ee0444604", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536149, "run_seed": 13, "debug_context": {"source_text": "the extent to which, for any given risk type, the minimum requirements applied to an entity established outside the United Kingdom, on an individual or sub-consolidated basis, exceed the entity’s share 19 of the consolidated group requirements for the same risk. When making this assessment, the PRA would not generally take into account requirements that are attributable to risks that: (i) are already mitigated through the risk based capital framework 20 or by other means; 21 or (ii) net off in consolidation (for example, intragroup risks and offsetting positions); and", "target_text": "19. An entity’s share of a particular consolidated group capital requirement can be determined by multiplying that consolidated group capital requirement by the proportion of the consolidated group’s Pillar 1 RWAs that are attributable to that entity. The consolidated group’s RWAs that are attributable to an entity is calculated as the entity’s Pillar 1 RWAs, calculated on the same basis as the group RWAs, minus the risk-weighted exposures of the entity to other group entities."}}
{"qa_uid": "ea30a7f9dcbfb2d5", "method": "DPEL", "persona": "basic", "question": "If you are checking whether minimum requirements for an entity established outside the United Kingdom are higher than its share of the group requirement for the same risk type, how do you work out the entity’s share using Pillar 1 RWAs, and which kinds of risks does the PRA generally ignore because they are already mitigated or net off in consolidation (like intragroup items)?", "expected_answer": "To compare outside-UK minimum requirements (on an individual or sub-consolidated basis) against the entity’s share of the consolidated group requirement for the same risk type, you first allocate the group requirement to the entity using a Pillar 1 RWA proportion, and then apply the PRA’s stated exclusions for certain risk-attributable requirements. [#SRC:ef9de1e6e4142317] The entity’s share of a particular consolidated group capital requirement is calculated by multiplying the consolidated group capital requirement by the proportion of the consolidated group’s Pillar 1 RWAs that are attributable to that entity. [#TGT:0b98872ee0444604] To get the RWAs attributable to the entity, take the entity’s Pillar 1 RWAs (calculated on the same basis as the group RWAs) and subtract the entity’s risk-weighted exposures to other group entities, which reflects how intragroup exposures are treated in consolidation. [#TGT:0b98872ee0444604] In making the “exceed” assessment, the PRA would not generally count requirements that relate to risks already mitigated through the risk based capital framework or by other means. [#SRC:ef9de1e6e4142317] The PRA would also not generally count requirements tied to risks that net off in consolidation—examples include intragroup risks and offsetting positions—so those items should not drive the comparison outcome. [#SRC:ef9de1e6e4142317]", "pair_uid": "957d76d273cfc042", "source_passage_uid": "ef9de1e6e4142317", "target_passage_uid": "0b98872ee0444604", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536149, "run_seed": 13, "debug_context": {"source_text": "the extent to which, for any given risk type, the minimum requirements applied to an entity established outside the United Kingdom, on an individual or sub-consolidated basis, exceed the entity’s share 19 of the consolidated group requirements for the same risk. When making this assessment, the PRA would not generally take into account requirements that are attributable to risks that: (i) are already mitigated through the risk based capital framework 20 or by other means; 21 or (ii) net off in consolidation (for example, intragroup risks and offsetting positions); and", "target_text": "19. An entity’s share of a particular consolidated group capital requirement can be determined by multiplying that consolidated group capital requirement by the proportion of the consolidated group’s Pillar 1 RWAs that are attributable to that entity. The consolidated group’s RWAs that are attributable to an entity is calculated as the entity’s Pillar 1 RWAs, calculated on the same basis as the group RWAs, minus the risk-weighted exposures of the entity to other group entities."}}
{"qa_uid": "551783201272fdeb", "method": "DPEL", "persona": "professional", "question": "When a G-SII uses the derogation referenced in the SOURCE, how does that affect the requirement in the TARGET that institutions disclose required information in electronic format and in a single medium or location, particularly regarding the placement of Article 441 information relative to the standalone document or distinctive financial-statement section?", "expected_answer": "A G-SII that relies on the derogation described in the SOURCE is permitted to place the Article 441 disclosures somewhere other than the standalone document referenced for the “single medium or location” concept in the TARGET. [#SRC:f339ea4b3db2ad76] In general, institutions must make all required disclosures under Titles II and III available electronically and in one single medium or location. [#TGT:8422ed9edcda5caa] That single medium or location must take one of two forms: either (i) a standalone document that serves as an easily accessible prudential information source for users, or (ii) a distinctive, easily identifiable section included in or appended to the institutions’ financial statements or financial reports that contains the required disclosures. [#TGT:8422ed9edcda5caa] The SOURCE creates a specific carve-out for a G-SII using the derogation: even though the TARGET frames disclosures as being in a single medium or location (and identifies the standalone document/financial-statement section as the vehicle), the G-SII may disclose the information required under Article 441 in a separate medium or location from that standalone document. [#SRC:f339ea4b3db2ad76] Accordingly, for such a G-SII, compliance can involve maintaining the general electronic, single-location disclosure approach for Titles II and III while allowing Article 441 information to be provided separately from the standalone document identified in the TARGET. [#SRC:f339ea4b3db2ad76] [#TGT:8422ed9edcda5caa]", "pair_uid": "87503b170fd500f2", "source_passage_uid": "f339ea4b3db2ad76", "target_passage_uid": "8422ed9edcda5caa", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536182, "run_seed": 13, "debug_context": {"source_text": "By way of derogation from Article 434(1) , where a G-SII relies on the derogation in paragraph 1 , it may disclose the information required under Article 441 in a separate medium or location from the standalone document mentioned in Article 434(1) .", "target_text": "Institutions shall disclose all the information required under Titles II and III in electronic format and in a single medium or location. The single medium or location shall be a standalone document that provides a readily accessible source of prudential information for users of that information or a distinctive section included in or appended to the institutions' financial statements or financial reports containing the required disclosures and being easily identifiable to those users."}}
{"qa_uid": "eb296c3f58f0dd34", "method": "DPEL", "persona": "basic", "question": "If a G-SII is using the derogation mentioned in the SOURCE, can it put the Article 441 disclosures somewhere different from the one electronic “single medium or location” described in the TARGET (like the standalone document or the special section in the financial statements)?", "expected_answer": "Yes—if the entity is a G-SII and it is relying on the derogation described in the SOURCE, it is allowed to provide the Article 441 disclosures in a different place than the standalone document referenced for the single-location approach. [#SRC:f339ea4b3db2ad76] Separately, the TARGET sets the baseline presentation rule for institutions: all information required under Titles II and III must be disclosed electronically and gathered into a single medium or location. [#TGT:8422ed9edcda5caa] The TARGET also explains what that single medium or location looks like in practice: it must be either a standalone document that users can readily access for prudential information, or a distinctive section that is included in or appended to the institutions’ financial statements or financial reports and is easy for users to identify. [#TGT:8422ed9edcda5caa] The SOURCE then narrows in on a specific situation and relaxes placement for one subset of disclosures: when the G-SII uses the derogation, the Article 441 information may be disclosed in a separate medium or location from the standalone document mentioned in the TARGET’s framework. [#SRC:f339ea4b3db2ad76] In other words, the general “one electronic place” structure remains the default, but Article 441 can be separated when the SOURCE’s derogation condition is met. [#SRC:f339ea4b3db2ad76] [#TGT:8422ed9edcda5caa]", "pair_uid": "87503b170fd500f2", "source_passage_uid": "f339ea4b3db2ad76", "target_passage_uid": "8422ed9edcda5caa", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536182, "run_seed": 13, "debug_context": {"source_text": "By way of derogation from Article 434(1) , where a G-SII relies on the derogation in paragraph 1 , it may disclose the information required under Article 441 in a separate medium or location from the standalone document mentioned in Article 434(1) .", "target_text": "Institutions shall disclose all the information required under Titles II and III in electronic format and in a single medium or location. The single medium or location shall be a standalone document that provides a readily accessible source of prudential information for users of that information or a distinctive section included in or appended to the institutions' financial statements or financial reports containing the required disclosures and being easily identifiable to those users."}}
{"qa_uid": "93904561d9e0f943", "method": "DPEL", "persona": "professional", "question": "When an institution that acts as a clearing member is calculating its own funds requirements for CVA risk, how can it combine (i) the ability to use a reduced exposure at default from specified paragraph calculations and (ii) the derogation allowing a fixed maturity factor when using the Section 5 method for exposures to a client?", "expected_answer": "An institution that acts as a clearing member may, for its own funds requirements for CVA risk under Title VI, base the calculation on a reduced exposure at default, but only where that reduced exposure at default results from the calculations in paragraphs 3, 4 and 5. [#SRC:e0f6e3ca4abbfbea] Separately, when the same type of institution is calculating the own funds requirement for its exposures to a client using the method set out in Section 5, it is permitted—by derogation from point (d) of Article 282(4)—to apply a maturity factor of 0.21 within that Section 5 calculation. [#TGT:f6e5657c2d3e0f5e] In practice, this means the institution can (i) use the reduced exposure at default (as determined by paragraphs 3–5) as an input for its CVA own funds requirement calculation under Title VI, while also (ii) applying the specific maturity factor of 0.21 when, and only when, it is using the Section 5 method to calculate the own funds requirement for exposures to a client. [#SRC:e0f6e3ca4abbfbea] [#TGT:f6e5657c2d3e0f5e] The maturity-factor permission is tied to the Section 5 method and client exposures, whereas the reduced-exposure-at-default permission is tied to paragraphs 3–5 and the CVA own funds requirement context under Title VI. [#SRC:e0f6e3ca4abbfbea] [#TGT:f6e5657c2d3e0f5e]", "pair_uid": "94cdb60549d40c8c", "source_passage_uid": "e0f6e3ca4abbfbea", "target_passage_uid": "f6e5657c2d3e0f5e", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536206, "run_seed": 13, "debug_context": {"source_text": "An institution that acts as a clearing member may use the reduced exposure at default resulting from the calculations set out in paragraphs 3 , 4 and 5 for the purposes of calculating its own funds requirements for CVA risk in accordance with Title VI.", "target_text": "By way of derogation from point (d) of Article 282(4) , where an institution that acts as a clearing member uses the method set out in Section 5 to calculate the own funds requirement for its exposures to a client , that institution may use a maturity factor of 0.21 in that calculation."}}
{"qa_uid": "184084ef3c72598e", "method": "DPEL", "persona": "basic", "question": "If an institution that acts as a clearing member is working out its CVA own funds requirement, what does it need to do to use the reduced exposure at default, and when can it also use the 0.21 maturity factor for client exposures?", "expected_answer": "For CVA purposes, an institution that acts as a clearing member is allowed to use a reduced exposure at default, but only if that reduced figure comes from the calculations described in paragraphs 3, 4 and 5, and it is being used to calculate the institution’s own funds requirements for CVA risk under Title VI. [#SRC:e0f6e3ca4abbfbea] In addition, if the institution is calculating the own funds requirement for its exposures to a client using the method set out in Section 5, it may apply a maturity factor of 0.21 in that Section 5 calculation, under a derogation from point (d) of Article 282(4). [#TGT:f6e5657c2d3e0f5e] Put together, the institution can use the reduced exposure at default for the CVA own funds requirement calculation (as long as it is derived from paragraphs 3–5), and it can also use the 0.21 maturity factor, but only in the specific situation where it is using the Section 5 method for exposures to a client. [#SRC:e0f6e3ca4abbfbea] [#TGT:f6e5657c2d3e0f5e] These are two distinct permissions with different triggers: one is tied to paragraphs 3–5 and CVA under Title VI, and the other is tied to Section 5, client exposures, and the maturity factor of 0.21. [#SRC:e0f6e3ca4abbfbea] [#TGT:f6e5657c2d3e0f5e]", "pair_uid": "94cdb60549d40c8c", "source_passage_uid": "e0f6e3ca4abbfbea", "target_passage_uid": "f6e5657c2d3e0f5e", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536206, "run_seed": 13, "debug_context": {"source_text": "An institution that acts as a clearing member may use the reduced exposure at default resulting from the calculations set out in paragraphs 3 , 4 and 5 for the purposes of calculating its own funds requirements for CVA risk in accordance with Title VI.", "target_text": "By way of derogation from point (d) of Article 282(4) , where an institution that acts as a clearing member uses the method set out in Section 5 to calculate the own funds requirement for its exposures to a client , that institution may use a maturity factor of 0.21 in that calculation."}}
{"qa_uid": "9548fa693971ae50", "method": "DPEL", "persona": "professional", "question": "For a smaller and less complex PRA-regulated subsidiary that proposes not to have an independent non-executive chair, what governance explanation must the firm be able to provide, and which external materials are explicitly pointed to for the independence-of-mind expectation and broader organisational requirements context?", "expected_answer": "A smaller and less complex PRA-regulated subsidiary may propose not to appoint an independent non-executive chair, but the firm must still be able to explain how the subsidiary’s governance arrangements will otherwise deliver independent oversight of the executives and enable effective challenge. [#SRC:a498a9c92e081d73] That explanation should be framed against the broader principle that boards should have sufficient independence and that directors—particularly non-executives—must act with sufficient independence of mind and make sound, objective, independent decisions and judgments when performing their functions. [#SRC:a498a9c92e081d73] In addition, the firm should ensure that non-executive directors hold management to account for delegated matters and can challenge executives effectively and promptly, which is part of demonstrating that independent oversight is achieved even without an independent chair. [#SRC:a498a9c92e081d73] The independence-of-mind expectation is explicitly linked to paragraph 80 of the Joint European Securities and Markets Authority (ESMA) and EBA Guidelines on assessing the suitability of members of the management body, which is referenced as the source for that expectation. [#TGT:f9459c2cbbae00e1] The overall organisational requirements context is also explicitly signposted by the reference to the General Organisational Requirements Part of the PRA Rulebook, which the firm should consider alongside its governance explanation. [#TGT:f9459c2cbbae00e1]", "pair_uid": "cce6ce467ef0b170", "source_passage_uid": "a498a9c92e081d73", "target_passage_uid": "f9459c2cbbae00e1", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536223, "run_seed": 13, "debug_context": {"source_text": "The principles of good governance should apply to all PRA-regulated subsidiaries, including the principle that boards should have sufficient independence, to help ensure they can provide effective challenge to the business. Where a smaller and less complex subsidiary proposes not to have an independent non-executive chair, the firm should still be able to explain how its governance arrangements will otherwise satisfy the need for independent oversight of the executives. Moreover, all firms have an obligation to ensure that all their directors, in particular non-executives, act with sufficient independence of mind and ‘make their own sound, objective and independent decisions and judgments when performing their functions and responsibilities’. 28 The non-executive directors on the board should hold management to account against the matters delegated, and be able to challenge the executive effectively and promptly. Firms should have regard to the expectations on board responsibilities outlined in SS5/16 ‘Corporate governance: Board responsibilities’. 29", "target_text": "28. Joint European Securities and Markets Authority (ESMA) and EBA Guidelines on the assessment of the suitability of members of the management body, paragraph 80. https://eba.europa.eu/regulation-and-policy/internal-governance/joint-esma-and-eba-guidelines-on-the-assessment-of-the-suitability-of-members-of-the-management-body . See also the General Organisational Requirements Part of the PRA Rulebook"}}
{"qa_uid": "72f071c38778a8be", "method": "DPEL", "persona": "basic", "question": "If a smaller, less complex PRA-regulated subsidiary says it won’t have an independent non-executive chair, what does the firm need to be able to explain about oversight and challenge, and what named guideline paragraph and PRA Rulebook part are pointed to for the independence and organisational requirements context?", "expected_answer": "If a smaller and less complex PRA-regulated subsidiary proposes not to have an independent non-executive chair, the firm still needs to be able to explain how the subsidiary’s governance will meet the need for independent oversight of the executives. [#SRC:a498a9c92e081d73] That explanation should show how the board will still provide effective challenge to the business, including that non-executive directors can hold management to account for what has been delegated and can challenge executives effectively and promptly. [#SRC:a498a9c92e081d73] It also needs to align with the obligation on firms to ensure directors—especially non-executives—act with sufficient independence of mind and make their own sound, objective, independent decisions and judgments when carrying out their responsibilities. [#SRC:a498a9c92e081d73] The text explicitly points to paragraph 80 of the Joint European Securities and Markets Authority (ESMA) and EBA Guidelines on assessing the suitability of members of the management body as the referenced guideline source connected to that independence expectation. [#TGT:f9459c2cbbae00e1] It also directs attention to the General Organisational Requirements Part of the PRA Rulebook as the named PRA Rulebook context to consider when framing governance and organisational arrangements. [#TGT:f9459c2cbbae00e1]", "pair_uid": "cce6ce467ef0b170", "source_passage_uid": "a498a9c92e081d73", "target_passage_uid": "f9459c2cbbae00e1", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536223, "run_seed": 13, "debug_context": {"source_text": "The principles of good governance should apply to all PRA-regulated subsidiaries, including the principle that boards should have sufficient independence, to help ensure they can provide effective challenge to the business. Where a smaller and less complex subsidiary proposes not to have an independent non-executive chair, the firm should still be able to explain how its governance arrangements will otherwise satisfy the need for independent oversight of the executives. Moreover, all firms have an obligation to ensure that all their directors, in particular non-executives, act with sufficient independence of mind and ‘make their own sound, objective and independent decisions and judgments when performing their functions and responsibilities’. 28 The non-executive directors on the board should hold management to account against the matters delegated, and be able to challenge the executive effectively and promptly. Firms should have regard to the expectations on board responsibilities outlined in SS5/16 ‘Corporate governance: Board responsibilities’. 29", "target_text": "28. Joint European Securities and Markets Authority (ESMA) and EBA Guidelines on the assessment of the suitability of members of the management body, paragraph 80. https://eba.europa.eu/regulation-and-policy/internal-governance/joint-esma-and-eba-guidelines-on-the-assessment-of-the-suitability-of-members-of-the-management-body . See also the General Organisational Requirements Part of the PRA Rulebook"}}
{"qa_uid": "10932d609710049c", "method": "DPEL", "persona": "professional", "question": "When a firm is assessing whether a basic own funds item should be treated as Tier 1, how should it connect the general classification criteria and list of own funds items in Own Funds 3A–3J with the TARGET rule that deems certain basic own funds items to have specified characteristics (including the 3B feature test)?", "expected_answer": "A firm should treat the TARGET provision as a specific Tier 1 classification instruction that operates within the broader Own Funds 3A–3J framework, which provides the list of own funds items and the criteria used to classify items into Tier 1, Tier 2, or Tier 3. [#SRC:a4fc956f9cccdf5a] In practice, for the “basic own funds items” covered by the TARGET text, the firm must deem those items to substantially possess the characteristics referenced in 3.5, assessed in light of the features referenced in 3.6, and then classify them as Tier 1 own funds when (and only when) the items display all of the features set out in 3B. [#TGT:6b2cbcf4cc3413b4] This means the firm’s classification decision is not made in isolation: it is a Tier 1 outcome that must be recorded as part of the overall Tier 1/Tier 2/Tier 3 classification approach described across Own Funds 3A–3J. [#SRC:a4fc956f9cccdf5a] Conversely, if a basic own funds item does not meet the “all features in 3B” condition, the TARGET instruction to classify it as Tier 1 is not triggered, and the firm would need to apply the general Own Funds 3A–3J classification criteria to determine the appropriate tier. [#TGT:6b2cbcf4cc3413b4] [#SRC:a4fc956f9cccdf5a]", "pair_uid": "ac7053995d78f7f7", "source_passage_uid": "a4fc956f9cccdf5a", "target_passage_uid": "6b2cbcf4cc3413b4", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536239, "run_seed": 13, "debug_context": {"source_text": "(c) Own Funds 3A - 3J set out a list of own funds items and the criteria for classifying them as Tier 1 own funds, Tier 2 own funds or Tier 3 own funds.", "target_text": "The following basic own funds items shall be deemed to substantially possess the characteristics set out in 3.5 , taking into consideration the features set out in 3.6 , and a firm must classify them as Tier 1 own funds , where the following items display all of the features set out in 3B :"}}
{"qa_uid": "0cca42b6b6bf4699", "method": "DPEL", "persona": "basic", "question": "If a firm has a basic own funds item, what does it need to check to decide it must be Tier 1, and how does that fit with the wider Own Funds 3A–3J material that lists own funds items and how to classify them into tiers?", "expected_answer": "For a basic own funds item, the firm should use the TARGET rule as the direct test for when that item must be treated as Tier 1, and then place that result into the wider tiering framework described in Own Funds 3A–3J. [#TGT:6b2cbcf4cc3413b4] [#SRC:a4fc956f9cccdf5a] Specifically, the TARGET text says certain basic own funds items are treated as substantially having the characteristics referenced in 3.5, assessed while taking into account the features referenced in 3.6, and the firm must classify them as Tier 1 own funds where the items show all of the features set out in 3B. [#TGT:6b2cbcf4cc3413b4] Own Funds 3A–3J matters because it is the part that sets out the list of own funds items and the criteria used to classify items as Tier 1, Tier 2, or Tier 3, so the firm’s Tier 1 decision for these basic items sits within that overall classification structure. [#SRC:a4fc956f9cccdf5a] If the item does not display all of the 3B features, the TARGET condition for mandatory Tier 1 classification is not met, so the firm would need to rely on the broader Own Funds 3A–3J criteria to determine whether the item belongs in Tier 2 or Tier 3 instead of Tier 1. [#TGT:6b2cbcf4cc3413b4] [#SRC:a4fc956f9cccdf5a]", "pair_uid": "ac7053995d78f7f7", "source_passage_uid": "a4fc956f9cccdf5a", "target_passage_uid": "6b2cbcf4cc3413b4", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536239, "run_seed": 13, "debug_context": {"source_text": "(c) Own Funds 3A - 3J set out a list of own funds items and the criteria for classifying them as Tier 1 own funds, Tier 2 own funds or Tier 3 own funds.", "target_text": "The following basic own funds items shall be deemed to substantially possess the characteristics set out in 3.5 , taking into consideration the features set out in 3.6 , and a firm must classify them as Tier 1 own funds , where the following items display all of the features set out in 3B :"}}
{"qa_uid": "d89db7abf8688f9e", "method": "DPEL", "persona": "professional", "question": "When calculating the risk-weighted exposure amounts for an institution’s trade exposures with CCPs for the purposes of Article 92(3), how should the institution treat assets posted as collateral to a CCP or a clearing member that are bankruptcy remote if the CCP, the clearing member, or other clients of the clearing member become insolvent, and how does that treatment feed into the sum-and-risk-weight calculation?", "expected_answer": "In calculating risk-weighted exposure amounts for trade exposures with CCPs for the purposes of Article 92(3), the institution’s baseline approach is to add up the exposure values of its trade exposures with CCPs (as determined under the relevant calculation paragraphs) and then apply the applicable risk weight to that total. [#SRC:99cd1305ee2e0e40] However, there is a specific derogation for certain collateral: where assets posted as collateral to a CCP or a clearing member are bankruptcy remote in the event of insolvency of the CCP, the clearing member, or one or more other clients of the clearing member, the institution is permitted to set the exposure value for the counterparty credit risk exposures for those assets to zero. [#TGT:3efc66c18754eca4] Practically, this means that, for the qualifying bankruptcy-remote collateral assets, the exposure value component that would otherwise be included in the summed exposure values can be reduced to zero, and the resulting (potentially lower) sum is then multiplied by the risk weight determined under the risk-weight determination paragraph. [#SRC:99cd1305ee2e0e40] The zero exposure value treatment is limited to the counterparty credit risk exposures for those assets and applies only when the stated bankruptcy-remote condition in the specified insolvency scenarios is met. [#TGT:3efc66c18754eca4]", "pair_uid": "268ee08a549884e4", "source_passage_uid": "99cd1305ee2e0e40", "target_passage_uid": "3efc66c18754eca4", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536255, "run_seed": 13, "debug_context": {"source_text": "An institution shall calculate the risk-weighted exposure amounts for its trade exposures with CCPs for the purposes of Article 92(3) as the sum of the exposure values of its trade exposures with CCPs, calculated in accordance with paragraphs 2 and 3 of this Article, multiplied by the risk weight determined in accordance with paragraph 1 of this Article.", "target_text": "By way of derogation from paragraph 1 , where assets posted as collateral to a CCP or a clearing member are bankruptcy remote in the event that the CCP, the clearing member or one or more of the other clients of the clearing member becomes insolvent, an institution may attribute an exposure value of zero to the counterparty credit risk exposures for those assets."}}
{"qa_uid": "c6879fbe72fde923", "method": "DPEL", "persona": "basic", "question": "If an institution is adding up its exposure values for trade exposures with CCPs and then applying a risk weight, can it ever treat collateral posted to a CCP or a clearing member as having zero exposure value? If yes, when, and how does that change the total used for the risk-weighted exposure amount?", "expected_answer": "Yes. The general method for risk-weighted exposure amounts for an institution’s trade exposures with CCPs (for Article 92(3)) is to take the sum of the exposure values of those trade exposures (calculated under the specified paragraphs) and multiply that sum by the relevant risk weight. [#SRC:99cd1305ee2e0e40] But an exception is available for certain collateral: if assets posted as collateral to a CCP or a clearing member are bankruptcy remote when the CCP, the clearing member, or one or more other clients of the clearing member becomes insolvent, the institution may assign an exposure value of zero to the counterparty credit risk exposures for those assets. [#TGT:3efc66c18754eca4] That zero value then affects the overall calculation because the summed exposure values used as the base for the risk-weight multiplication can exclude (by setting to zero) the exposure value attributable to those qualifying collateral assets. [#SRC:99cd1305ee2e0e40] This zeroing is not automatic for all collateral; it is tied to the bankruptcy-remote condition and the listed insolvency events, and it applies specifically to the counterparty credit risk exposures for those assets. [#TGT:3efc66c18754eca4]", "pair_uid": "268ee08a549884e4", "source_passage_uid": "99cd1305ee2e0e40", "target_passage_uid": "3efc66c18754eca4", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536255, "run_seed": 13, "debug_context": {"source_text": "An institution shall calculate the risk-weighted exposure amounts for its trade exposures with CCPs for the purposes of Article 92(3) as the sum of the exposure values of its trade exposures with CCPs, calculated in accordance with paragraphs 2 and 3 of this Article, multiplied by the risk weight determined in accordance with paragraph 1 of this Article.", "target_text": "By way of derogation from paragraph 1 , where assets posted as collateral to a CCP or a clearing member are bankruptcy remote in the event that the CCP, the clearing member or one or more of the other clients of the clearing member becomes insolvent, an institution may attribute an exposure value of zero to the counterparty credit risk exposures for those assets."}}
{"qa_uid": "c756874f2c8266ee", "method": "DPEL", "persona": "professional", "question": "How should a firm structure its liquidity contingency plan 16 in relation to its recovery plan, given that Rule 12 of the Internal Liquidity Adequacy Assessment Part of the PRA Rulebook sets requirements for the liquidity contingency plan, and what is the PRA’s expectation if the firm keeps the documents separate?", "expected_answer": "A firm should generally aim to produce a single integrated document that combines its liquidity contingency plan 16 (contingency funding plan) with its recovery plan, while ensuring that the liquidity contingency plan component meets the requirements set out for it in Rule 12 of the Internal Liquidity Adequacy Assessment Part of the PRA Rulebook. [#SRC:d6da2dce246d82de] [#TGT:856519b5145b9260] The integration is intended to support a coherent process for being alerted to and responding to a liquidity stress, and to promote a coherent risk management framework across liquidity contingency planning and recovery planning. [#SRC:d6da2dce246d82de] If the firm maintains separate documents, the PRA recognises this may be necessary in some cases, for example where local regulators’ requirements drive separation; however, the PRA expects such separation to be uncommon. [#SRC:d6da2dce246d82de] In those exceptional cases, the firm should ensure the separate liquidity contingency plan 16 document (which remains subject to Rule 12 requirements) and the separate recovery plan are consistent with each other, so that the overall approach remains coherent even though it is not presented in a single integrated document. [#SRC:d6da2dce246d82de] [#TGT:856519b5145b9260]", "pair_uid": "01cf27de180d12a3", "source_passage_uid": "d6da2dce246d82de", "target_passage_uid": "856519b5145b9260", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536273, "run_seed": 13, "debug_context": {"source_text": "Firms are strongly encouraged to combine their liquidity contingency plan 16 (also known as a contingency funding plan) and their recovery plan into one integrated document. This would ensure that the firm has a coherent process for being alerted to and addressing a liquidity stress and helps to ensure a coherent risk management framework. The PRA recognises that there may be some instances when it is necessary to maintain separate documents (eg due to requirements of local regulators), but expects this to be the exception and that any separate documents should be consistent with each other.", "target_text": "16. Rule 12 of the Internal Liquidity Adequacy Assessment Part of the PRA Rulebook sets out the requirements a firm needs to meet in relation to its liquidity contingency plan."}}
{"qa_uid": "23b0c9080de3439e", "method": "DPEL", "persona": "basic", "question": "If a firm is writing its liquidity contingency plan 16 and also has a recovery plan, should it put them in one document or two, and what does it need to keep in mind about Rule 12?", "expected_answer": "The PRA’s preferred approach is for the firm to combine its liquidity contingency plan 16 (contingency funding plan) and its recovery plan into one integrated document, rather than keeping them as separate papers. [#SRC:d6da2dce246d82de] When doing so, the firm still needs to ensure that the liquidity contingency plan 16 element satisfies the requirements that apply to it under Rule 12 of the Internal Liquidity Adequacy Assessment Part of the PRA Rulebook. [#TGT:856519b5145b9260] [#SRC:d6da2dce246d82de] The reason for integrating the documents is to help the firm run a coherent process for being alerted to a liquidity stress and for addressing it, and to support a coherent risk management framework across these planning activities. [#SRC:d6da2dce246d82de] The PRA accepts that there can be situations where separate documents are necessary, such as where local regulators’ requirements make separation needed, but it expects this to be unusual. [#SRC:d6da2dce246d82de] If the firm does keep them separate, it should treat that as an exception and make sure the separate documents are consistent with each other, while continuing to meet the Rule 12 requirements for the liquidity contingency plan 16. [#SRC:d6da2dce246d82de] [#TGT:856519b5145b9260]", "pair_uid": "01cf27de180d12a3", "source_passage_uid": "d6da2dce246d82de", "target_passage_uid": "856519b5145b9260", "gen_model": "gpt-5.2-MBZUAI", "gen_ts": 1769536273, "run_seed": 13, "debug_context": {"source_text": "Firms are strongly encouraged to combine their liquidity contingency plan 16 (also known as a contingency funding plan) and their recovery plan into one integrated document. This would ensure that the firm has a coherent process for being alerted to and addressing a liquidity stress and helps to ensure a coherent risk management framework. The PRA recognises that there may be some instances when it is necessary to maintain separate documents (eg due to requirements of local regulators), but expects this to be the exception and that any separate documents should be consistent with each other.", "target_text": "16. Rule 12 of the Internal Liquidity Adequacy Assessment Part of the PRA Rulebook sets out the requirements a firm needs to meet in relation to its liquidity contingency plan."}}
